后面数字就是贴图后面的序数
对应的物品 用对应序数的贴图
	
	//树苗 1
//	叶子 1
//恶魂之泪 0
//腐肉 2
//蜘蛛眼 3
//蒲公英 14
	//罂粟 5
	//兰花 6
	//小花 4
	//茜草花 7
//	红色郁金香 8
	//橙色郁金香 9
//白色郁金香 0
//粉色郁金香 10
//雏菊 7
//向日葵 14
//丁香 4
//高草丛 1
//大型蕨 1
//玫瑰丛 8
//牡丹 10
//棕色蘑菇 11
//红色蘑菇 12
//小麦 14
//面包 13
//南瓜饼 2
//鸡蛋 13
//生猪排 15
//熟猪排 14
//生牛排 8
//熟牛排 16
//生羊排 8
//熟羊排 16
//鸡肉 12
//熟鸡肉 2
//生兔肉 12
//熟兔肉 2
//生鱼 17
//熟鱼 18
//鲑鱼 5
//熟鲑鱼 2
//小丑鱼 9
//河豚 20





//苹果 8
//金苹果 14
//西瓜 8
//西瓜方块 8
//南瓜 13
//仙人掌 19
//胡萝卜 9
//生/熟土豆 13
//毒土豆 19
//荷叶 1
//藤蔓 1
//地狱疣 5
//甘蔗 19
//丝线 0
灰烬 20