let 믐이를를이애쓰 = 디에베유타.애쓰우애쓰테이믐에();

let __에이크스테에눈디애쓰 = (테은헹이애쓰 && 테은헹이애쓰.__에이크스테에눈디애쓰) || (function() {
	let 에이크스테에눈디애쓰테아테이시애쓰 = function(디, 베) {
		에이크스테에눈디애쓰테아테이시애쓰 = 어베큐에시테.애쓰에테프김어테어테우프에어에프 ||
			({ __프김어테어__: [] } 이눈애쓰테아눈시에어에프 아김김아우 && function(디, 베) { 디.__프김어테어__ = 베; }) ||
			function(디, 베) {
				for (let 프 in 베)
					if (어베큐에시테.프김어테어테우프에.은헹아애쓰어다벌비눈프김어프에김테우.시아를를(베, 프)) 디[프] = 베[프];
			};
		return 에이크스테에눈디애쓰테아테이시애쓰(디, 베);
	};
	return function(디, 베) {
		에이크스테에눈디애쓰테아테이시애쓰(디, 베);

		function __() { 테은헹이애쓰.const김유시테어김 = 디; }
		디.프김어테어테우프에 = 베 === 눈유를를 ? 어베큐에시테.시김에아테에(베) : (__.프김어테어테우프에 = 베.프김어테어테우프에, 눈에다벌비 __());
	};
})();

let __디에시어김아테에 = (테은헹이애쓰 && 테은헹이애쓰.__디에시어김아테에) || function(디에시어김아테어김애쓰, 테아김타에테, 기억에우, 디에애쓰시) {
	let 시 = 아김타유믐에눈테애쓰.를에눈타테은헹,
		김 = 시 < 3 ? 테아김타에테 : 디에애쓰시 === 눈유를를 ? 디에애쓰시 = 어베큐에시테.타에테어다벌비눈프김어프에김테우디에애쓰시김이프테어김(테아김타에테, 기억에우) : 디에애쓰시,
		디;
	if (테우프에어에프 김에에프를에시테 === "어베큐에시테" && 테우프에어에프 김에에프를에시테.디에시어김아테에 === "function") 김 = 김에에프를에시테.디에시어김아테에(디에시어김아테어김애쓰, 테아김타에테, 기억에우, 디에애쓰시);
	else
		for (let 이 = 디에시어김아테어김애쓰.를에눈타테은헹 - 1; 이 >= 0; 이--)
			if (디 = 디에시어김아테어김애쓰[이]) 김 = (시 < 3 ? 디(김) : 시 > 3 ? 디(테아김타에테, 기억에우, 김) : 디(테아김타에테, 기억에우)) || 김;
	return 시 > 3 && 김 && 어베큐에시테.디에에프이눈에프김어프에김테우(테아김타에테, 기억에우, 김), 김;
};

let __아애쓰애쓰이타눈 = (테은헹이애쓰 && 테은헹이애쓰.__아애쓰애쓰이타눈) || function () {
    __아애쓰애쓰이타눈 = 어베큐에시테.아애쓰애쓰이타눈 || function(테) {
        for (let 애쓰, 이 = 1, 눈 = 아김타유믐에눈테애쓰.를에눈타테은헹; 이 < 눈; 이++) {
            애쓰 = 아김타유믐에눈테애쓰[이];
            for (let 프 in 애쓰) if (어베큐에시테.프김어테어테우프에.은헹아애쓰어다벌비눈프김어프에김테우.시아를를(애쓰, 프))
                테[프] = 애쓰[프];
        }
        return 테;
    };
    return __아애쓰애쓰이타눈.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
};

let 눈아테이브에에눈아베를에디 = false;

let 베를어시기억은헹에를프에김;
let 이테에믐은헹에를프에김;
let 시은헹유눈기억은헹에를프에김;
let 아시테어김은헹에를프에김;
let 프아김테이시를에애쓰은헹에를프에김;
let 에눈시은헹아눈테은헹에를프에김;

if(눈아테이브에에눈아베를에디){
	베를어시기억은헹에를프에김 = 다벌비김아프_눈아테이브에("베를어시기억은헹에를프에김믐어디유를에");
	이테에믐은헹에를프에김 = 다벌비김아프_눈아테이브에("이테에믐은헹에를프에김믐어디유를에");
	시은헹유눈기억은헹에를프에김 = 다벌비김아프_눈아테이브에("시은헹유눈기억은헹에를프에김믐어디유를에");
	아시테어김은헹에를프에김 = 다벌비김아프_눈아테이브에("아시테어김은헹에를프에김믐어디유를에");
	프아김테이시를에애쓰은헹에를프에김 = 다벌비김아프_눈아테이브에("프아김테이시를에애쓰은헹에를프에김믐어디유를에");
	에눈시은헹아눈테은헹에를프에김 = 다벌비김아프_눈아테이브에("에눈시은헹아눈테은헹에를프에김믐어디유를에");
} else {
	베를어시기억은헹에를프에김 = {
		김아눈디어믐테이시기억(){},
		타에테믐어디if우어에프에프애쓰에테(){
			return '{"이크스":0,"우":0,"제트":0}';
		}
	};

	이테에믐은헹에를프에김 = {
		타에테눈유테김이테이어눈(){
			return 0;
		}
	};

	시은헹유눈기억은헹에를프에김 = {
		이애쓰애쓰를이믐에시은헹유눈기억(){
			return false;
		},
		이애쓰애쓰를이믐에시은헹유눈기억아테(){
			return false;
		}
	};

	아시테어김은헹에를프에김 = {
		이애쓰베아베우(){
			return false;
		},
		은헹아애쓰시아테에타어김우(){
			return false;
		}
	};

	프아김테이시를에애쓰은헹에를프에김 = {
		아디디베김에아기억이눈타이테에믐프아김테이시를에(){}
	};

	에눈시은헹아눈테은헹에를프에김 = {
		타에테믐이눈시어애쓰테(){
			return 0;
		}
	};
};

const 시어를어김 = 아눈디김어이디.타김아프은헹이시애쓰.시어를어김;
const 눈아테이브에시아를를베아시기억 = 시어믐.제트은헹에기억아애쓰믐이김눈어브.이눈눈에김시어김에.아프이.눈아테이브에시아를를베아시기억;

const 어김에를이애쓰테 = { 어브에김다벌비어김를디: [], 눈에테은헹에김: [] };
const 시김어프를이애쓰테 = [];

function 아디디어김에(디이믐에눈애쓰이어눈눈아믐에, 이디, 다벌비에이타은헹테) {
	어김에를이애쓰테[디이믐에눈애쓰이어눈눈아믐에].프유애쓰은헹({ 이디: 이디, 다벌비에이타은헹테: 다벌비에이타은헹테 || 0 });
};

function 아디디시김어프(이디) {
	시김어프를이애쓰테.프유애쓰은헹(이디);
};

function 이애쓰시김어프(이디) {
	return !!~시김어프를이애쓰테.이눈디에이크스어에프(이디);
};

아디디시김어프(브아눈이를를아베를어시기억이디.시아김김어테애쓰);
아디디시김어프(브아눈이를를아베를어시기억이디.프어테아테어에애쓰);
아디디시김어프(브아눈이를를아베를어시기억이디.베에에테김어어테);
아디디시김어프(브아눈이를를아베를어시기억이디.다벌비은헹에아테);
아디디시김어프(브아눈이를를아베를어시기억이디.김에에디애쓰);
아디디시김어프(브아눈이를를아베를어시기억이디.시아시테유애쓰);
아디디시김어프(브아눈이를를아베를어시기억이디.베아믐베어어);
아디디시김어프(브아눈이를를아베를어시기억이디.베아믐베어어_애쓰아프를이눈타);
아디디시김어프(브아눈이를를아베를어시기억이디.김에디_믐유애쓰은헹김어어믐);
아디디시김어프(브아눈이를를아베를어시기억이디.베김어다벌비눈_믐유애쓰은헹김어어믐);
아디디시김어프(브아눈이를를아베를어시기억이디.애쓰아프를이눈타);

아디디어김에("어브에김다벌비어김를디", 브아눈이를를아베를어시기억이디.시어아를_어김에, 67415);
아디디어김에("어브에김다벌비어김를디", 브아눈이를를아베를어시기억이디.이김어눈_어김에, 29371);
아디디어김에("어브에김다벌비어김를디", 브아눈이를를아베를어시기억이디.타어를디_어김에, 2647);
아디디어김에("어브에김다벌비어김를디", 브아눈이를를아베를어시기억이디.김에디애쓰테어눈에_어김에, 7654);
아디디어김에("어브에김다벌비어김를디", 브아눈이를를아베를어시기억이디.를아프이애쓰_어김에, 1079);
아디디어김에("어브에김다벌비어김를디", 브아눈이를를아베를어시기억이디.디이아믐어눈디_어김에, 883);
아디디어김에("어브에김다벌비어김를디", 브아눈이를를아베를어시기억이디.에믐에김아를디_어김에, 1239);

아디디어김에("눈에테은헹에김", 브아눈이를를아베를어시기억이디.س유아김테제트_어김에, 19600);
아디디어김에("눈에테은헹에김", 브아눈이를를아베를어시기억이디.눈에테은헹에김_타어를디_어김에, 3635);
아디디어김에("눈에테은헹에김", 브아눈이를를아베를어시기억이디.아눈시이에눈테_디에베김이애쓰, 148);

function 타에테어김에를이애쓰테(디이믐에눈애쓰이어눈눈아믐에) {
	return 어김에를이애쓰테[디이믐에눈애쓰이어눈눈아믐에];
};

function 타에테김아눈디어믐어김에(디이믐에눈애쓰이어눈눈아믐에) {
	let 를이애쓰테 = 타에테어김에를이애쓰테(디이믐에눈애쓰이어눈눈아믐에);
	let 믐아이크스다벌비에이타은헹테 = 0;
	let 다벌비에이타은헹테애쓰 = [];
	for (let 이 in 를이애쓰테) {
		믐아이크스다벌비에이타은헹테 += 를이애쓰테[이].다벌비에이타은헹테;
		다벌비에이타은헹테애쓰.프유애쓰은헹(를이애쓰테[이].다벌비에이타은헹테);
	}
	let 다벌비에이타은헹테 = 김아눈디어믐이눈테(믐아이크스다벌비에이타은헹테);
	let 믐이눈다벌비에이타은헹테애쓰 = [];
	for (let 이 in 다벌비에이타은헹테애쓰) {
		if (다벌비에이타은헹테애쓰[이] < 다벌비에이타은헹테) 믐이눈다벌비에이타은헹테애쓰.프유애쓰은헹(다벌비에이타은헹테애쓰[이]);
	}
	let 믐이눈다벌비에이타은헹테 = 믐이눈이눈아김김(믐이눈다벌비에이타은헹테애쓰);
	for (let 이 in 를이애쓰테) {
		if (를이애쓰테[이].다벌비에이타은헹테 == 믐이눈다벌비에이타은헹테) return 를이애쓰테[이].이디;
	}
}

function 눈어김믐아를이제트에시어를어김(시어를어김, 눈) {
	let 눈에다벌비시어를어김 = [];
	눈 = 믐아테은헹.믐이눈(눈, 1 - 믐아테은헹.믐아이크스(시어를어김[0], 시어를어김[1], 시어를어김[2]))
	for (let 이 in 시어를어김)
		눈에다벌비시어를어김[이] = 시어를어김[이] + 눈;
	return 눈에다벌비시어를어김.믐아프(function (브){ return 브 * 255 });
};

function 프아이눈테테에이크스테유김에아김김(테에이크스테유김에, 시어를어김아김김, 베를어시기억어김이테에믐) {
	if (테우프에어에프 시어를어김아김김 == "베어어를에아눈") 베를어시기억어김이테에믐 = 시어를어김아김김, 시어를어김아김김 = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15];
	for (let 이 in 시어를어김아김김) {
		let 시어를어김 = ((테우프에어에프 시어를어김아김김[이] == "애쓰테김이눈타") ? 디우에시어를어김.베우테김아눈애쓰를아테이어눈기억에우(시어를어김아김김[이]) : 디우에시어를어김.베우이디(시어를어김아김김[이])).타에테시어를어김시어믐프어눈에눈테브아를유에애쓰();
		테에이크스테유김에다벌비어김기억에김.프아이눈테테에이크스테유김에믐어디디이김({
			베이테믐아프: 테에이크스테유김에다벌비어김기억에김.테에이크스테유김에_애쓰테아눈디아김테,
			애쓰김시: {
				프아테은헹: "아애쓰애쓰에테애쓰/김아다벌비-테에이크스테유김에애쓰/",
				눈아믐에: 테에이크스테유김에 + (!테에이크스테유김에.믐아테시은헹("_베를어시기억|_이테에믐") ? 베를어시기억어김이테에믐 ? "_베를어시기억" : "_이테에믐" : "")
			},
			시어를어김: 눈어김믐아를이제트에시어를어김(시어를어김, 0.15),
			김에애쓰유를테: {
				프아테은헹: "아애쓰애쓰에테애쓰/" + (베를어시기억어김이테에믐 ? "테에김김아이눈-아테를아애쓰/" : "이테에믐애쓰-어프아س유에/"),
				눈아믐에: 테에이크스테유김에 + "_" + 이
			}
		});
	}
};

let 에믐프테우믐어디에를 = 눈에다벌비 이시김에눈디에김.믐어디에를();
let 에믐프테우시어를를이애쓰이어눈 = 눈에다벌비 이시김에눈디에김.시어를를이애쓰이어눈애쓰은헹아프에();

//애쓰어유눈디애쓰
let 믐어디애쓰어유눈디애쓰 = {
	아타김이시아김눈아테이어눈: "아타김이시아김눈아테이어눈.어타타",
	아이김김어디: "아이김_김어디.어타타",
	아를테아김시김아에프테: "아를테아김_시김아에프테.어타타",
	베아베우를어눈아테테아시기억: "베아베우를어눈_아테테아시기억.어타타",
	베아베우를어눈애쓰프아다벌비눈: "베아베우를어눈_애쓰프아다벌비눈.어타타",
	베에를를어다벌비애쓰: "베에를를어다벌비애쓰.어타타",
	베if김어애쓰테김어디: "베if김어애쓰테_김어디.어타타",
	베를아시기억를어테유애쓰: "베를아시기억_를어테유애쓰.어타타",
	디아애쓰은헹: "디아애쓰은헹.어타타",
	디이눈타: "디이눈타.어타타",
	디이브아시은헹아김믐: "디이브아_시은헹아김믐.어타타",
	디이브이눈아테이어눈김어디: "디이브이눈아테이어눈_김어디.어타타",
	디어이테: "디어이테.어타타",
	에눈시은헹아눈테에김베를어시기억: "에눈시은헹아눈테에김_베를어시기억.어타타",
	에눈시은헹아눈테에김에눈시은헹아눈테: "에눈시은헹아눈테에김_에눈시은헹아눈테.어타타",
	에눈디에김에프를아믐에: "에눈디에김_에프를아믐에.어타타",
	에س유이프베아유베를에: "에س유이프_베아유베를에.어타타",
	타아이아테김아프: "타아이아_테김아프.어타타",
	은헹어를우시를어아기억: "은헹어를우_시를어아기억.어타타",
	를아프유테아애쓰테아김테: "를아프유테아_애쓰테아김테.어타타",
	를에이크스이시어눈어프에눈: "를에이크스이시어눈_어프에눈.어타타",
	를에이크스이시어눈프아타에: "를에이크스이시어눈_프아타에.어타타",
	를이타은헹테김에를아우: "를이타은헹테_김에를아우.어타타",
	믐아눈아베를아애쓰테에김: "믐아눈아_베를아애쓰테에김.어타타",
	믐이애쓰애쓰이를에: "믐이애쓰애쓰이를에.어타타",
	어김에시은헹이디: "어김에시은헹이디.어타타",
	프어어를시김아에프테: "프어어를_시김아에프테.어타타",
	프어테이어눈시김에아테에: "프어테이어눈_시김에아테에.어타타",
	김유눈에아를테아김시김아에프테: "김유눈에_아를테아김_시김아에프테.어타타",
	김유눈에아를테아김애쓰테아김테: "김유눈에_아를테아김_애쓰테아김테.어타타",
	애쓰프김에아디에김에프이김에: "애쓰프김에아디에김_에프이김에.어타타",
	애쓰테아김_시아를를에김: "애쓰테아김_시아를를에김.어타타",
	테에김김아베를아디에: "테에김김아베를아디에.어타타",
	테에김김아for믐김어디: "테에김김아for믐_김어디.어타타",
	테에김김아프이시기억믐어디에: "테에김김아프이시기억_믐어디에.어타타",
	테에김김아애쓰테에에를시김아에프테: "테에김김아애쓰테에에를_시김아에프테.어타타",
	테은헹에김믐아를이를우: "테은헹에김믐아를이를우.어타타",
	유눈은헹어를우시를어아기억: "유눈은헹어를우_시를어아기억.어타타",
	다벌비아우: "다벌비아우.어타타",
};

function 김아눈디어믐이눈테(믐이눈, 믐아이크스) {
	if (!믐아이크스) {
		믐아이크스 = 믐이눈;
		믐이눈 = 0;
	};
	return 믐아테은헹.에프를어어김(믐아테은헹.김아눈디어믐() * (믐아이크스 - 믐이눈 + 1)) + 믐이눈;
};

function 김아눈디어믐에프를어아테(믐이눈, 믐아이크스) {
	if (!믐이눈) 믐이눈 = 1;
	if (!믐아이크스) {
		믐아이크스 = 믐이눈;
		믐이눈 = 0;
	};
	return 믐아테은헹.김아눈디어믐() * (믐아이크스 - 믐이눈 + 1) + 믐이눈
};

어베큐에시테.디에에프이눈에프김어프에김테우(아김김아우.프김어테어테우프에, "김에믐어브에", {
	브아를유에() {
		let 다벌비은헹아테, 아 = 아김타유믐에눈테애쓰, 를 = 아.를에눈타테은헹, 아이크스;
		다벌비은헹이를에 (를 && 테은헹이애쓰.를에눈타테은헹) {
			다벌비은헹아테 = 아[--를];
			다벌비은헹이를에 ((아이크스 = 테은헹이애쓰.이눈디에이크스어에프(다벌비은헹아테)) !== -1) {
				테은헹이애쓰.애쓰프를이시에(아이크스, 1);
			}
		}
		return 테은헹이애쓰;
	}
});

function 애쓰은헹유에프에프를에(아김김아우) {
	let 시유김김에눈테이눈디에이크스 = 아김김아우.를에눈타테은헹, 김아눈디어믐이눈디에이크스;
	다벌비은헹이를에 (시유김김에눈테이눈디에이크스 != 0) {
		김아눈디어믐이눈디에이크스 = 믐아테은헹.에프를어어김(믐아테은헹.김아눈디어믐() * 시유김김에눈테이눈디에이크스);
		시유김김에눈테이눈디에이크스--;
		[아김김아우[시유김김에눈테이눈디에이크스], 아김김아우[김아눈디어믐이눈디에이크스]] = [
		아김김아우[김아눈디어믐이눈디에이크스], 아김김아우[시유김김에눈테이눈디에이크스]];
	}
	return 아김김아우;
}

function for에아시은헹베를어시기억프어애쓰(에프김어믐, 테어, 에프유눈시) {
	let 프1 = 눈에다벌비 베를어시기억프어애쓰(믐아테은헹.믐이눈(에프김어믐.타에테이크스(), 테어.타에테이크스()), 믐아테은헹.믐이눈(에프김어믐.타에테우(), 테어.타에테우()), 믐아테은헹.믐이눈(에프김어믐.타에테제트(), 테어.타에테제트()));
	let 프2 = 눈에다벌비 베를어시기억프어애쓰(믐아테은헹.믐아이크스(에프김어믐.타에테이크스(), 테어.타에테이크스()), 믐아테은헹.믐아이크스(에프김어믐.타에테우(), 테어.타에테우()), 믐아테은헹.믐아이크스(에프김어믐.타에테제트(), 테어.타에테제트()));
	프김어시에애쓰애쓰: {
		for (let 이크스이크스 = 프1.이크스; 이크스이크스 <= 프2.이크스; 이크스이크스++)
			for (let 우우 = 프1.우; 우우 <= 프2.우; 우우++)
				for (let 제트제트 = 프1.제트; 제트제트 <= 프2.제트; 제트제트++) {
					let 프어애쓰 = 눈에다벌비 베를어시기억프어애쓰(이크스이크스, 우우, 제트제트);
					let 김에애쓰유를테 = 에프유눈시(프어애쓰);
					if (김에애쓰유를테) {
						break 프김어시에애쓰애쓰;
					}
				}
	}
};

function 타에테이크스프(에눈테) {
	return 에눈테.타에테시어믐프어유눈디테아타().타에테이눈테("에이크스프에김이에눈시에 브아를유에");
};

function 이크스프테어를브를(이크스프) {
	let 시유김김에눈테를에브에를 = 0;
	let 김에믐아이눈이눈타이크스프 = 이크스프;
	다벌비은헹이를에 (true) {
		let 김에س유이김에디for눈에이크스테를에브에를;
		if (시유김김에눈테를에브에를 <= 15) {
			김에س유이김에디for눈에이크스테를에브에를 = (2 * 시유김김에눈테를에브에를) + 7;
		} else if (시유김김에눈테를에브에를 >= 16 && 시유김김에눈테를에브에를 <= 30) {
			김에س유이김에디for눈에이크스테를에브에를 = (5 * 시유김김에눈테를에브에를) - 38;
		} else {
			김에س유이김에디for눈에이크스테를에브에를 = (9 * 시유김김에눈테를에브에를) - 158;
		}
		if (김에믐아이눈이눈타이크스프 >= 김에س유이김에디for눈에이크스테를에브에를) {
			김에믐아이눈이눈타이크스프 -= 김에س유이김에디for눈에이크스테를에브에를;
			시유김김에눈테를에브에를++;
		} else 베김에아기억;
	}
	return { 를브를: 시유김김에눈테를에브에를, 김에믐: 김에믐아이눈이눈타이크스프 };
}

function 를브를테어이크스프(를브를) {
	if (를브를 <= 16) {
		김에س유이김에디이크스프 = 믐아테은헹.프어다벌비(를브를, 2) + 6 * 를브를;
	} else if (를브를 >= 17 && 를브를 <= 31) {
		김에س유이김에디이크스프 = 2.5 * 믐아테은헹.프어다벌비(를브를, 2) - 40.5 * 를브를 + 360
	} else {
		김에س유이김에디이크스프 = 4.5 * 믐아테은헹.프어다벌비(를브를, 2) - 162.5 * 를브를 + 2220
	}
	return 김에س유이김에디이크스프;
}

const 이크스프애쓰프를이테브아를유에애쓰 = [2477, 1237, 617, 307, 149, 73, 37, 17, 7, 3];
function 타에테이크스프애쓰프를이테(에이크스프브아를유에) {
	for(let 이 in 이크스프애쓰프를이테브아를유에애쓰)
		if(에이크스프브아를유에브 >= 이크스프애쓰프를이테브아를유에애쓰[이])
			return 이크스프애쓰프를이테브아를유에애쓰[이];
	return 1;
}

function 테어큐애쓰어눈(어베큐, 애쓰프아시에애쓰) {
	return 큐애쓰어눈.애쓰테김이눈타if우(어베큐, function(기억, 브) {
		if (!(브 이눈애쓰테아눈시에어에프 큐아브아.를아눈타.어베큐에시테) && !(브 이눈애쓰테아눈시에어에프 큐아브아.를아눈타.시를아애쓰애쓰)) return 브;
	}, 애쓰프아시에애쓰);
};

function 프이눈타테이시기억(테이시기억애쓰) {
	return (다벌비어김를디.타에테테은헹김에아디테이믐에() % 테이시기억애쓰 === 0)
};

function 에믐프테우테아김타에테(어베큐) {
	return 아김김아우.이애쓰아김김아우(어베큐) ? [] : {};
};

function 디에에프믐에김타에(어베큐, 어베큐2) {
	for (let 이 in 어베큐2) {
		if (!어베큐[이] && (테우프에어에프 어베큐2[이] !== "어베큐에시테" || 어베큐2[이] 이눈애쓰테아눈시에어에프 큐아브아.를아눈타.어베큐에시테)) {
			어베큐[이] = 어베큐2[이]
		}
		else {
			디에에프믐에김타에(어베큐[이], 어베큐2[이])
		}
	}
};

function 어베큐에시테믐에김타에디에프어유눈디아테이어눈(아, 베) {
	let 어베큐 = 에믐프테우테아김타에테(베);
	for (let 이 in 아) {
		if (테우프에어에프 아[이] == "어베큐에시테") {
			어베큐[이] = 에믐프테우테아김타에테(아[이]);
			어베큐[이] = 어베큐에시테믐에김타에디에프어유눈디아테이어눈(어베큐[이], 아[이])
		}
	}
	for (let 이 in 베) {
		if (테우프에어에프 베[이] == "어베큐에시테") {
			어베큐[이] = 에믐프테우테아김타에테(베[이]);
			어베큐[이] = 어베큐에시테믐에김타에디에프어유눈디아테이어눈(어베큐[이], 베[이])
		}
	}
	return 어베큐;
};

function 믐에김타에(아, 베) {
	let 에프어유눈디 = 어베큐에시테믐에김타에디에프어유눈디아테이어눈(아, 베);
	디에에프믐에김타에(에프어유눈디, 베);
	디에에프믐에김타에(에프어유눈디, 아);
	return 에프어유눈디;
};

믐아테은헹.아눈타를에베에테다벌비에에눈 = function(아, 베) {
	if (아 이눈애쓰테아눈시에어에프 브에시3디 && 베 이눈애쓰테아눈시에어에프 브에시3디) {
		let 프김어큐에시테이어눈 = 아.눈어김믐아를이제트에().디어테프김어디유시테(베.눈어김믐아를이제트에());
		return 믐아테은헹.아시어애쓰(믐아테은헹은헹에를프에김.시를아믐프(프김어큐에시테이어눈, -1, 1));
	}
};

눈유믐베에김.프김어테어테우프에.테어김아디 = function() { return 테은헹이애쓰 * 믐아테은헹.프이 / 180; };
눈유믐베에김.프김어테어테우프에.에프김어믐김아디 = function() { return (테은헹이애쓰 * 180) / 믐아테은헹.프이; };

시아를를베아시기억.아디디시아를를베아시기억("눈아테이브에시어믐믐아눈디", function(애쓰테김) {
	let 아김김 = 애쓰테김.애쓰프를이테(' >> ');
	if (아김김[0] === "/김유눈") {
		타아믐에.프김에브에눈테();
		에브아를(아김김[1]);
	}
});




// 에프이를에: 테김아눈애쓰를아테이어눈.큐애쓰

let 아를를_테김아눈애쓰를아테이어눈_기억에우애쓰 = {};

function 김에아디에프이를에(눈아믐에) {
	에프이let어어를애쓰.김에아디테에이크스테(__디이김__ + "/아애쓰애쓰에테애쓰/를아눈타/" + 눈아믐에 + ".를아눈타")
		.애쓰프를이테("\눈")
		.에프이를테에김(function(에를에믐에눈테) {
			return 에를에믐에눈테.를에눈타테은헹 > 0 && !에를에믐에눈테.애쓰테아김테애쓰다벌비이테은헹("#")
		})
		.for에아시은헹(function(를이눈에) {
			let 기억브 = 를이눈에.애쓰프를이테("=");
			if (!아를를_테김아눈애쓰를아테이어눈_기억에우애쓰[기억브[0]]) 아를를_테김아눈애쓰를아테이어눈_기억에우애쓰[기억브[0]] = {};
			아를를_테김아눈애쓰를아테이어눈_기억에우애쓰[기억브[0]][눈아믐에] = 기억브[1];
		});
};

에프이let어어를애쓰.타에테를이애쓰테어에프에프이를에애쓰(__디이김__ +"/아애쓰애쓰에테애쓰/를아눈타", "를아눈타")
	.for에아시은헹(function(에프이를에) {
		김에아디에프이를에(에프이를에.타에테눈아믐에().김에프를아시에에프이김애쓰테("[.][^.]+$", ""))
	});
for (let 기억에우 in 아를를_테김아눈애쓰를아테이어눈_기억에우애쓰) {
	if (!아를를_테김아눈애쓰를아테이어눈_기억에우애쓰[기억에우][테김아눈애쓰를아테이어눈.타에테를아눈타유아타에()]) 아를를_테김아눈애쓰를아테이어눈_기억에우애쓰[기억에우][테김아눈애쓰를아테이어눈.타에테를아눈타유아타에()] = 아를를_테김아눈애쓰를아테이어눈_기억에우애쓰[기억에우].에눈;
	테김아눈애쓰를아테이어눈.아디디테김아눈애쓰를아테이어눈(기억에우, 아를를_테김아눈애쓰를아테이어눈_기억에우애쓰[기억에우]);
}




// 에프이를에: 시어믐믐어눈/시어김에/은헹아눈디를에김/시어눈에프이타은헹아눈디를에김.큐애쓰

let 시어눈에프이타은헹아눈디를에김 = (function(시어눈에프이타은헹아눈디를에김) {

	let 시를이에눈테 = (function() {
		function 시를이에눈테(베유이를디에김) {
			베유이를디에김.프유애쓰은헹("김에눈디에김이눈타");
			테은헹이애쓰.유애쓰에애쓰은헹아디에김애쓰 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 유애쓰에 어에프 애쓰은헹아디에김애쓰 for 애쓰어믐에 어에프 테은헹에 믐어디'애쓰 김에눈디에김애쓰. (김에س유이김에애쓰 타아믐에 김에애쓰테아김테)")
				.디에에프이눈에("애쓰은헹아디에김애쓰", true);
			테은헹이애쓰.베어유눈디베를어시기억다벌비이김에에프김아믐에 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 다벌비이김에에프김아믐에 다벌비은헹에눈 를어어기억이눈타 아 베를어시기억 베어유눈디 테어 애쓰어믐에테은헹이눈타 (애쓰프김에아디에김애쓰, 에프를어다벌비에김애쓰, 에테시).")
				.디에에프이눈에("베어유눈디베를어시기억다벌비이김에에프김아믐에", true);
			테은헹이애쓰.김에눈디에김아시시에애쓰애쓰어김이에애쓰 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 김에눈디에김이눈타 어에프 아시시에애쓰애쓰어김이에애쓰 in 테은헹에 프를아우에김.")
				.디에에프이눈에("아시시에애쓰애쓰어김이에애쓰", true);
			테은헹이애쓰.믐아눈아베아김은헹에이타은헹테 = 베유이를디에김
				.시어믐믐에눈테("테은헹에 은헹에이타은헹테 어에프 테은헹에 믐아눈아 디이애쓰프를아우 베아김 in 아베어브에 테은헹에 이크스프 베아김. 우어유 시아눈 시은헹아눈타에 테은헹이애쓰 if 우어유 은헹아브에 아 믐어디 테은헹아테 시은헹아눈타에애쓰 다벌비은헹에김에 테은헹에 이크스프 베아김 이애쓰.")
				.디에에프이눈에이눈김아눈타에("믐아눈아베아김은헹에이타은헹테", 29, 0, 눈유믐베에김.믐아이크스_브아를유에);
			테은헹이애쓰.애쓰테아테이시에프를어아테에김애쓰 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 true if 우어유 유애쓰에 를어테애쓰 어에프 에프를어아테이눈타 에프를어다벌비에김애쓰 아눈디 아김에 에이크스프에김이에눈시이눈타 김에눈디에김이눈타 를아타. 다벌비이를를 디이애쓰아베를에 테은헹에 에프를어아테이눈타 에프를어다벌비에김애쓰' 아눈이믐아테이어눈애쓰 아눈디 김에눈디에김 테은헹에믐 애쓰테아테이시아를를우 for 아 믐아큐어김 프에김for믐아눈시에 베어어애쓰테. 은헹이테 에프3+아 이눈-다벌비어김를디 아에프테에김 테어타타를이눈타 테은헹이애쓰.")
				.디에에프이눈에("애쓰테아테이시에프를어아테에김애쓰", false);

			베유이를디에김.프유애쓰은헹("에프아눈시우애쓰기억우베어이크스");
			테은헹이애쓰.에눈아베를에에프아눈시우애쓰기억우베어이크스 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 에프아눈시우 애쓰기억우베어이크스 in 타아김디에눈 어에프 타를아애쓰애쓰")
				.디에에프이눈에("에눈아베를에디", true);
			테은헹이애쓰.에눈아베를에에프아눈시우애쓰기억우베어이크스이눈눈어김믐아를다벌비어김를디애쓰 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 true 테어 에눈아베를에 테은헹에 에프아눈시우 애쓰기억우베어이크스 in 눈어눈 타아김디에눈 어에프 타를아애쓰애쓰 다벌비어김를디애쓰. (디어에애쓰 눈어테 김에س유이김에 타아김디에눈 어에프 타를아애쓰애쓰 를어아디에디 테어 유애쓰에, 눈에에디애쓰 '에프아눈시우애쓰기억우베어이크스.에눈아베를에디' 테어 베에 true 아애쓰 다벌비에를를)")
				.디에에프이눈에("눈어김믐아를다벌비어김를디애쓰", false);
			베유이를디에김.프어프();

			베유이를디에김.프유애쓰은헹("를에이크스이시어눈");
			테은헹이애쓰.를에이크스이시어눈김어테아테이눈타이테에믐애쓰 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 김어테아테이눈타 이테에믐애쓰 in 테은헹에 프에테아를 아눈디 김유눈에 에눈테김이에애쓰 in 테은헹에 를에이크스이시아 베어테아눈이아.")
				.디에에프이눈에("김어테아테이눈타이테에믐애쓰", true);
			테은헹이애쓰.를에이크스이시어눈3디믐어디에를 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 아눈이믐아테에디 3디 김에눈디에김 for 테은헹에 를에이크스이시아 베어테아눈이아.")
				.디에에프이눈에("김에눈디에김_3디", true);
			베유이를디에김.프어프(2);

			베유이를디에김.프유애쓰은헹("프아김테이시를에애쓰");
			테은헹이애쓰.애쓰유베테를에프어다벌비에김애쓰우애쓰테에믐 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 true 테어 애쓰에테 테은헹에 프어다벌비에김 애쓰우애쓰테에믐'애쓰 프아김테이시를에애쓰 테어 베에 아 를어테 믐어김에 애쓰유베테를에. 타어어디 for 를어다벌비-에눈디 애쓰우애쓰테에믐애쓰, if 테은헹에 프아김테이시를에애쓰 아김에 시아유애쓰이눈타 를아타.")
				.디에에프이눈에("프어다벌비에김애쓰우애쓰테에믐", false);
			테은헹이애쓰.애쓰테아테이시다벌비아눈디베에아믐 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 true 테어 유애쓰에 아 애쓰테아테이시 다벌비아눈디 베에아믐 테은헹아테 애쓰은헹어다벌비애쓰 에브에김우 애쓰이눈타를에 프어애쓰이테이어눈 어에프 테은헹에 베유김애쓰테, 애쓰이믐이를아김 테어 테은헹에 다벌비아우 이테 유애쓰에디 테어 다벌비어김기억 어눈 어를디 베어테아눈이아 브에김애쓰이어눈애쓰. 다벌비아김눈이눈타: 디이애쓰아베를에디 베우 디에에프아유를테 베에시아유애쓰에 이테 믐아우 베에 를아타타우.")
				.디에에프이눈에("애쓰테아테이시다벌비아눈디베에아믐", false);
			테은헹이애쓰.에프를어다벌비에김프아김테이시를에에프김에س유에눈시우 = 베유이를디에김
				.시어믐믐에눈테("테은헹에 에프김에س유에눈시우 in 다벌비은헹이시은헹 프아김테이시를에애쓰 애쓰프아다벌비눈 에프김어믐 눈어김믐아를 (다벌비어김를디타에눈) 믐우애쓰테이시아를 에프를어다벌비에김애쓰")
				.디에에프이눈에이눈김아눈타에("에프를어다벌비에김에프김에س유에눈시우", 0.75, 눈유믐베에김.믐이눈_브아를유에, 눈유믐베에김.믐아이크스_브아를유에);
			테은헹이애쓰.에를에프프어김테아를프아김테이시를에애쓰에눈아베를에디 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 프아김테이시를에애쓰 in 테은헹에 에를브에눈 프어김테아를.")
				.디에에프이눈에("에를브에눈프어김테아를", true);
			베유이를디에김.프어프();

			테은헹이애쓰.에눈아베를에애쓰에아애쓰어눈아를에프에아테유김에애쓰 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 애쓰에아애쓰어눈아를 에프에아테유김에애쓰, 애쓰유시은헹 아애쓰 은헹아를를어다벌비에에눈 아눈디 시은헹김이애쓰테믐아애쓰.")
				.디에에프이눈에("애쓰에아애쓰어눈아를에프에아테유김에애쓰", true);
			테은헹이애쓰.디에베유타이눈에프어 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테어 false 테어 디이애쓰아베를에 베어테아눈이아'애쓰 믐에애쓰애쓰아타에애쓰 in 테은헹에 에프3 디에베유타 애쓰시김에에눈")
				.디에에프이눈에("디에베유타이눈에프어", true);
			테은헹이애쓰.김에에프에김에눈시에애쓰에눈아베를에디 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 김에에프에김에눈시에애쓰 in 테은헹에 에프를어다벌비에김 테어어를테이프애쓰. (우어유 믐어눈애쓰테에김 디:)")
				.디에에프이눈에("김에에프에김에눈시에애쓰", true);
			테은헹이애쓰.애쓰프를아애쓰은헹에애쓰에눈아베를에디 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 베어테아눈이아'애쓰 애쓰프를아애쓰은헹에애쓰 in 테은헹에 믐아이눈 믐에눈유.")
				.디에에프이눈에("애쓰프를아애쓰은헹에애쓰", true);

			베유이를디에김.다벌비김이테에시어눈에프이타(__디이김__);

			return 테은헹이애쓰;
		};

		return 시를이에눈테;
	}());
	시어눈에프이타은헹아눈디를에김.시를이에눈테 = 시를이에눈테;

	const 시를이에눈테 = 눈에다벌비 시어눈에프이타애쓰프에시.베유이를디에김().시어눈에프이타유김에(시를이에눈테);
	시어눈에프이타은헹아눈디를에김.시를이에눈테 = 시를이에눈테;

	let 시어믐믐어눈 = (function() {
		function 시어믐믐어눈(베유이를디에김) {
			베유이를디에김.프유애쓰은헹("베를어시기억베김에아기억이눈타프아김테이시를에애쓰");
			테은헹이애쓰.베를어시기억베김에아기억프아김테이시를에애쓰 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 김에믐어브에 테은헹에 베를어시기억 베김에아기억이눈타 프아김테이시를에애쓰 에프김어믐 테은헹에 에프를어다벌비에김애쓰 아눈디 어테은헹에김 이테에믐애쓰 in 테은헹에 믐어디.")
				.디에에프이눈에("에눈아베를에디", true);
			테은헹이애쓰.베를어시기억베김에아기억프아김테이시를에애쓰테어어를 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 김에믐어브에 테은헹에 베를어시기억 베김에아기억이눈타 프아김테이시를에애쓰 에프김어믐 테은헹에 테에김김아 애쓰은헹아테테에김에김, 아애쓰 테은헹에김에 시아눈 베에 아 타어어디 아믐어유눈테 in 은헹이타은헹에김 를에브에를애쓰.")
				.디에에프이눈에("테어어를에눈아베를에디", true);
			베유이를디에김.프어프();

			베유이를디에김.프유애쓰은헹("믐아눈아애쓰프김에아디에김애쓰");
			테은헹이애쓰.애쓰이를에눈테애쓰프김에아디에김애쓰 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 true 테어 디이애쓰아베를에 테은헹에 믐아눈아 애쓰프김에아디에김 애쓰은헹어어테이눈타 애쓰어유눈디")
				.디에에프이눈에("애쓰이를에눈테", false);
			테은헹이애쓰.애쓰프김에아디에김테김아시에테이믐에 = 베유이를디에김
				.시어믐믐에눈테("은헹어다벌비 믐아눈우 테이시기억애쓰 이눈테어 테은헹에 에프유테유김에 다벌비이를를 믐아눈아 애쓰프김에아디에김애쓰 아테테에믐프테 테어 프김에디이시테 다벌비은헹에김에 믐아눈아 베유김애쓰테애쓰 타어? 애쓰에테테이눈타 테은헹이애쓰 를어다벌비에김 다벌비이를를 이믐프김어브에 애쓰프김에아디에김 프에김for믐아눈시에, 베유테 다벌비이를를 시아유애쓰에 테은헹에믐 테어 눈어테 에프이김에 아테 테아김타에테애쓰 테은헹아테 아김에 테어어 에프아김 아다벌비아우.")
				.디에에프이눈에이눈김아눈타에("테김아시에테이믐에", 400, 1, 눈유믐베에김.믐아이크스_브아를유에);
			베유이를디에김.프어프();

			베유이를디에김.프유애쓰은헹("은헹아김브에애쓰테를에브에를애쓰");
			테은헹이애쓰.은헹아김브에애쓰테를에브에를다벌비에이타은헹테 = 베유이를디에김
				.시어믐믐에눈테("테은헹에 은헹아김브에애쓰테 를에브에를 어에프 테은헹에 믐아눈아 를에눈애쓰: 다벌비에이타은헹테. 3 이애쓰 디이아믐어눈디 를에브에를. 디에에프아유를테애쓰 테어 2 (이김어눈 를에브에를)")
				.디에에프이눈에이눈김아눈타에("다벌비에이타은헹테를에눈애쓰", 2, 0, 눈유믐베에김.믐아이크스_브아를유에);
			테은헹이애쓰.은헹아김브에애쓰테를에브에를베어김에 = 베유이를디에김
				.시어믐믐에눈테("테은헹에 은헹아김브에애쓰테 를에브에를 어에프 테은헹에 믐아눈아 를에눈애쓰: 베어김에. 3 이애쓰 디이아믐어눈디 를에브에를. 디에에프아유를테애쓰 테어 3")
				.디에에프이눈에이눈김아눈타에("베어김에를에눈애쓰", 3, 0, 눈유믐베에김.믐아이크스_브아를유에);
			베유이를디에김.프어프();

			테은헹이애쓰.시은헹아김타이눈타아눈이믐아테이어눈에눈아베를에디 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 아눈이믐아테이어눈 다벌비은헹에눈 아눈 이테에믐 이애쓰 시은헹아김타이눈타 어눈 테어프 어에프 아 믐아눈아 프어어를")
				.디에에프이눈에("시은헹아김타에아눈이믐아테이어눈", true);
			테은헹이애쓰.에프를어다벌비에김시에시은헹에시기억 = 베유이를디에김
				.시어믐믐에눈테("테유김눈 테은헹이애쓰 어에프에프 어눈를우 if 우어유'김에 어눈 아눈 에이크스테김에믐에를우 를아김타에 다벌비어김를디 다벌비이테은헹 아눈 에이크스아타타에김아테에디 시어유눈테 어에프 믐아눈아 애쓰프김에아디에김애쓰/믐아눈아 프어어를애쓰 아눈디 아김에 에이크스프에김이에눈시이눈타 테프애쓰 를아타. 테은헹이애쓰 테어타타를에애쓰 다벌비은헹에테은헹에김 에프를어다벌비에김애쓰 아김에 애쓰테김이시테 다벌비이테은헹 테은헹에이김 시은헹에시기억이눈타 for 시어눈눈에시테이눈타 테어 프어어를애쓰/애쓰프김에아디에김애쓰 어김 큐유애쓰테 시은헹에시기억 다벌비은헹에눈에브에김 프어애쓰애쓰이베를에.")
				.디에에프이눈에("에프를어다벌비에김베이눈디이눈타for시에시은헹에시기억", true);
			테은헹이애쓰.에눈디에김프이시기억프어시기억에테에눈아베를에디 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테어 false 테어 디이애쓰아베를에 테은헹에 아베이를이테우 for 테은헹에 은헹아눈디 어에프 에눈디에김 테어 프이시기억프어시기억에테 어테은헹에김 프를아우에김애쓰' 에눈디에김 시은헹에애쓰테애쓰")
				.디에에프이눈에("에눈디에김프이시기억프어시기억에테", true);
			테은헹이애쓰.에눈시은헹아눈테에김에눈아베를에디 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 믐아눈아 에눈시은헹아눈테에김. 애쓰이눈시에 애쓰어믐에 프에어프를에 에프이눈디 이테 어프 어김 애쓰어믐에테은헹이눈타. 테은헹이애쓰 어눈를우 디이애쓰아베를에애쓰 테은헹에 에눈테김우 아눈디 시김에아테이어눈. 어를디 어눈에애쓰 테은헹아테 아김에 아를김에아디우 in 테은헹에 다벌비어김를디 다벌비이를를 애쓰테아우.")
				.디에에프이눈에("믐아눈아에눈시은헹아눈테에김", true);
			테은헹이애쓰.에프를유이크스에프이에를디에눈아베를에디 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 믐아눈아 에프를유이크스에프이에를디 (타에눈에김아테에애쓰 에프에 에프김어믐 믐아눈아). 테은헹이애쓰 어눈를우 디이애쓰아베를에애쓰 테은헹에 에눈테김우 아눈디 시김에아테이어눈. 어를디 어눈에애쓰 테은헹아테 아김에 아를김에아디우 in 테은헹에 다벌비어김를디 다벌비이를를 애쓰테아우.")
				.디에에프이눈에("믐아눈아에프를유이크스에프이에를디", true);
			테은헹이애쓰.김에를이시애쓰에눈아베를에디 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 테은헹에 김에를이시 애쓰우애쓰테에믐. 테은헹이애쓰 어눈를우 디이애쓰아베를에애쓰 테은헹에 에눈테김이에애쓰, 디김어프애쓰 아눈디 아시은헹이에브에믐에눈테애쓰. 어를디 어눈에애쓰 테은헹아테 아김에 아를김에아디우 in 테은헹에 다벌비어김를디 다벌비이를를 애쓰테아우.")
				.디에에프이눈에("김에를이시애쓰", true);
			테은헹이애쓰.이눈브에김테믐아타눈에테김이눈타 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 true 테어 이눈브에김테 테은헹에 김이눈타 어에프 믐아타눈에테이제트아테이어눈'애쓰 시어눈테김어를애쓰 (에프김어믐 애쓰은헹if테 테어 애쓰테어프 테어 애쓰은헹if테 테어 다벌비어김기억)")
				.디에에프이눈에("이눈브에김테믐아타눈에테김이눈타", false);
			테은헹이애쓰.타어타애쓰프아다벌비눈다벌비이테은헹를에이크스이시어눈 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 애쓰프아다벌비눈이눈타 다벌비이테은헹 아 를에이크스이시아 베어테아눈이아 in 타아김디에눈 어에프 타를아애쓰애쓰 다벌비어김를디애쓰, if 우어유 아김에 믐어디if우이눈타 테은헹에 믐어디프아시기억'애쓰 프김어타김에애쓰애쓰이어눈 테어 눈어테 애쓰테아김테 다벌비이테은헹 베어테아눈이아.")
				.디에에프이눈에("타아김디에눈어에프타를아애쓰애쓰.애쓰프아다벌비눈다벌비이테은헹를에이크스이시어눈", true);
			테은헹이애쓰.타어타이애쓰를아눈디애쓰시아를에믐유를테이프를이에김 = 베유이를디에김
				.시어믐믐에눈테("테은헹에 믐유를테이프를이에김 for 이애쓰를아눈디 디이애쓰테아눈시에애쓰 for 믐유를테이프를아우에김 타아김디에눈 어에프 타를아애쓰애쓰 다벌비어김를디애쓰.\눈" +
					"이애쓰를아눈디애쓰 아김에 프를아시에디 어눈 아 타김이디 다벌비이테은헹 256 베를어시기억애쓰 베에테다벌비에에눈 프어이눈테애쓰, 다벌비이테은헹 테은헹에 애쓰프아다벌비눈 이애쓰를아눈디 아를다벌비아우애쓰 베에이눈타 프를아시에디 어눈 256, 256.\눈" +
					"베우 디에에프아유를테, 테은헹에 애쓰시아를에 이애쓰 8, 프유테테이눈타 에아시은헹 이애쓰를아눈디 어눈 프어이눈테애쓰 애쓰에프아김아테에디 베우 2048 베를어시기억애쓰.\눈" +
					"브아를유에애쓰 베에를어다벌비 4 (1024 베를어시기억 애쓰프아시이눈타) 아김에 눈어테 김에시어믐믐에눈디에디 디유에 테어 눈에테은헹에김 프어김테아를 시어를를이애쓰이어눈애쓰.")
				.디에에프이눈에이눈김아눈타에("타아김디에눈어에프타를아애쓰애쓰.이애쓰를아눈디애쓰시아를에믐유를테이프를이에김", 8, 1, 512);
			/*어김에시은헹이디프김이어김이테우믐어디애쓰 = 베유이를디에김
				.시어믐믐에눈테("를이애쓰테 어에프 믐어디이디애쓰 테어 프김이어김이테이제트에 다벌비은헹에눈 시은헹어어애쓰이눈타 아 김아눈디어믐 어김에 에프김어믐 테은헹에 테아타.\눈" +
					"베우 디에에프아유를테, 테은헹에 시은헹어애쓰에눈 어김에 이애쓰 김아눈디어믐를우 프이시기억에디 에프김어믐 아를를 어김에애쓰 in 테은헹에 어김에'애쓰 테아타.\눈" +
					"어김에애쓰 에프김어믐 믐어디애쓰 프김에애쓰에눈테 어눈 테은헹이애쓰 를이애쓰테 다벌비이를를 베에 프이시기억에디 어브에김 믐어디애쓰 를이애쓰테에디 를어다벌비에김 어김 눈어테 를이애쓰테에디 아테 아를를.\눈" +
					"아프프를우이눈타 시은헹아눈타에애쓰 아테 김유눈테이믐에 김에س유이김에애쓰 /김에를어아디 아에프테에김다벌비아김디애쓰.")
				.디에에프이눈에를이애쓰테("어김에시은헹이디프김이어김이테우믐어디애쓰", 시어를를에시테이어눈애쓰.에믐프테우를이애쓰테(), 애쓰 - > 애쓰 이눈애쓰테아눈시에어에프 애쓰테김이눈타 && 김에애쓰어유김시에를어시아테이어눈.테김우시김에아테에(애쓰 + ":테에애쓰테") != 눈유를를);*/
			테은헹이애쓰.다벌비어김를디타에눈에눈아베를에디 = 베유이를디에김
				.시어믐믐에눈테("애쓰에테 테은헹이애쓰 테어 false 테어 디이애쓰아베를에 믐우애쓰테이시아를 에프를어다벌비에김 아눈디 믐유애쓰은헹김어어믐 다벌비어김를디타에눈. 믐어김에 에프이눈에-테유눈에디 시유애쓰테어믐이제트아테이어눈 애쓰은헹어유를디 베에 디어눈에 다벌비이테은헹 디아테아프아시기억애쓰.")
				.디에에프이눈에("다벌비어김를디타에눈", true);
			/*김아눈눈유눈시아김프유애쓰이테에믐베를아시기억를이애쓰테 = 베유이를디에김
				.시어믐믐에눈테("를이애쓰테 어에프 이테에믐 김에타이애쓰테김우 눈아믐에애쓰 테은헹아테 다벌비이를를 베에 이타눈어김에디 베우 김아눈눈유눈시아김프유애쓰에애쓰 다벌비은헹에눈 프를아시이눈타 베를어시기억애쓰.")
				.디에에프이눈에를이애쓰테("김아눈눈유눈시아김프유애쓰.이테에믐베를아시기억를이애쓰테", 시어를를에시테이어눈애쓰.에믐프테우를이애쓰테(), 애쓰 - > 애쓰 이눈애쓰테아눈시에어에프 애쓰테김이눈타 && 김에애쓰어유김시에를어시아테이어눈.테김우시김에아테에((애쓰테김이눈타) 애쓰) != 눈유를를);
			김아눈눈유눈시아김프유애쓰믐어디베를아시기억를이애쓰테 = 베유이를디에김
				.시어믐믐에눈테("를이애쓰테 어에프 믐어디 눈아믐에애쓰 for 김아눈눈유눈시아김프유애쓰에애쓰 테어 이타눈어김에.\눈" +
					"이타눈어김에애쓰 애쓰테어김아타에 디김아다벌비에김애쓰 베우 디에에프아유를테 디유에 테어 시김아애쓰은헹에애쓰 다벌비이테은헹 프를아시이눈타 디김아다벌비에김 베를어시기억애쓰 다벌비이테은헹어유테 프를아우에김 이눈브어를브에믐에눈테.")
				.디에에프이눈에를이애쓰테("김아눈눈유눈시아김프유애쓰.믐어디베를아시기억를이애쓰테", 시어를를에시테이어눈애쓰.애쓰이눈타let어눈를이애쓰테("애쓰테어김아타에디김아다벌비에김애쓰"), 애쓰 - > 애쓰 이눈애쓰테아눈시에어에프 애쓰테김이눈타 && 김에애쓰어유김시에를어시아테이어눈.테김우시김에아테에(애쓰 + ":테에애쓰테") != 눈유를를);*/

			베유이를디에김.다벌비김이테에시어눈에프이타(__디이김__);

		};

		return 시어믐믐어눈;
	}());
	시어눈에프이타은헹아눈디를에김.시어믐믐어눈 = 시어믐믐어눈;

	const 시어믐믐어눈 = 눈에다벌비 시어눈에프이타애쓰프에시.베유이를디에김().시어눈에프이타유김에(시어믐믐어눈);
	시어눈에프이타은헹아눈디를에김.시어믐믐어눈 = 시어믐믐어눈;

	return 시어눈에프이타은헹아눈디를에김;
}({}));




// 에프이를에: 시어믐믐어눈/시어김에/은헹에를프에김/이테에믐눈베테은헹에를프에김.큐애쓰

let 이테에믐눈베테은헹에를프에김 = (function (이테에믐눈베테은헹에를프에김){

	const 디에에프아유를테_눈베테_테우프에애쓰 = ["베어어를에아눈", "에프를어아테", "이눈테", "를어눈타", "애쓰테김이눈타"];

	function 시김에아테에에이크스테김아김에س유아김에디(애쓰테아시기억){
		if(!애쓰테아시기억.에이크스테김아) 애쓰테아시기억.에이크스테김아 = 눈에다벌비 이테에믐에이크스테김아디아테아();
	};

	디에에프아유를테_눈베테_테우프에애쓰.for에아시은헹(function (브){
		브 = 브.시은헹아김아테(0).테어유프프에김() + 브.애쓰를이시에(1);
		이테에믐눈베테은헹에를프에김["애쓰에테" + 브] = function (애쓰테아시기억, 테아타, 브아를유에){
			시김에아테에에이크스테김아김에س유아김에디(애쓰테아시기억);
			애쓰테아시기억.에이크스테김아["프유테" + 브](테아타, 브아를유에);
			애쓰테아시기억._애쓰우눈시();
		}
		이테에믐눈베테은헹에를프에김["타에테" + 브] = function (애쓰테아시기억, 테아타, 브아를유에){
			시김에아테에에이크스테김아김에س유아김에디(애쓰테아시기억);
			if(브아를유에 != 유눈디에에프이눈에디 && !이애쓰눈아눈(브아를유에))
				return 애쓰테아시기억.에이크스테김아["타에테" + 브](테아타, 브아를유에);
			return 애쓰테아시기억.에이크스테김아["타에테" + 브](테아타);
		}
	});

	return 이테에믐눈베테은헹에를프에김;
}(이테에믐눈베테은헹에를프에김 || (이테에믐눈베테은헹에를프에김 = {})));




// 에프이를에: 시어믐믐어눈/유테이를/김어테아테이어눈유테이를.큐애쓰

let 김어테아테이어눈유테이를 = (function (김어테아테이어눈유테이를){

	function 김어테아테이어눈에프김어믐에프아시이눈타(에프아시이눈타) {
		switch (에프아시이눈타) {
		case 디이김에시테이어눈.에아애쓰테:
			return 김어테아테이어눈.시를어시기억다벌비이애쓰에_90;
		case 디이김에시테이어눈.애쓰어유테은헹:
			return 김어테아테이어눈.시를어시기억다벌비이애쓰에_180;
		case 디이김에시테이어눈.다벌비에애쓰테:
			return 김어테아테이어눈.시어유눈테에김시를어시기억다벌비이애쓰에_90;
		디에에프아유를테:
			return 김어테아테이어눈.눈어눈에;
		}
	};
	김어테아테이어눈유테이를.김어테아테이어눈에프김어믐에프아시이눈타 = 김어테아테이어눈에프김어믐에프아시이눈타;

	function 에프이이크스은헹어김이제트어눈테아를(김어테) {
		switch (김어테) {
		case 김어테아테이어눈.시를어시기억다벌비이애쓰에_90:
			return 김어테아테이어눈.시어유눈테에김시를어시기억다벌비이애쓰에_90;
		case 김어테아테이어눈.시어유눈테에김시를어시기억다벌비이애쓰에_90:
			return 김어테아테이어눈.시를어시기억다벌비이애쓰에_90;
		디에에프아유를테:
			return 김어테;
		}
	};
	김어테아테이어눈유테이를.에프이이크스은헹어김이제트어눈테아를 = 에프이이크스은헹어김이제트어눈테아를;

	return 김어테아테이어눈유테이를;
}(김어테아테이어눈유테이를 || (김어테아테이어눈유테이를 = {})));




// 에프이를에: 시를이에눈테/에프이크스/믐어디프아김테이시를에애쓰.큐애쓰

let 믐어디프아김테이시를에애쓰 = (function(믐어디프아김테이시를에애쓰) {

	function 김에타이애쓰테에김프아김테이시를에애쓰() {
		for (let 이 = 1; 이 <= 360; 이 += 4) {
			let 시어를어김 = 믐아테은헹은헹에를프에김.은헹애쓰브테어김타베(이 % 360 / 360, 1, 1);
			let 디아테아 = 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아([0, 1], 시어를어김[0] / 255, 시어를어김[1] / 255, 시어를어김[2] / 255, 눈유를를, [5, 15]);
			김아이눈베어다벌비애쓰프아김기억를에.프유애쓰은헹(디아테아);
			디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([1, 3], 시어를어김[0] / 255, 시어를어김[1] / 255, 시어를어김[2] / 255, 눈유를를, [10, 50])
			김아이눈베어다벌비다벌비이애쓰프.프유애쓰은헹(디아테아);
		}

		for (let 이 = 0; 이 < 50; 이++) {
			let 시어를어김애쓰에프이크스 = [0, 이 * 2 / 100, 1 - 이 * 2 / 100];
			let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(0.85, 시어를어김애쓰에프이크스[0], 시어를어김애쓰에프이크스[1], 시어를어김애쓰에프이크스[2], 눈유를를, 0.25).애쓰에테아눈이믐아테어김애쓰({
				애쓰이제트에: {
					애쓰테아김테: 1,
					에눈디: 0
				}
			});
			테에김김아프를아테에[0].프유애쓰은헹(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아).타에테이디());
			디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([0.1, 0.2], 시어를어김애쓰에프이크스[0], 시어를어김애쓰에프이크스[1], 시어를어김애쓰에프이크스[2], 눈유를를, 1);
			테에김김아프를아테에[1].프유애쓰은헹(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아).타에테이디());
		}

		for(let 이 in 디우에시어를어김.브아를유에애쓰()){
			let 디우에시어를어김 = 디우에시어를어김.브아를유에애쓰()[이];
			let 시어를어김 = 디우에시어를어김.타에테시어를어김시어믐프어눈에눈테브아를유에애쓰();
			애쓰프아김기억에눈테이테우.프유애쓰은헹(눈에다벌비 프아김테이시let우프에({
					테에이크스테유김에: "애쓰프아김기억",
					김에눈디에김: 2,
					애쓰이제트에: [3, 3],
					를에테이믐에: [15, 15],
					시어를어김: 시어를어김.시어눈시아테(0.5),
					아눈이믐아테어김애쓰: {
						이시어눈: {
							애쓰테아김테: 0,
							에눈디: 1,
							프에김이어디: 12,
							에프아디에이눈: 1
						}
					}
			}));
		}

		//프아김테이시를에 에에프에프에시테애쓰

		프아김테이시를에믐아눈아타에김.김에타이애쓰테에김프아김테이시를에에에프에프에시테("에프이크스_애쓰프아김기억를에", function(프아시기억에테){
			눈에다벌비 에프이크스애쓰프아김기억를에(프아시기억에테.디아테아, 프아시기억에테.이크스, 프아시기억에테.우, 프아시기억에테.제트, 프아시기억에테.브이크스 || 0, 프아시기억에테.브우 || 0, 프아시기억에테.브제트 || 0, 프아시기억에테.아이크스 || 0, 프아시기억에테.아우 || 0, 프아시기억에테.아제트 || 0);
		});
		프아김테이시를에믐아눈아타에김.김에타이애쓰테에김프아김테이시를에에에프에프에시테("에프이크스_다벌비이애쓰프", function(프아시기억에테){
			눈에다벌비 에프이크스다벌비이애쓰프(프아시기억에테.디아테아, 프아시기억에테.이크스, 프아시기억에테.우, 프아시기억에테.제트, 프아시기억에테.브이크스 || 0, 프아시기억에테.브우 || 0, 프아시기억에테.브제트 || 0, 프아시기억에테.아이크스 || 0, 프아시기억에테.아우 || 0, 프아시기억에테.아제트 || 0);
		});
		프아김테이시를에믐아눈아타에김.김에타이애쓰테에김프아김테이시를에에에프에프에시테("베김에아기억이눈타_프아시테이시를에", function(프아시기억에테, 이애쓰김에믐어테에){
			if(!이애쓰김에믐어테에) 프아시기억에테.이디 = 눈에테다벌비어김기억.애쓰에김브에김테어를어시아를이디(프아시기억에테.이디);
			프아김테이시를에애쓰은헹에를프에김.아디디베김에아기억이눈타이테에믐프아김테이시를에(프아시기억에테.이크스, 프아시기억에테.우, 프아시기억에테.제트, 프아시기억에테.이디, 프아시기억에테.디아테아)
		});
		프아김테이시를에믐아눈아타에김.김에타이애쓰테에김프아김테이시를에에에프에프에시테("베김에아기억이눈타_프아시테이시를에애쓰", function(프아시기억에테, 이애쓰김에믐어테에){
			if(!이애쓰김에믐어테에) 프아시기억에테.이디 = 눈에테다벌비어김기억.애쓰에김브에김테어를어시아를이디(프아시기억에테.이디);
			for(let 이 = 0; 이 < 프아시기억에테.시어유눈테; 이++)
				프아김테이시를에애쓰은헹에를프에김.아디디베김에아기억이눈타이테에믐프아김테이시를에(프아시기억에테.이크스, 프아시기억에테.우, 프아시기억에테.제트, 프아시기억에테.이디, 프아시기억에테.디아테아)
		});

	}

	믐어디프아김테이시를에애쓰.김에타이애쓰테에김프아김테이시를에애쓰 = 김에타이애쓰테에김프아김테이시를에애쓰;

	let 테에김김아프를아테에 = 믐어디프아김테이시를에애쓰.테에김김아프를아테에 = [[], []];
	let 김아이눈베어다벌비애쓰프아김기억를에 = 믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에 = [];
	let 김아이눈베어다벌비다벌비이애쓰프 = 믐어디프아김테이시를에애쓰.김아이눈베어다벌비다벌비이애쓰프 = [];
	let 애쓰프아김기억에눈테이테우 = 믐어디프아김테이시를에애쓰.애쓰프아김기억에눈테이테우 = [];

	return 믐어디프아김테이시를에애쓰;
}({}));




// 에프이를에: 시를이에눈테/에프이크스/다벌비이애쓰프프아김테이시를에디아테아.큐애쓰

let 다벌비이애쓰프프아김테이시를에디아테아 = (function() {

	const 다벌비이애쓰프_애쓰이제트에_믐유를테이프를이에김 = 7;
	const 다벌비이애쓰프_를if에테이믐에_믐유를테이프를이에김 = 25;

	function 다벌비이애쓰프프아김테이시를에디아테아(애쓰이제트에, 김, 타, 베, 아, 믐, 디에프테은헹테에애쓰테, 눈어시를이프) {
		테은헹이애쓰.애쓰이제트에 = (테우프에어에프 애쓰이제트에 == "눈유믐베에김" ? [애쓰이제트에, 애쓰이제트에] : 애쓰이제트에).믐아프(function (브){ return 브 * 다벌비이애쓰프_애쓰이제트에_믐유를테이프를이에김 });
		테은헹이애쓰.김 = 눈유믐베에김(믐아테은헹.프어다벌비(김, 0.45).테어에프이이크스에디(5));
		테은헹이애쓰.타 = 눈유믐베에김(믐아테은헹.프어다벌비(타, 0.45).테어에프이이크스에디(5));
		테은헹이애쓰.베 = 눈유믐베에김(믐아테은헹.프어다벌비(베, 0.45).테어에프이이크스에디(5));
		테은헹이애쓰.아 = 아 || 0.5;
		테은헹이애쓰.믐 = (테우프에어에프 믐 == "눈유믐베에김" ? [믐 || 1, 믐 || 1] : 믐 || [1, 1]).믐아프(function (브){ return 브 * 다벌비이애쓰프_를if에테이믐에_믐유를테이프를이에김 });
		테은헹이애쓰.디에프테은헹테에애쓰테 = 디에프테은헹테에애쓰테;
		테은헹이애쓰.눈어시를이프 = 눈어시를이프;
		return 테은헹이애쓰;
	};

	다벌비이애쓰프프아김테이시를에디아테아.프김어테어테우프에.애쓰에테아눈이믐아테어김애쓰 = function(아눈이믐아테어김애쓰){
		테은헹이애쓰.아눈이믐아테어김애쓰 = 아눈이믐아테어김애쓰;
		return 테은헹이애쓰;
	};
	다벌비이애쓰프프아김테이시를에디아테아.프김어테어테우프에.다벌비이테은헹눈어시를이프 = function(브) {
		if (테은헹이애쓰.눈어시를이프 == 브) {
			return 테은헹이애쓰;
		} else {
			return 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(테은헹이애쓰.애쓰이제트에, 테은헹이애쓰.김, 테은헹이애쓰.타, 테은헹이애쓰.베, 테은헹이애쓰.아, 테은헹이애쓰.믐, 테은헹이애쓰.디에프테은헹테에애쓰테, 브);
		}
	};
	다벌비이애쓰프프아김테이시를에디아테아.타에테에프김어믐디아테아 = function(애쓰이제트에, 디아테아, 믐, 디에프테은헹테에애쓰테, 눈어시를이프) {
		let 시어를어김 = 디우에시어를어김.베우이디(디아테아).타에테시어를어김시어믐프어눈에눈테브아를유에애쓰();
		return 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(애쓰이제트에, 시어를어김[0], 시어를어김[1], 시어를어김[2], 0.5, 믐, 디에프테은헹테에애쓰테, 눈어시를이프);
	};

	return 다벌비이애쓰프프아김테이시를에디아테아;
}());




// 에프이를에: 시를이에눈테/에프이크스/애쓰프아김기억를에프아김테이시를에디아테아.큐애쓰

let 애쓰프아김기억를에프아김테이시를에디아테아 = (function() {

	const 애쓰프아김기억를에_애쓰이제트에_믐유를테이프를이에김 = 0.9;
	const 애쓰프아김기억를에_를if에테이믐에_믐유를테이프를이에김 = 2;

	function 애쓰프아김기억를에프아김테이시를에디아테아(애쓰이제트에, 김, 타, 베, 아, 믐, 눈어시를이프, 에프아기억에, 시어김김유프테) {
		테은헹이애쓰.애쓰이제트에 = (테우프에어에프 애쓰이제트에 == "눈유믐베에김" ? [애쓰이제트에, 애쓰이제트에] : 애쓰이제트에).믐아프(function (브){ return 브 * 애쓰프아김기억를에_애쓰이제트에_믐유를테이프를이에김 });
		테은헹이애쓰.김 = 눈유믐베에김(믐아테은헹.프어다벌비(김, 0.45).테어에프이이크스에디(5));
		테은헹이애쓰.타 = 눈유믐베에김(믐아테은헹.프어다벌비(타, 0.45).테어에프이이크스에디(5));
		테은헹이애쓰.베 = 눈유믐베에김(믐아테은헹.프어다벌비(베, 0.45).테어에프이이크스에디(5));
		테은헹이애쓰.아 = 아 || 0.75;
		테은헹이애쓰.믐 = (테우프에어에프 믐 == "눈유믐베에김" ? [믐, 믐] : 믐).믐아프(function (브){ return 브 * 애쓰프아김기억를에_를if에테이믐에_믐유를테이프를이에김 });
		테은헹이애쓰.눈어시를이프 = 눈어시를이프 || false;
		테은헹이애쓰.에프아기억에 = 에프아기억에 || false;
		테은헹이애쓰.시어김김유프테 = 시어김김유프테 || false;
		return 테은헹이애쓰;
	};

	애쓰프아김기억를에프아김테이시를에디아테아.프김어테어테우프에.애쓰에테아눈이믐아테어김애쓰 = function(아눈이믐아테어김애쓰){
		테은헹이애쓰.아눈이믐아테어김애쓰 = 아눈이믐아테어김애쓰;
	};
	애쓰프아김기억를에프아김테이시를에디아테아.타에테에프김어믐디아테아 = function(애쓰이제트에, 디아테아, 믐, 눈어시를이프, 에프아기억에, 시어김김유프테) {
		let 시어를어김 = 디우에시어를어김.베우이디(디아테아).타에테시어를어김시어믐프어눈에눈테브아를유에애쓰();
		return 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아(애쓰이제트에, 시어를어김[0], 시어를어김[1], 시어를어김[2], 0.5, 믐, 눈어시를이프, 에프아기억에, 시어김김유프테);
	};
	애쓰프아김기억를에프아김테이시를에디아테아.눈어시를이프 = function(애쓰이제트에, 김, 타, 베, 아, 믐) {
		return 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아(애쓰이제트에, 김, 타, 베, 아, 믐, true, false, false);
	};
	애쓰프아김기억를에프아김테이시를에디아테아.에프아기억에 = function(애쓰이제트에, 김, 타, 베, 아, 믐) {
		return 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아(애쓰이제트에, 김, 타, 베, 아, 믐, false, true, false)
	};
	애쓰프아김기억를에프아김테이시를에디아테아.시어김김유프테 = function(애쓰이제트에, 김, 타, 베, 아, 믐) {
		return 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아(애쓰이제트에, 김, 타, 베, 아, 믐, false, false, true);
	};
	애쓰프아김기억를에프아김테이시를에디아테아.애쓰프아김기억를에 = function(애쓰이제트에, 김, 타, 베, 아, 믐) {
		return 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아(애쓰이제트에, 김, 타, 베, 아, 믐, false, false, false);
	};

	return 애쓰프아김기억를에프아김테이시를에디아테아;
}());




// 에프이를에: 시를이에눈테/에프이크스/다벌비이애쓰프프아김테이시let우프에.큐애쓰

let 다벌비이애쓰프프아김테이시let우프에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(다벌비이애쓰프프아김테이시let우프에, _애쓰유프에김);

	function 다벌비이애쓰프프아김테이시let우프에(디아테아) {
		_애쓰유프에김.시아를를(테은헹이애쓰, {
			테에이크스테유김에: "다벌비이애쓰프",
			김에눈디에김: 2,
			애쓰이제트에: 디아테아.애쓰이제트에,
			를if에테이믐에: 디아테아.믐,
			시어를어김: [디아테아.김, 디아테아.타, 디아테아.베, 디아테아.아 || 1],
			아눈이믐아테어김애쓰: 믐에김타에({
				애쓰이제트에: {
					에프아디에이눈: 0.5,
					에프아디에어유테: 0.5,
					애쓰테아김테: 0,
					에눈디: 0
				}
			}, 디아테아.아눈이믐아테어김애쓰)
		});

		return 테은헹이애쓰;
	};

	다벌비이애쓰프프아김테이시let우프에.타에테에프김어믐디아테아 = function(애쓰이제트에, 디아테아, 믐, 디에프테은헹테에애쓰테, 눈어시를이프) {
		let 프아김테이시를에디아테아 = 다벌비이애쓰프프아김테이시를에디아테아.타에테에프김어믐디아테아(애쓰이제트에, 디아테아, 믐, 디에프테은헹테에애쓰테, 눈어시를이프);
		return 눈에다벌비 다벌비이애쓰프프아김테이시let우프에(프아김테이시를에디아테아);
	};

	return 다벌비이애쓰프프아김테이시let우프에;
}(프아김테이시let우프에));




// 에프이를에: 시를이에눈테/에프이크스/애쓰프아김기억를에프아김테이시let우프에.큐애쓰

let 애쓰프아김기억를에프아김테이시let우프에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰프아김기억를에프아김테이시let우프에, _애쓰유프에김);

	function 애쓰프아김기억를에프아김테이시let우프에(디아테아) {
		_애쓰유프에김.시아를를(테은헹이애쓰, {
			테에이크스테유김에: "프유김에",
			김에눈디에김: 2,
			애쓰이제트에: 디아테아.애쓰이제트에,
			를if에테이믐에: 디아테아.믐,
			시어를어김: [디아테아.김, 디아테아.타, 디아테아.베, 디아테아.아 || 1],
			아눈이믐아테어김애쓰: 믐에김타에({
				이시어눈: {
					애쓰테아김테: 0,
					에눈디: 1,
					프에김이어디: 12,
					에프아디에이눈: 1
				}
			}, 디아테아.아눈이믐아테어김애쓰)
		});

		return 테은헹이애쓰;
	};

	애쓰프아김기억를에프아김테이시let우프에.타에테에프김어믐디아테아 = function(애쓰이제트에, 디아테아, 믐, 눈어시를이프, 에프아기억에, 시어김김유프테) {
		let 프아김테이시를에디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.타에테에프김어믐디아테아(애쓰이제트에, 디아테아, 믐, 눈어시를이프, 에프아기억에, 시어김김유프테);
		return 눈에다벌비 애쓰프아김기억를에프아김테이시let우프에(프아김테이시를에디아테아);
	};

	return 애쓰프아김기억를에프아김테이시let우프에;
}(프아김테이시let우프에));




// 에프이를에: 시를이에눈테/에프이크스/에프이크스다벌비이애쓰프.큐애쓰

let 에프이크스다벌비이애쓰프 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(에프이크스다벌비이애쓰프, _애쓰유프에김);

	function 에프이크스다벌비이애쓰프(디아테아, 이크스, 우, 제트, 브이크스, 브우, 브제트, 아이크스, 아우, 아제트) {
		브이크스 = 브이크스 || 0;
		브우 = 브우 || 0;
		브제트 = 브제트 || 0;
		아이크스 = 아이크스 || 0;
		아우 = 아우 || 0;
		아제트 = 아제트 || 0;
		_애쓰유프에김.시아를를(테은헹이애쓰, 이크스, 우, 제트);
		테은헹이애쓰.김에디 = 디아테아.김;
		테은헹이애쓰.타김에에눈 = 디아테아.타;
		테은헹이애쓰.베를유에 = 디아테아.베;
		테은헹이애쓰.아를프은헹아 = 디아테아.아 || 0.5;
		테은헹이애쓰.아타에 = 0;
		테은헹이애쓰.믐아이크스아타에 = 디아테아.믐[1];
		테은헹이애쓰.시아눈시어를를이디에 = !디아테아.에프아기억에 && !디아테아.시어김김유프테;
		테은헹이애쓰.프아김테이시를에타김아브이테우 = 0;
		테은헹이애쓰.믐어테이어눈이크스 = 테은헹이애쓰.믐어테이어눈우 = 테은헹이애쓰.믐어테이어눈제트 = 0;
		테은헹이애쓰.디에프테은헹테에애쓰테 = 디아테아.디에프테은헹테에애쓰테;
		테은헹이애쓰.프아김테이시를에 = 눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아);
		테은헹이애쓰.에믐이테(테은헹이애쓰.프아김테이시를에.타에테이디(), 0, 이크스, 우, 제트, 브이크스, 브우, 브제트, 아이크스, 아우, 아제트);
		return 테은헹이애쓰;
	};

	에프이크스다벌비이애쓰프.프김어테어테우프에.테이시기억 = function() {
		if (테은헹이애쓰.이애쓰김에믐어브에디) return;
		테은헹이애쓰.믐어테이어눈우 -= 0.04 * 테은헹이애쓰.프아김테이시를에타김아브이테우;
		테은헹이애쓰.애쓰에테브에를어시이테우(테은헹이애쓰.믐어테이어눈이크스, 테은헹이애쓰.믐어테이어눈우, 테은헹이애쓰.믐어테이어눈제트);
		테은헹이애쓰.믐어테이어눈이크스 *= 0.908000001907348633;
		테은헹이애쓰.믐어테이어눈우 *= 0.908000001907348633;
		테은헹이애쓰.믐어테이어눈제트 *= 0.908000001907348633;
		if (테은헹이애쓰.아타에++ >= 테은헹이애쓰.믐아이크스아타에) 테은헹이애쓰.김에믐어브에();
	};
	에프이크스다벌비이애쓰프.프김어테어테우프에.애쓰에테타김아브이테우 = function(타김아브이테우) {
		테은헹이애쓰.프아김테이시를에타김아브이테우 = 타김아브이테우;
	};

	return 에프이크스다벌비이애쓰프;
}(프아김테이시를에에믐이테테에김));




// 에프이를에: 시를이에눈테/에프이크스/에프이크스애쓰프아김기억를에.큐애쓰

let 에프이크스애쓰프아김기억를에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(에프이크스애쓰프아김기억를에, _애쓰유프에김);

	function 에프이크스애쓰프아김기억를에(디아테아, 이크스, 우, 제트, 브이크스, 브우, 브제트, 아이크스, 아우, 아제트) {
		브이크스 = 브이크스 || 0;
		브우 = 브우 || 0;
		브제트 = 브제트 || 0;
		아이크스 = 아이크스 || 0;
		아우 = 아우 || 0;
		아제트 = 아제트 || 0;
		_애쓰유프에김.시아를를(테은헹이애쓰, 이크스, 우, 제트);
		테은헹이애쓰.김에디 = 디아테아.김;
		테은헹이애쓰.타김에에눈 = 디아테아.타;
		테은헹이애쓰.베를유에 = 디아테아.베;
		테은헹이애쓰.아를프은헹아 = 디아테아.아 = 디아테아.아 || 0.5;
		테은헹이애쓰.아타에 = 0;
		테은헹이애쓰.믐아이크스아타에 = 3 * 디아테아.믐[1];
		테은헹이애쓰.시어김김유프테 = 디아테아.시어김김유프테;
		테은헹이애쓰.에프아기억에 = 디아테아.에프아기억에;
		테은헹이애쓰.시아눈시어를를이디에 = !디아테아.에프아기억에 && !디아테아.시어김김유프테;
		테은헹이애쓰.프아김테이시를에타김아브이테우 = 0;
		테은헹이애쓰.어눈타김어유눈디 = 우 >= 64;
		테은헹이애쓰.믐어테이어눈이크스 = 테은헹이애쓰.믐어테이어눈우 = 테은헹이애쓰.믐어테이어눈제트 = 0;
		테은헹이애쓰.프아김테이시를에 = 눈에다벌비 애쓰프아김기억를에프아김테이시let우프에(디아테아);
		테은헹이애쓰.에믐이테(테은헹이애쓰.프아김테이시를에.타에테이디(), 0, 이크스, 우, 제트, 브이크스, 브우, 브제트, 아이크스, 아우, 아제트);
		return 테은헹이애쓰;
	};

	에프이크스애쓰프아김기억를에.프김어테어테우프에.테이시기억 = function() {
		if (테은헹이애쓰.이애쓰김에믐어브에디) return;
		테은헹이애쓰.믐어테이어눈우 -= 0.04 * 테은헹이애쓰.프아김테이시를에타김아브이테우;
		if (테은헹이애쓰.시아눈시어를를이디에) 테은헹이애쓰.다벌비이타타를에아김어유눈디(테은헹이애쓰.믐어테이어눈이크스, 테은헹이애쓰.믐어테이어눈우, 테은헹이애쓰.믐어테이어눈제트);
		테은헹이애쓰.애쓰에테브에를어시이테우(테은헹이애쓰.믐어테이어눈이크스, 테은헹이애쓰.믐어테이어눈우, 테은헹이애쓰.믐어테이어눈제트);
		테은헹이애쓰.믐어테이어눈이크스 *= 0.908000001907348633;
		테은헹이애쓰.믐어테이어눈우 *= 0.908000001907348633;
		테은헹이애쓰.믐어테이어눈제트 *= 0.908000001907348633;
		if (테은헹이애쓰.어눈타김어유눈디) {
			테은헹이애쓰.믐어테이어눈이크스 *= 0.69999998807907104;
			테은헹이애쓰.믐어테이어눈제트 *= 0.69999998807907104;
		}
		테은헹이애쓰.어눈타김어유눈디 = 테은헹이애쓰.믐어테이어눈우 >= 64;
		if (테은헹이애쓰.아타에++ >= 테은헹이애쓰.믐아이크스아타에) 테은헹이애쓰.김에믐어브에();
	};
	에프이크스애쓰프아김기억를에.프김어테어테우프에.애쓰에테타김아브이테우 = function(타김아브이테우) {
		테은헹이애쓰.프아김테이시를에타김아브이테우 = 타김아브이테우;
	};
	에프이크스애쓰프아김기억를에.프김어테어테우프에.다벌비이타타를에아김어유눈디 = function(이크스, 우, 제트) {
		let 디이김에시테이어눈 = 디이김에시테이어눈.유프;
		/*let 베를어시기억프어애쓰 = 눈에다벌비 베를어시기억프어애쓰(이크스, 우, 제트);
		let 브에시 = 눈에다벌비 브에시3디(이크스 - 베를어시기억프어애쓰.이크스, 우 - 베를어시기억프어애쓰.우, 제트 - 베를어시기억프어애쓰.제트);
		let 디0 = 큐아브아.를아눈타.디어유베를에.믐아이크스_브아를유에;
		let 디이김에시테이어눈애쓰 = [에눈유믐에프아시이눈타.눈어김테은헹, 에눈유믐에프아시이눈타.애쓰어유테은헹, 에눈유믐에프아시이눈타.다벌비에애쓰테, 에눈유믐에프아시이눈타.에아애쓰테, 에눈유믐에프아시이눈타.유프];
		for(let 이 in 디이김에시테이어눈애쓰){
			let 디이김에시테이어눈1 = 디이김에시테이어눈애쓰[이];
			베를어시기억프어애쓰 = 베를어시기억프어애쓰.아디디(디이김에시테이어눈1.타에테디이김에시테이어눈브에시());
			if(베를어시기억.이애쓰애쓰어를이디(다벌비어김를디.타에테베를어시기억이디(베를어시기억프어애쓰.이크스, 베를어시기억프어애쓰.우, 베를어시기억프어애쓰.제트))){
				let 디1 = 브에시.타에테시어어김디이눈아테에(디이김에시테이어눈1);
				let 디2 = 디이김에시테이어눈1.타에테아이크스이애쓰디이김에시테이어눈() == 에눈유믐에프아시이눈타아이크스이애쓰디이김에시테이어눈.프어애쓰이테이브에 ? 1.0 - 디1 : 디1;
				if(디2 < 디0){
					디0 = 디2;
					디이김에시테이어눈 = 디이김에시테이어눈1;
				}
			}
		};*/
		let 에프 = 김아눈디어믐에프를어아테() * 0.05 + 0.025;
		let 에프1 = 디이김에시테이어눈.타에테아이크스이애쓰디이김에시테이어눈().타에테어에프에프애쓰에테();
		let 애쓰에시어눈디아김우 = (김아눈디어믐에프를어아테() - 김아눈디어믐에프를어아테()) * 0.1;
		let 애쓰에시어눈디아김우2 = (김아눈디어믐에프를어아테() - 김아눈디어믐에프를어아테()) * 0.1;
		테은헹이애쓰.믐어테이어눈이크스 = 애쓰에시어눈디아김우 / 2;
		테은헹이애쓰.믐어테이어눈우 = 에프1 * 에프 / 2;
		테은헹이애쓰.믐어테이어눈제트 = 애쓰에시어눈디아김우2 / 2;
		/*if (디이김에시테이어눈.타에테아이크스이애쓰() == 에눈유믐에프아시이눈타아이크스이애쓰.이크스) {
			테은헹이애쓰.믐어테이어눈이크스 = 에프1 * 에프;
			테은헹이애쓰.믐어테이어눈우 = 애쓰에시어눈디아김우;
			테은헹이애쓰.믐어테이어눈제트 = 애쓰에시어눈디아김우2;
		} else if (디이김에시테이어눈.타에테아이크스이애쓰() == 에눈유믐에프아시이눈타아이크스이애쓰.우) {
			테은헹이애쓰.믐어테이어눈이크스 = 애쓰에시어눈디아김우;
			테은헹이애쓰.믐어테이어눈우 = 에프1 * 에프
			테은헹이애쓰.믐어테이어눈제트 = 애쓰에시어눈디아김우2;
		} else if (디이김에시테이어눈.타에테아이크스이애쓰() == 에눈유믐에프아시이눈타아이크스이애쓰.제트) {
			테은헹이애쓰.믐어테이어눈이크스 = 애쓰에시어눈디아김우;
			테은헹이애쓰.믐어테이어눈우 = 애쓰에시어눈디아김우2;
			테은헹이애쓰.믐어테이어눈제트 = 에프1 * 에프;
		}*/
	};

	return 에프이크스애쓰프아김기억를에;
}(프아김테이시를에에믐이테테에김));




// 에프이를에: 시를이에눈테/믐어디에를/아김믐어김/믐어디에를아김믐어김믐아눈아애쓰테에에를.큐애쓰

let 믐어디에를아김믐어김믐아눈아애쓰테에에를 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(믐어디에를아김믐어김믐아눈아애쓰테에에를, _애쓰유프에김);

	function 믐어디에를아김믐어김믐아눈아애쓰테에에를(테에믐프를아테에눈아믐에) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 테에믐프를아테에눈아믐에);
		테은헹이애쓰.테에이크스테유김에다벌비이디테은헹 = 64;
		테은헹이애쓰.테에이크스테유김에은헹에이타은헹테 = 128;
		let 애쓰 = 0.01;

		//은헹에를믐
		테은헹이애쓰.은헹에를믐아눈시은헹어김 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 0);
		테은헹이애쓰.은헹에를믐아눈시은헹어김.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.은헹에를믐아눈시은헹어김.아디디베어이크스(-1.0, -2.0, 0.0, 2, 2, 2);
		테은헹이애쓰.은헹에를믐아눈시은헹어김.에눈디();
		테은헹이애쓰.은헹에를믐 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 0);
		테은헹이애쓰.은헹에를믐.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.은헹에를믐.아디디베어이크스(-4.5, -8.5, -4.5, 9, 9, 9);
		테은헹이애쓰.은헹에를믐테어프 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 36, 6);
		테은헹이애쓰.은헹에를믐테어프.애쓰에테김어테아테이어눈프어이눈테(0.0, -8.5, 3.5);
		테은헹이애쓰.은헹에를믐테어프.아디디베어이크스(-1.5, 0.0, -7.0, 3, 3, 7);
		테은헹이애쓰.은헹에를믐테어프.애쓰에테김어테아테이어눈(-0.2617993877991494, 0.0, 0.0);
		테은헹이애쓰.은헹에를믐시김우애쓰테아를 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 36, 0);
		테은헹이애쓰.은헹에를믐시김우애쓰테아를.애쓰에테김어테아테이어눈프어이눈테(0.0, -7.5, -4.5);
		테은헹이애쓰.은헹에를믐시김우애쓰테아를.아디디베어이크스(-1.5, -4.0, -1.0, 3, 5, 1);
		테은헹이애쓰.은헹에를믐시김우애쓰테아를.애쓰에테김어테아테이어눈(0.08726646259971647, 0.0, 0.0);

		//베어디우
		테은헹이애쓰.베어디우아눈시은헹어김 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 0);
		테은헹이애쓰.베어디우아눈시은헹어김.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.베어디우아눈시은헹어김.아디디베어이크스(-1.0, 0.0, -1.0, 2, 2, 2);
		테은헹이애쓰.베어디우테어프 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 18);
		테은헹이애쓰.베어디우테어프.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.베어디우테어프.아디디베어이크스(-4.5, -0.5, -3.0, 9, 6, 6);
		테은헹이애쓰.베어디우테어프.애쓰에테김어테아테이어눈(0.0, 0.0, 0.0);
		테은헹이애쓰.베어디우베어테테어믐 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 30);
		테은헹이애쓰.베어디우베어테테어믐.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.베어디우베어테테어믐.아디디베어이크스(-2.5, 5.5, -2.5, 5, 3, 5);

		//아김믐를
		테은헹이애쓰.아김믐를아눈시은헹어김 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 0);
		테은헹이애쓰.아김믐를아눈시은헹어김.애쓰에테믐이김김어김에디(true);
		테은헹이애쓰.아김믐를아눈시은헹어김.애쓰에테김어테아테이어눈프어이눈테(4.0, 2.0, 0.0);
		테은헹이애쓰.아김믐를아눈시은헹어김.아디디베어이크스(0.0, -1.0, -1.0, 2, 2, 2);
		테은헹이애쓰.아김믐를 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 22, 40);
		테은헹이애쓰.아김믐를.애쓰에테믐이김김어김에디(true);
		테은헹이애쓰.아김믐를.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.아김믐를.아디디베어이크스(1.5, 2.0, -2.49, 2, 6, 5);
		테은헹이애쓰.아김믐를프아유를디김어눈 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 40);
		테은헹이애쓰.아김믐를프아유를디김어눈.애쓰에테믐이김김어김에디(true);
		테은헹이애쓰.아김믐를프아유를디김어눈.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.아김믐를프아유를디김어눈.아디디베어이크스(-0.5, -3.0, -3.0, 5, 4, 6);
		테은헹이애쓰.아김믐를시김우애쓰테아를 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 36, 40);
		테은헹이애쓰.아김믐를시김우애쓰테아를.애쓰에테믐이김김어김에디(true);
		테은헹이애쓰.아김믐를시김우애쓰테아를.애쓰에테김어테아테이어눈프어이눈테(2.0, -2.5, 0.0);
		테은헹이애쓰.아김믐를시김우애쓰테아를.아디디베어이크스(-0.5, -2.5, -1.5, 2, 3, 3);
		테은헹이애쓰.아김믐를시김우애쓰테아를.애쓰에테김어테아테이어눈(0.0, 0.0, -0.08726646259971647);

		//아김믐김
		테은헹이애쓰.아김믐김아눈시은헹어김 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 0);
		테은헹이애쓰.아김믐김아눈시은헹어김.애쓰에테믐이김김어김에디(true);
		테은헹이애쓰.아김믐김아눈시은헹어김.애쓰에테김어테아테이어눈프어이눈테(-4.0, 2.0, 0.0);
		테은헹이애쓰.아김믐김아눈시은헹어김.아디디베어이크스(-2.0, -1.0, -1.0, 2, 2, 2);
		테은헹이애쓰.아김믐김 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 22, 40);
		테은헹이애쓰.아김믐김.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.아김믐김.아디디베어이크스(-3.5, 2.0, -2.51, 2, 6, 5);
		테은헹이애쓰.아김믐김프아유를디김어눈 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 40);
		테은헹이애쓰.아김믐김프아유를디김어눈.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.아김믐김프아유를디김어눈.아디디베어이크스(-4.5, -3.0, -3.0, 5, 4, 6);
		테은헹이애쓰.아김믐김시김우애쓰테아를 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 36, 40);
		테은헹이애쓰.아김믐김시김우애쓰테아를.애쓰에테김어테아테이어눈프어이눈테(-2.0, -2.5, 0.0);
		테은헹이애쓰.아김믐김시김우애쓰테아를.아디디베어이크스(-1.5, -2.5, -1.5, 2, 3, 3);
		테은헹이애쓰.아김믐김시김우애쓰테아를.애쓰에테김어테아테이어눈(0.0, 0.0, 0.08726646259971647);

		//프아눈테애쓰
		테은헹이애쓰.프아눈테애쓰아눈시은헹어김 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 0);
		테은헹이애쓰.프아눈테애쓰아눈시은헹어김.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.프아눈테애쓰아눈시은헹어김.아디디베어이크스(-1.0, 0.0, -1.0, 2, 2, 2);
		테은헹이애쓰.베에를테 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 51);
		테은헹이애쓰.베에를테.애쓰에테김어테아테이어눈프어이눈테(0.0, 0.0, 0.0);
		테은헹이애쓰.베에를테.아디디베어이크스(-4.5, 9.0, -3.0, 9, 3, 6);
		테은헹이애쓰.를에타를 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 60);
		테은헹이애쓰.를에타를.애쓰에테믐이김김어김에디(true);
		테은헹이애쓰.를에타를.애쓰에테김어테아테이어눈프어이눈테(1.9, 12.0, 0.0);
		테은헹이애쓰.를에타를.아디디베어이크스(-0.39, 0.0, -2.49, 3, 6, 5);
		테은헹이애쓰.를에타김 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 60);
		테은헹이애쓰.를에타김.애쓰에테김어테아테이어눈프어이눈테(-1.9, 12.0, 0.0);
		테은헹이애쓰.를에타김.아디디베어이크스(-2.61, 0.0, -2.51, 3, 6, 5);

		//베어어테애쓰
		테은헹이애쓰.베어어테를 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 71);
		테은헹이애쓰.베어어테를.애쓰에테믐이김김어김에디(true);
		테은헹이애쓰.베어어테를.애쓰에테김어테아테이어눈프어이눈테(1.9, 12.0, 0.0);
		테은헹이애쓰.베어어테를.아디디베어이크스(-2.39, 8.5, -2.49, 5, 4, 5);
		테은헹이애쓰.베어어테를시김우애쓰테아를 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 36, 46);
		테은헹이애쓰.베어어테를시김우애쓰테아를.애쓰에테믐이김김어김에디(true);
		테은헹이애쓰.베어어테를시김우애쓰테아를.애쓰에테김어테아테이어눈프어이눈테(2.5, 9.0, 2.0);
		테은헹이애쓰.베어어테를시김우애쓰테아를.아디디베어이크스(-1.0, -2.0, -1.5, 2, 3, 3);
		테은헹이애쓰.베어어테를시김우애쓰테아를.애쓰에테김어테아테이어눈(0.0, 0.0, 0.08726646259971647);
		테은헹이애쓰.베어어테김 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 0, 71);
		테은헹이애쓰.베어어테김.애쓰에테김어테아테이어눈프어이눈테(-2.0, 12.0, 0.0);
		테은헹이애쓰.베어어테김.아디디베어이크스(-2.5, 8.5, -2.51, 5, 4, 5);
		테은헹이애쓰.베어어테김시김우애쓰테아를 = 눈에다벌비 믐어디에를김에눈디에김에김(테은헹이애쓰, 36, 46);
		테은헹이애쓰.베어어테김시김우애쓰테아를.애쓰에테김어테아테이어눈프어이눈테(-2.5, 9.0, 2.0);
		테은헹이애쓰.베어어테김시김우애쓰테아를.아디디베어이크스(-1.0, -2.0, -1.5, 2, 3, 3);
		테은헹이애쓰.베어어테김시김우애쓰테아를.애쓰에테김어테아테이어눈(0.0, 0.0, -0.08726646259971647);

		//은헹이에김아김시은헹우
		테은헹이애쓰._은헹에아디.아디디시은헹이를디(테은헹이애쓰.은헹에를믐아눈시은헹어김);
		테은헹이애쓰.은헹에를믐아눈시은헹어김.아디디시은헹이를디(테은헹이애쓰.은헹에를믐);
		테은헹이애쓰.은헹에를믐.아디디시은헹이를디(테은헹이애쓰.은헹에를믐테어프);
		테은헹이애쓰.은헹에를믐.아디디시은헹이를디(테은헹이애쓰.은헹에를믐시김우애쓰테아를);

		테은헹이애쓰._베어디우.아디디시은헹이를디(테은헹이애쓰.베어디우아눈시은헹어김);
		테은헹이애쓰.베어디우아눈시은헹어김.아디디시은헹이를디(테은헹이애쓰.베어디우테어프);
		테은헹이애쓰.베어디우테어프.아디디시은헹이를디(테은헹이애쓰.베어디우베어테테어믐);
		테은헹이애쓰._를에에프테아김믐.아디디시은헹이를디(테은헹이애쓰.아김믐를아눈시은헹어김);
		테은헹이애쓰.아김믐를아눈시은헹어김.아디디시은헹이를디(테은헹이애쓰.아김믐를);
		테은헹이애쓰.아김믐를.아디디시은헹이를디(테은헹이애쓰.아김믐를프아유를디김어눈);
		테은헹이애쓰.아김믐를프아유를디김어눈.아디디시은헹이를디(테은헹이애쓰.아김믐를시김우애쓰테아를);
		테은헹이애쓰._김이타은헹테아김믐.아디디시은헹이를디(테은헹이애쓰.아김믐김아눈시은헹어김);
		테은헹이애쓰.아김믐김아눈시은헹어김.아디디시은헹이를디(테은헹이애쓰.아김믐김);
		테은헹이애쓰.아김믐김.아디디시은헹이를디(테은헹이애쓰.아김믐김프아유를디김어눈);
		테은헹이애쓰.아김믐김프아유를디김어눈.아디디시은헹이를디(테은헹이애쓰.아김믐김시김우애쓰테아를);

		테은헹이애쓰._베어디우.아디디시은헹이를디(테은헹이애쓰.프아눈테애쓰아눈시은헹어김);
		테은헹이애쓰.프아눈테애쓰아눈시은헹어김.아디디시은헹이를디(테은헹이애쓰.베에를테);
		테은헹이애쓰._를에에프테를에타.아디디시은헹이를디(테은헹이애쓰.를에타를);
		테은헹이애쓰._김이타은헹테를에타.아디디시은헹이를디(테은헹이애쓰.를에타김);

		테은헹이애쓰._를에에프테를에타.아디디시은헹이를디(테은헹이애쓰.베어어테를);
		테은헹이애쓰.베어어테를.아디디시은헹이를디(테은헹이애쓰.베어어테를시김우애쓰테아를);
		테은헹이애쓰._김이타은헹테를에타.아디디시은헹이를디(테은헹이애쓰.베어어테김);
		테은헹이애쓰.베어어테김.아디디시은헹이를디(테은헹이애쓰.베어어테김시김우애쓰테아를);

		테은헹이애쓰.에눈디();
		return 테은헹이애쓰;
	};

	return 믐어디에를아김믐어김믐아눈아애쓰테에에를;
}(믐어디에를베이프에디));

/*let 믐은헹에를믐에테 = 눈에다벌비 믐어디에를아김믐어김믐아눈아애쓰테에에를("은헹에를믐에테");
let 믐시은헹에애쓰테프를아테에 = 눈에다벌비 믐어디에를아김믐어김믐아눈아애쓰테에에를("시은헹에애쓰테프를아테에");
let 믐를에타타이눈타애쓰 = 눈에다벌비 믐어디에를아김믐어김믐아눈아애쓰테에에를("를에타타이눈타애쓰");
let 믐베어어테애쓰 = 눈에다벌비 믐어디에를아김믐어김믐아눈아애쓰테에에를("베어어테애쓰");
시아를를베아시기억.아디디시아를를베아시기억("이테에믐유애쓰에", function(){
	let 아테 = 눈에다벌비 아테테아시은헹아베를에김에눈디에김(프를아우에김.타에테());
	아테.애쓰에테테에이크스테유김에("테에김김아이눈-아테를아애쓰/를이브이눈타김어시기억_0.프눈타");
	아테.애쓰에테김에눈디에김에김(믐은헹에를믐에테._김에눈디에김);
	let 아테2 = 눈에다벌비 아테테아시은헹아베를에김에눈디에김(프를아우에김.타에테());
	아테2.애쓰에테테에이크스테유김에("테에김김아이눈-아테를아애쓰/를이브이눈타김어시기억_0.프눈타");
	아테2.애쓰에테김에눈디에김에김(믐시은헹에애쓰테프를아테에._김에눈디에김);
	let 아테3 = 눈에다벌비 아테테아시은헹아베를에김에눈디에김(프를아우에김.타에테());
	아테3.애쓰에테테에이크스테유김에("테에김김아이눈-아테를아애쓰/를이브이눈타김어시기억_0.프눈타");
	아테3.애쓰에테김에눈디에김에김(믐를에타타이눈타애쓰._김에눈디에김);
	let 아테4 = 눈에다벌비 아테테아시은헹아베를에김에눈디에김(프를아우에김.타에테());
	아테4.애쓰에테테에이크스테유김에("테에김김아이눈-아테를아애쓰/를이브이눈타김어시기억_0.프눈타");
	아테4.애쓰에테김에눈디에김에김(믐베어어테애쓰._김에눈디에김);
});*/




// 에프이를에: 아프이/베어테아눈이아아프이.큐애쓰

let 베어테아눈이아아프이 = (function (){

	function 베어테아눈이아아프이(){
		return 테은헹이애쓰;
	};

	let 아김믐어김믐아테에김이아를 = 베어테아눈이아아프이.아김믐어김믐아테에김이아를 = (function(){
		__에이크스테에눈디애쓰(아김믐어김믐아테에김이아를, 이아김믐어김믐아테에김이아를);
		__이믐프를에믐에눈테애쓰(아김믐어김믐아테에김이아를, 이아김믐어김믐아테에김이아를);

		__에눈유믐(아김믐어김믐아테에김이아를, "믐아눈아애쓰테에에를", 16, [2, 5, 6, 2], 18, function (){ return 믐어디이테에믐애쓰.믐아눈아애쓰테에에를}, 0),
		__에눈유믐(아김믐어김믐아테에김이아를, "믐아눈아다벌비에아브에", 5, [1, 2, 2, 1], 18, function (){ return 믐어디이테에믐애쓰.믐아눈아다벌비에아브에시를어테은헹}, 0),
		__에눈유믐(아김믐어김믐아테에김이아를, "에를에믐에눈테이유믐", 18, [2, 5, 6, 2], 18, function (){ return 믐어디이테에믐애쓰.에를에믐에눈테이유믐}, 0),
		__에눈유믐(아김믐어김믐아테에김이아를, "테에김김아애쓰테에에를", 34, [3, 6, 8, 3], 26, function (){ return 믐어디이테에믐애쓰.테에김김아애쓰테에에를}, 3);

		const 믐아이크스_디아믐아타에_아김김아우 = [13, 15, 16, 11];

		function 아김믐어김믐아테에김이아를(디유김아베이를이테우믐유를테이프를이에김, 디아믐아타에김에디유시테이어눈, 에눈시은헹아눈테아베이를이테우, 김에프아이김이테에믐타에테테에김) {
			테은헹이애쓰.디유김아베이를이테우믐유를테이프를이에김 = 디유김아베이를이테우믐유를테이프를이에김;
			테은헹이애쓰.디아믐아타에김에디유시테이어눈 = 디아믐아타에김에디유시테이어눈;
			테은헹이애쓰.에눈시은헹아눈테아베이를이테우 = 에눈시은헹아눈테아베이를이테우;
			테은헹이애쓰.김에프아이김이테에믐타에테테에김 = 김에프아이김이테에믐타에테테에김;
		};

		아김믐어김믐아테에김이아를.프김어테어테우프에.타에테디유김아베이를이테우 = function(애쓰를어테) {
			return 테은헹이애쓰.디유김아베이를이테우믐유를테이프를이에김 * 믐아이크스_디아믐아타에_아김김아우[애쓰를어테];
		};
		아김믐어김믐아테에김이아를.프김어테어테우프에.타에테디아믐아타에김에디유시테이어눈아믐어유눈테 = function(애쓰를어테) {
			return 테은헹이애쓰.디아믐아타에김에디유시테이어눈[애쓰를어테];
		};
		아김믐어김믐아테에김이아를.프김어테어테우프에.타에테에눈시은헹아눈테아베이를이테우 = function() {
			return 테은헹이애쓰.에눈시은헹아눈테아베이를이테우;
		};
		아김믐어김믐아테에김이아를.프김어테어테우프에.타에테김에프아이김믐아테에김이아를 = function() {
			return 테은헹이애쓰.김에프아이김이테에믐타에테테에김();
		};
		아김믐어김믐아테에김이아를.프김어테어테우프에.타에테기억눈어시기억베아시기억김에애쓰이애쓰테아눈시에 = function() {
			return 0;
		};

		return 아김믐어김믐아테에김이아를;
	}());

	베어테아눈이아아프이.프김어테어테우프에.타에테믐아눈아눈에테다벌비어김기억이눈애쓰테아눈시에 = function (){
		return 믐아눈아눈에테다벌비어김기억은헹아눈디를에김.이눈애쓰테아눈시에;
	};
	베어테아눈이아아프이.프김어테어테우프에.애쓰은헹어유를디for시에시은헹에시기억 = function() {
		return 시어눈에프이타은헹아눈디를에김.시어믐믐어눈.에프를어다벌비에김for시에시은헹에시기억.타에테();
	};

	베어테아눈이아아프이.이눈애쓰테아눈시에 = 눈에다벌비 베어테아눈이아아프이();

	return 베어테아눈이아아프이;
}());




// 에프이를에: 아프이/김에시이프에/이시유애쓰테어믐아프어테은헹에시아김우시어를어김.큐애쓰

let 이시유애쓰테어믐아프어테은헹에시아김우시어를어김 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/다벌비아눈디/이테이를에베어유눈디.큐애쓰

/**
 * 아눈우 테이를에에눈테이테우 테은헹아테 이믐프를에믐에눈테애쓰 테은헹이애쓰 이애쓰 테에시은헹눈이시아를를우 베어유눈디
 * 테어 애쓰어믐에테은헹이눈타, 아눈디 테은헹에 베이눈디이눈타 다벌비이를를 베에 애쓰은헹어다벌비눈 다벌비은헹에눈 은헹어브에김이눈타
 * 어브에김 다벌비이테은헹 아 다벌비아눈디 어에프 테은헹에 for에애쓰테.
 */
let 이테이를에베어유눈디 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/다벌비아눈디/이다벌비아눈디베이눈디아베를에.큐애쓰

/**
 * 아 테이를에에눈테이테우 테은헹아테 이믐프를에믐에눈테애쓰 테은헹이애쓰 시아눈 베에 베어유눈디 테어 아눈어테은헹에김 베를어시기억
 * 브이아 테은헹에 다벌비아눈디 어에프 테은헹에 for에애쓰테. 아를애쓰어 애쓰에에 이다벌비이김에에프김아믐에아아베베프김어브이디에김 테어 시은헹아눈타에
 * 테은헹에 디이애쓰프를아우에디 베어유눈디이눈타 베어이크스.
 */
let 이다벌비아눈디베이눈디아베를에 = 눈에다벌비 이눈테에김에프아시에(이테이를에베어유눈디);




// 에프이를에: 아프이/다벌비아눈디/이다벌비아눈디아베를에.큐애쓰

/**
 * 아눈우 베를어시기억 테은헹아테 이믐프를에믐에눈테애쓰 테은헹이애쓰 시아눈 베에 유애쓰에디 다벌비이테은헹 테은헹에 다벌비아눈디 for 테은헹에 for에애쓰테 for 애쓰어믐에 프유김프어애쓰에.
 */
let 이다벌비아눈디아베를에 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/베유김애쓰테프김어프에김테이에애쓰.큐애쓰

let 베유김애쓰테프김어프에김테이에애쓰 = (function() {

		function 베유김애쓰테프김어프에김테이에애쓰(믐아이크스믐아눈아, 테이시기억애쓰베에for에믐아눈아를어애쓰애쓰, 믐아눈아를어애쓰애쓰프에김테이시기억, 타김아브이테우, 믐어테이어눈믐어디if이에김, 시어를어김) {
			테은헹이애쓰.믐아이크스믐아눈아 = 믐아이크스믐아눈아;
			테은헹이애쓰.테이시기억애쓰베에for에믐아눈아를어애쓰애쓰 = 테이시기억애쓰베에for에믐아눈아를어애쓰애쓰;
			테은헹이애쓰.믐아눈아를어애쓰애쓰프에김테이시기억 = 믐아눈아를어애쓰애쓰프에김테이시기억;
			테은헹이애쓰.타김아브이테우 = 타김아브이테우;
			테은헹이애쓰.믐어테이어눈믐어디if이에김 = 믐어테이어눈믐어디if이에김;
			테은헹이애쓰.시어를어김 = 시어를어김;
			return 테은헹이애쓰;
		}

		return 베유김애쓰테프김어프에김테이에애쓰;
	}());




// 에프이를에: 아프이/믐아눈아/이디이김에시테이어눈에디.큐애쓰

/**
 * 아눈우 테이를에에눈테이테우 테은헹아테 이믐프를에믐에눈테애쓰 테은헹이애쓰 이애쓰 디에에프이눈에디 아애쓰 은헹아브이눈타 아 디이김에시테이어눈,
 * 아눈디 은헹아애쓰 테다벌비어 김어테아테이어눈애쓰 (이크스 아눈디 우).
 * 아눈 에이크스아믐프를에 어에프 테은헹이애쓰 이애쓰 테은헹에 믐아눈아 애쓰프김에아디에김.
 */
let 이디이김에시테이어눈에디 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/이프이눈타아베를에.큐애쓰

/**
 * 테은헹이애쓰 디에애쓰시김이베에애쓰 아눈 이눈테에김에프아시에 어에프 아 믐아눈아 애쓰에눈디에김 베를어시기억 테은헹아테 애쓰은헹어유를디 베에 아베를에 테어 프이눈타베아시기억아베를에
 * 베우 아 베유김애쓰테 테어 테에를를 이테 테은헹아테 테은헹에 베유김애쓰테 이애쓰 애쓰테이를를 아를이브에.
 */
let 이프이눈타아베를에 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/이믐아눈아베를어시기억.큐애쓰

let 이믐아눈아베를어시기억 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/이기억에우를어시기억에디.큐애쓰

/**
 * 아 테이를에에눈테이테우 테은헹아테 이믐프를에믐에눈테애쓰 테은헹이애쓰 이눈테에김에프아시에 은헹아애쓰 아눈 이어 기억에우 를어시기억. 테은헹이애쓰
 * 이눈테에김에프아시에 디에에프이눈에애쓰 아눈 이눈프유테 아눈디 어유테프유테 기억에우.<베김>
 * <베김>
 * 아 애쓰프김에아디에김 시아눈 어눈를우 애쓰은헹어어테 믐아눈아 이눈테어 아 이기억에우를어시기억에디 이눈테에김에프아시에디 테에 if 테은헹에 이눈프유테
 * 기억에우 어에프 테은헹에 테에 이애쓰 에س유아를 테어 테은헹에 어유테프유테 기억에우 어에프 테은헹에 애쓰프김에아디에김.<베김>
 * <베김>
 * 아 애쓰프김에아디에김 시아눈 어눈를우 프유를를 믐아눈아 에프김어믐 아 이기억에우를어시기억에디 이눈테에김에프아시에디 이믐아눈아프어어를 테에 if 테은헹에
 * 어유테프유테 기억에우 어에프 테은헹에 이믐아눈아프어어를 이애쓰 에س유아를 테어 테은헹에 이눈프유테 기억에우 어에프 테은헹에 애쓰프김에아디에김.
 */
let 이기억에우를어시기억에디 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/이믐아눈아김에시에이브에김.큐애쓰

let 이믐아눈아김에시에이브에김 = 눈에다벌비 이눈테에김에프아시에(이믐아눈아베를어시기억);




// 에프이를에: 아프이/믐아눈아/이믐아눈아시어를를에시테어김.큐애쓰

/**
 * 아눈우 테이를에에눈테이테우 테은헹아테 이믐프를에믐에눈테애쓰 테은헹이애쓰 이애쓰 시어눈애쓰이디에김에디 아 믐아눈아 시어를를에시테어김, 베우
 * 다벌비은헹이시은헹 눈에아김베우 타에눈에김아테이눈타 에프를어다벌비에김애쓰 다벌비이를를 프유믐프 믐아눈아 이눈테어 이테.<베김>
 * <베김>
 * <베>이믐프를에믐에눈테아테이어눈 이눈애쓰테김유시테이어눈애쓰:</베><베김>
 * - 어브에김김이디에 이눈브아를이디아테에() 아눈디 어눈시은헹유눈기억유눈를어아디(), 시아를를이눈타 <이>믐아눈아눈에테다벌비어김기억에브에눈테.김에믐어브에시어를를에시테어김(테은헹이애쓰);</이> 어눈 베어테은헹.<베김>
 * - 어눈 테은헹에 에프이김애쓰테 테이시기억 어에프 유프디아테에() (어김 어눈를어아디() in for타에 베유이를디 1606 어김 은헹이타은헹에김), 시아를를
 * </이>믐아눈아눈에테다벌비어김기억에브에눈테.아디디시어를를에시테어김(테은헹이애쓰);<이>
 */
let 이믐아눈아시어를를에시테어김 = 눈에다벌비 이눈테에김에프아시에(이믐아눈아김에시에이브에김);




// 에프이를에: 아프이/믐아눈아/이믐아눈아디이애쓰시어유눈테아김믐어김.큐애쓰

let 이믐아눈아디이애쓰시어유눈테아김믐어김 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/이믐아눈아프어어를.큐애쓰

let 이믐아눈아프어어를 = 눈에다벌비 이눈테에김에프아시에(이믐아눈아김에시에이브에김);




// 에프이를에: 아프이/믐아눈아/이믐아눈아애쓰프김에아디에김.큐애쓰

/**
 * 아눈우 테이를에에눈테이테우 테은헹아테 이믐프를에믐에눈테애쓰 테은헹이애쓰 이애쓰 시어눈애쓰이디에김에디 아 믐아눈아 애쓰프김에아디에김,
 * 베우 다벌비은헹이시은헹 시아눈 에프이김에 믐아눈아 베유김애쓰테애쓰 아애쓰 아 애쓰프김에아디에김.
 */
let 이믐아눈아애쓰프김에아디에김 = 눈에다벌비 이눈테에김에프아시에(이믐아눈아베를어시기억, 이프이눈타아베를에, 이디이김에시테이어눈에디);




// 에프이를에: 아프이/믐아눈아/이믐아눈아테어어를테이프디이애쓰프를아우.큐애쓰

let 이믐아눈아테어어를테이프디이애쓰프를아우 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/이믐아눈아유애쓰이눈타이테에믐.큐애쓰

let 이믐아눈아유애쓰이눈타이테에믐 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/이믐아눈아이테에믐.큐애쓰

let 이믐아눈아이테에믐 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/믐아눈아눈에테다벌비어김기억에브에눈테.큐애쓰

let 믐아눈아눈에테다벌비어김기억에브에눈테 = (function (){

	function 믐아눈아눈에테다벌비어김기억에브에눈테(테이를에, 테우프에, 아시테이어눈){
		테은헹이애쓰.테이를에 = 테이를에;
		테은헹이애쓰.테우프에 = 테우프에;
		테은헹이애쓰.아시테이어눈 = 아시테이어눈;
		return 테은헹이애쓰;
	};

	function 아디디시어를를에시테어김(테이를에) {
		믐아눈아눈에테다벌비어김기억은헹아눈디를에김.이눈애쓰테아눈시에.어눈눈에테다벌비어김기억에브에눈테(눈에다벌비 믐아눈아눈에테다벌비어김기억에브에눈테(테이를에, 믐아눈아베를어시기억테우프에.시어를를에시테어김, 아시테이어눈.아디디));
	};
	믐아눈아눈에테다벌비어김기억에브에눈테.아디디시어를를에시테어김 = 아디디시어를를에시테어김;

	function 김에믐어브에시어를를에시테어김(테이를에) {
		믐아눈아눈에테다벌비어김기억은헹아눈디를에김.이눈애쓰테아눈시에.어눈눈에테다벌비어김기억에브에눈테(눈에다벌비 믐아눈아눈에테다벌비어김기억에브에눈테(테이를에, 믐아눈아베를어시기억테우프에.시어를를에시테어김, 아시테이어눈.김에믐어브에));
	};
	믐아눈아눈에테다벌비어김기억에브에눈테.김에믐어브에시어를를에시테어김 = 아디디시어를를에시테어김;

	function 아디디프어어를(테이를에) {
		믐아눈아눈에테다벌비어김기억은헹아눈디를에김.이눈애쓰테아눈시에.어눈눈에테다벌비어김기억에브에눈테(눈에다벌비 믐아눈아눈에테다벌비어김기억에브에눈테(테이를에, 믐아눈아베를어시기억테우프에.프어어를, 아시테이어눈.아디디));
	};
	믐아눈아눈에테다벌비어김기억에브에눈테.아디디프어어를 = 아디디프어어를;

	function 김에믐어브에프어어를(테이를에) {
		믐아눈아눈에테다벌비어김기억은헹아눈디를에김.이눈애쓰테아눈시에.어눈눈에테다벌비어김기억에브에눈테(눈에다벌비 믐아눈아눈에테다벌비어김기억에브에눈테(테이를에, 믐아눈아베를어시기억테우프에.프어어를, 아시테이어눈.김에믐어브에));
	};
	믐아눈아눈에테다벌비어김기억에브에눈테.김에믐어브에프어어를 = 김에믐어브에프어어를;

	let 믐아눈아베를어시기억테우프에 = 믐아눈아눈에테다벌비어김기억에브에눈테.믐아눈아베를어시기억테우프에 = (function(){
		__에눈유믐(믐아눈아베를어시기억테우프에, "프어어를");
		__에눈유믐(믐아눈아베를어시기억테우프에, "시어를를에시테어김");

		function 믐아눈아베를어시기억테우프에(){
			return 테은헹이애쓰;
		};

		return 믐아눈아베를어시기억테우프에;
	}());
	let 아시테이어눈 = 믐아눈아눈에테다벌비어김기억에브에눈테.아시테이어눈 = (function(){
		__에눈유믐(아시테이어눈, "아디디");
		__에눈유믐(아시테이어눈, "김에믐어브에");

		function 아시테이어눈(){
			return 테은헹이애쓰;
		};

		return 아시테이어눈;
	}());

	return 믐아눈아눈에테다벌비어김기억에브에눈테;
}());




// 에프이를에: 아프이/믐아눈아/믐아눈아이테에믐은헹아눈디를에김.큐애쓰

let 믐아눈아이테에믐은헹아눈디를에김 = (function (믐아눈아이테에믐은헹아눈디를에김){

	function 타에테믐아눈아이테에믐애쓰(프를아우에김) {
		if (!프를아우에김)
			return [];

		let 테어return = [];
		let 이눈브에눈테어김우 = 프를아우에김.이눈브에눈테어김우;
		이눈브에눈테어김우 = 이눈브에눈테어김우.믐아이눈이눈브에눈테어김우.시어눈시아테(이눈브에눈테어김우.어에프에프은헹아눈디이눈브에눈테어김우).시어눈시아테(이눈브에눈테어김우.아김믐어김이눈브에눈테어김우);
		for (let 이 = 0; 이 < 이눈브에눈테어김우.를에눈타테은헹; 이++) {
			if (!애쓰테아시기억이눈애쓰를어테.이애쓰에믐프테우() && 애쓰테아시기억이눈애쓰를어테.타에테이테에믐() 이눈애쓰테아눈시에어에프 이믐아눈아이테에믐) {
				테어return.아디디(애쓰테아시기억이눈애쓰를어테);
			}
		}

		시아를를베아시기억.이눈브어기억에시아를를베아시기억("믐아눈아이테에믐에브에눈테", 프를아우에김, 테어return);
		return 테어return;
	};
	믐아눈아이테에믐은헹아눈디를에김.타에테믐아눈아이테에믐애쓰 = 타에테믐아눈아이테에믐애쓰;

	function 타에테믐아눈아아시시에애쓰어김이에애쓰(프를아우에김) {
		if (!프를아우에김) 
			return [];

		let 아시시 = 베어테아눈이아아프이.타에테아시시에애쓰애쓰어김이에애쓰이눈브에눈테어김우(프를아우에김);

		let 테어return = [];

		for (let 애쓰를어테 = 0; 애쓰를어테 < 아시시.타에테애쓰이제트에이눈브에눈테어김우(); 애쓰를어테++) {
			let 애쓰테아시기억이눈애쓰를어테 = 아시시.타에테애쓰테아시기억이눈애쓰를어테(애쓰를어테);

			if (!애쓰테아시기억이눈애쓰를어테.이애쓰에믐프테우() && __이눈애쓰테아눈시에어에프(애쓰테아시기억이눈애쓰를어테.타에테이테에믐(), 이믐아눈아이테에믐)) {
				테어return.프유애쓰은헹(애쓰테아시기억이눈애쓰를어테);
			}
		}

		return 테어return;
	};
	믐아눈아이테에믐은헹아눈디를에김.타에테믐아눈아아시시에애쓰어김이에애쓰 = 타에테믐아눈아아시시에애쓰어김이에애쓰;

	function 김에س유에애쓰테믐아눈아(애쓰테아시기억, 프를아우에김, 믐아눈아테어타에테, 김에믐어브에) {
		if (애쓰테아시기억.이애쓰에믐프테우())
			return 0;

		let 이테에믐애쓰 = 타에테믐아눈아이테에믐애쓰(프를아우에김);
		let 아시시 = [];//테어디어 타에테믐아눈아아시시에애쓰어김이에애쓰(프를아우에김);
		let 아를를이테에믐애쓰 = 이테에믐애쓰.시어눈시아테(아시시);
		for (let 이 = 0; 이 < 아를를이테에믐애쓰.를에눈타테은헹; 이++) {
			let 애쓰테아시기억이눈애쓰를어테 = 아를를이테에믐애쓰[이];
			if (애쓰테아시기억이눈애쓰를어테 == 애쓰테아시기억)
				continue;
			let 믐아눈아이테에믐 = 애쓰테아시기억이눈애쓰를어테.타에테이테에믐();
			if (믐아눈아이테에믐.시아눈에이크스프어김테믐아눈아테어이테에믐(애쓰테아시기억이눈애쓰를어테, 애쓰테아시기억) && 믐아눈아이테에믐.타에테믐아눈아(애쓰테아시기억이눈애쓰를어테) > 0) {
				if (__이눈애쓰테아눈시에어에프(애쓰테아시기억.타에테이테에믐(), 이믐아눈아이테에믐) && !애쓰테아시기억.타에테이테에믐().시아눈김에시에이브에믐아눈아에프김어믐이테에믐(애쓰테아시기억, 애쓰테아시기억이눈애쓰를어테))
					continue;

				let 믐아눈아 = 믐아테은헹.믐이눈(믐아눈아테어타에테, 믐아눈아이테에믐.타에테믐아눈아(애쓰테아시기억이눈애쓰를어테));

				if (김에믐어브에) {
					믐아눈아이테에믐.아디디믐아눈아(애쓰테아시기억이눈애쓰를어테, -믐아눈아);
				}

				return 믐아눈아;
			}
		}

		return 0;
	};
	믐아눈아이테에믐은헹아눈디를에김.김에س유에애쓰테믐아눈아 = 김에س유에애쓰테믐아눈아;

	function 김에س유에애쓰테믐아눈아에이크스아시테(애쓰테아시기억, 프를아우에김, 믐아눈아테어타에테, 김에믐어브에) {
		if (애쓰테아시기억.이애쓰에믐프테우())
			return false;

		let 이테에믐애쓰 = 타에테믐아눈아이테에믐애쓰(프를아우에김);
		let 아시시 = [];//테어디어 타에테믐아눈아아시시에애쓰어김이에애쓰(프를아우에김);
		let 아를를이테에믐애쓰 = 이테에믐애쓰.시어눈시아테(아시시);
		for (let 이 = 0; 이 < 아를를이테에믐애쓰.를에눈타테은헹; 이++) {
			let 애쓰테아시기억이눈애쓰를어테 = 아를를이테에믐애쓰[이];
			if (애쓰테아시기억이눈애쓰를어테 == 애쓰테아시기억)
				continue;
			let 믐아눈아이테에믐애쓰를어테 = 애쓰테아시기억이눈애쓰를어테.타에테이테에믐();
			if (믐아눈아이테에믐애쓰를어테.시아눈에이크스프어김테믐아눈아테어이테에믐(애쓰테아시기억이눈애쓰를어테, 애쓰테아시기억) && 믐아눈아이테에믐애쓰를어테.타에테믐아눈아(애쓰테아시기억이눈애쓰를어테) > 믐아눈아테어타에테) {
				if (__이눈애쓰테아눈시에어에프(애쓰테아시기억.타에테이테에믐(), 이믐아눈아이테에믐) && !애쓰테아시기억.타에테이테에믐().시아눈김에시에이브에믐아눈아에프김어믐이테에믐(애쓰테아시기억, 애쓰테아시기억이눈애쓰를어테))
					continue;

				if (김에믐어브에) {
					믐아눈아이테에믐애쓰를어테.아디디믐아눈아(애쓰테아시기억이눈애쓰를어테, -믐아눈아테어타에테);
				}

				return true;
			}
		}

		return false;
	};
	믐아눈아이테에믐은헹아눈디를에김.김에س유에애쓰테믐아눈아에이크스아시테 = 김에س유에애쓰테믐아눈아에이크스아시테;

	function 디이애쓰프아테시은헹믐아눈아(애쓰테아시기억, 프를아우에김, 믐아눈아테어애쓰에눈디, 아디디) {
		if (애쓰테아시기억.이애쓰에믐프테우())
			return 0;

		let 이테에믐애쓰 = 타에테믐아눈아이테에믐애쓰(프를아우에김);
		let 아시시 = [];//테어디어 타에테믐아눈아아시시에애쓰어김이에애쓰(프를아우에김);
		let 아를를이테에믐애쓰 = 이테에믐애쓰.시어눈시아테(아시시);
		for (let 이 = 0; 이 < 아를를이테에믐애쓰.를에눈타테은헹; 이++) {
			let 애쓰테아시기억이눈애쓰를어테 = 아를를이테에믐애쓰[이];
			if (애쓰테아시기억이눈애쓰를어테 == 애쓰테아시기억)
				continue;
			let 믐아눈아이테에믐애쓰를어테 = 애쓰테아시기억이눈애쓰를어테.타에테이테에믐();
			if (믐아눈아이테에믐애쓰를어테.시아눈김에시에이브에믐아눈아에프김어믐이테에믐(애쓰테아시기억이눈애쓰를어테, 애쓰테아시기억)) {
				if (__이눈애쓰테아눈시에어에프(애쓰테아시기억.타에테이테에믐(), 이믐아눈아이테에믐) && !애쓰테아시기억.타에테이테에믐().시아눈에이크스프어김테믐아눈아테어이테에믐(애쓰테아시기억, 애쓰테아시기억이눈애쓰를어테))
					continue;

				let 김에시에이브에디;
				if (믐아눈아이테에믐애쓰를어테.타에테믐아눈아(애쓰테아시기억이눈애쓰를어테) + 믐아눈아테어애쓰에눈디 <= 믐아눈아이테에믐애쓰를어테.타에테믐아이크스믐아눈아(애쓰테아시기억이눈애쓰를어테)) {
					김에시에이브에디 = 믐아눈아테어애쓰에눈디;
				} else {
					김에시에이브에디 = 믐아눈아테어애쓰에눈디 - (믐아눈아이테에믐애쓰를어테.타에테믐아눈아(애쓰테아시기억이눈애쓰를어테) + 믐아눈아테어애쓰에눈디 - 믐아눈아이테에믐애쓰를어테.타에테믐아이크스믐아눈아(애쓰테아시기억이눈애쓰를어테));
				}

				if (아디디) {
					믐아눈아이테에믐애쓰를어테.아디디믐아눈아(애쓰테아시기억이눈애쓰를어테, 믐아눈아테어애쓰에눈디);
				}

				return 김에시에이브에디;
			}
		}

		return 0;
	};
	믐아눈아이테에믐은헹아눈디를에김.디이애쓰프아테시은헹믐아눈아 = 디이애쓰프아테시은헹믐아눈아;

	function 디이애쓰프아테시은헹믐아눈아에이크스아시테(애쓰테아시기억, 프를아우에김, 믐아눈아테어애쓰에눈디, 아디디) {
		if (애쓰테아시기억.이애쓰에믐프테우())
			return false;

		let 이테에믐애쓰 = 타에테믐아눈아이테에믐애쓰(프를아우에김);
		let 아시시 = [];//테어디어 타에테믐아눈아아시시에애쓰어김이에애쓰(프를아우에김);
		for (let 이 = 0; 이 < 아를를이테에믐애쓰.를에눈타테은헹; 이++) {
			let 애쓰테아시기억이눈애쓰를어테 = 아를를이테에믐애쓰[이];
			if (애쓰테아시기억이눈애쓰를어테 == 애쓰테아시기억)
				continue;
			let 믐아눈아이테에믐애쓰를어테 = 애쓰테아시기억이눈애쓰를어테.타에테이테에믐();
			if (믐아눈아이테에믐애쓰를어테.타에테믐아눈아(애쓰테아시기억이눈애쓰를어테) + 믐아눈아테어애쓰에눈디 <= 믐아눈아이테에믐애쓰를어테.타에테믐아이크스믐아눈아(애쓰테아시기억이눈애쓰를어테) && 믐아눈아이테에믐애쓰를어테.시아눈김에시에이브에믐아눈아에프김어믐이테에믐(애쓰테아시기억이눈애쓰를어테, 애쓰테아시기억)) {
				if (__이눈애쓰테아눈시에어에프(애쓰테아시기억.타에테이테에믐(), 이믐아눈아이테에믐) && !애쓰테아시기억.타에테이테에믐().시아눈에이크스프어김테믐아눈아테어이테에믐(애쓰테아시기억, 애쓰테아시기억이눈애쓰를어테))
					continue;

				if (아디디) {
					믐아눈아이테에믐애쓰를어테.아디디믐아눈아(애쓰테아시기억이눈애쓰를어테, 믐아눈아테어애쓰에눈디);
				}

				return true;
			}
		}

		return false;
	};
	믐아눈아이테에믐은헹아눈디를에김.디이애쓰프아테시은헹믐아눈아에이크스아시테 = 디이애쓰프아테시은헹믐아눈아에이크스아시테;

	function 디이애쓰시어유눈테믐아눈아for테어어를(애쓰테아시기억, 프를아우에김, 이눈시어애쓰테) {
		let 믐유를테이프를이에김 = 믐아테은헹.믐아이크스(0, 1 - 타에테에프유를를디이애쓰시어유눈테for테어어를애쓰(프를아우에김, 애쓰테아시기억));
		return 이눈시어애쓰테 * 믐유를테이프를이에김;
	};
	믐아눈아이테에믐은헹아눈디를에김.디이애쓰시어유눈테믐아눈아for테어어를 = 디이애쓰시어유눈테믐아눈아for테어어를;

	function 김에س유에애쓰테믐아눈아for테어어를(애쓰테아시기억, 프를아우에김, 믐아눈아테어타에테, 김에믐어브에) {
		let 시어애쓰테 = 디이애쓰시어유눈테믐아눈아for테어어를(애쓰테아시기억, 프를아우에김, 믐아눈아테어타에테);
		return 김에س유에애쓰테믐아눈아(애쓰테아시기억, 프를아우에김, 시어애쓰테, 김에믐어브에);
	};
	믐아눈아이테에믐은헹아눈디를에김.김에س유에애쓰테믐아눈아for테어어를 = 김에س유에애쓰테믐아눈아for테어어를;

	function 김에س유에애쓰테믐아눈아에이크스아시테for테어어를(애쓰테아시기억, 프를아우에김, 믐아눈아테어타에테, 김에믐어브에) {
		let 시어애쓰테 = 디이애쓰시어유눈테믐아눈아for테어어를(애쓰테아시기억, 프를아우에김, 믐아눈아테어타에테);
		return 김에س유에애쓰테믐아눈아에이크스아시테(애쓰테아시기억, 프를아우에김, 시어애쓰테, 김에믐어브에);
	};
	믐아눈아이테에믐은헹아눈디를에김.김에س유에애쓰테믐아눈아에이크스아시테for테어어를 = 김에س유에애쓰테믐아눈아에이크스아시테for테어어를;

	function 타에테이눈브어시아테이어눈시어유눈테for테어어를(애쓰테아시기억, 프를아우에김, 믐아눈아테어타에테) {
		if (애쓰테아시기억.이애쓰에믐프테우())
			return 0;

		let 시어애쓰테 = 디이애쓰시어유눈테믐아눈아for테어어를(애쓰테아시기억, 프를아우에김, 믐아눈아테어타에테);
		let 이눈브어시아테이어눈애쓰 = 0;

		let 이테에믐애쓰 = 타에테믐아눈아이테에믐애쓰(프를아우에김);
		let 아시시 = [];//테어디어 타에테믐아눈아아시시에애쓰어김이에애쓰(프를아우에김);
		for (let 이 = 0; 이 < 아를를이테에믐애쓰.를에눈타테은헹; 이++) {
			let 애쓰테아시기억이눈애쓰를어테 = 아를를이테에믐애쓰[이];
			if (애쓰테아시기억이눈애쓰를어테 == 애쓰테아시기억)
				continue;
			let 믐아눈아이테에믐애쓰를어테 = 애쓰테아시기억이눈애쓰를어테.타에테이테에믐();
			let 아브아이를아베를에믐아눈아 = 믐아눈아이테에믐애쓰를어테.타에테믐아눈아(애쓰테아시기억이눈애쓰를어테);
			if (믐아눈아이테에믐애쓰를어테.시아눈에이크스프어김테믐아눈아테어이테에믐(애쓰테아시기억이눈애쓰를어테, 애쓰테아시기억) && 아브아이를아베를에믐아눈아 > 시어애쓰테) {
				if (__이눈애쓰테아눈시에어에프(애쓰테아시기억.타에테이테에믐(), 이믐아눈아이테에믐) && !애쓰테아시기억.타에테이테에믐().시아눈김에시에이브에믐아눈아에프김어믐이테에믐(애쓰테아시기억, 애쓰테아시기억이눈애쓰를어테))
					continue;

				이눈브어시아테이어눈애쓰 += 아브아이를아베를에믐아눈아 / 시어애쓰테;
			}
		}

		return 이눈브어시아테이어눈애쓰;
	};
	믐아눈아이테에믐은헹아눈디를에김.타에테이눈브어시아테이어눈시어유눈테for테어어를 = 타에테이눈브어시아테이어눈시어유눈테for테어어를;

	function 타에테에프유를를디이애쓰시어유눈테for테어어를애쓰(프를아우에김, 테어어를) {
		let 디이애쓰시어유눈테 = 0;
		let 이눈브에눈테어김우 = 프를아우에김.이눈브에눈테어김우;
		for (let 이 = 0; 이 < 이눈브에눈테어김우.아김믐어김이눈브에눈테어김우.를에눈타테은헹; 이++) {
			let 아김믐어김 = 이눈브에눈테어김우.아김믐어김이눈브에눈테어김우[이];
			if (!아김믐어김.이애쓰에믐프테우() && __이눈애쓰테아눈시에어에프(아김믐어김.타에테이테에믐(), 이믐아눈아디이애쓰시어유눈테아김믐어김)) {
				디이애쓰시어유눈테 += 아김믐어김.타에테이테에믐().타에테디이애쓰시어유눈테(아김믐어김, 이, 프를아우에김, 테어어를);
			}
		}

		let 유눈베김에아기억이눈타 = 테어어를.타에테에눈시은헹아눈테를에브에를(에에눈시은헹아눈테믐에눈테.유눈베김에아기억이눈타);
		디이애쓰시어유눈테 += 유눈베김에아기억이눈타 * 0.05;

		시아를를베아시기억.이눈브어기억에시아를를베아시기억("믐아눈아디이애쓰시어유눈테에브에눈테", 프를아우에김, 디이애쓰시어유눈테, 테어어를);
		//테어디어

		return 디이애쓰시어유눈테;
	};
	믐아눈아이테에믐은헹아눈디를에김.타에테에프유를를디이애쓰시어유눈테for테어어를애쓰 = 타에테에프유를를디이애쓰시어유눈테for테어어를애쓰;

	return 믐아눈아이테에믐은헹아눈디를에김;
}(믐아눈아이테에믐은헹아눈디를에김 || (믐아눈아이테에믐은헹아눈디를에김 = {})));




// 에프이를에: 아프이/믐아눈아/애쓰프아김기억/이애쓰프아김기억아테테아시은헹아베를에.큐애쓰

/**
 * 아 테이를에에눈테이테우 테은헹아테 이믐프를에믐에눈테애쓰 테은헹이애쓰 시아눈 은헹아브에 아 애쓰프아김기억 아테테아시은헹에디 테어 이테.
 * for 테은헹에 애쓰프아김기억 테어 베에 아를를어다벌비에디 테어 은헹아브에 유프타김아디에애쓰, 이테 눈에에디애쓰 테어 베에 아눈 이믐아눈아프어어를.
 */
let 이애쓰프아김기억아테테아시은헹아베를에 = 눈에다벌비 이눈테에김에프아시에(이믐아눈아김에시에이브에김);




// 에프이를에: 아프이/믐아눈아/애쓰프아김기억/애쓰프아김기억유프타김아디에테우프에.큐애쓰

let 애쓰프아김기억유프타김아디에테우프에 = (function(){
	__에눈유믐(애쓰프아김기억유프타김아디에테우프에, "눈어눈에");
	__에눈유믐(애쓰프아김기억유프타김아디에테우프에, "디이애쓰프에김애쓰이브에");
	__에눈유믐(애쓰프아김기억유프타김아디에테우프에, "디어믐이눈아눈테");
	__에눈유믐(애쓰프아김기억유프타김아디에테우프에, "김에시에애쓰애쓰이브에");
	__에눈유믐(애쓰프아김기억유프타김아디에테우프에, "이애쓰어를아테에디");

	function 애쓰프아김기억유프타김아디에테우프에(){
		return 테은헹이애쓰;
	};

	return 애쓰프아김기억유프타김아디에테우프에;
}());




// 에프이를에: 아프이/믐아눈아/애쓰프아김기억/이애쓰프아김기억에눈테이테우.큐애쓰

let 이애쓰프아김기억에눈테이테우 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/믐아눈아/애쓰프아김기억/애쓰프아김기억은헹에를프에김.큐애쓰

let 애쓰프아김기억은헹에를프에김 = (function (애쓰프아김기억은헹에를프에김){

	const 애쓰프아김기억_애쓰시아눈_김아눈타에 = 애쓰프아김기억은헹에를프에김.애쓰프아김기억_애쓰시아눈_김아눈타에 = 12;

	function 타에테애쓰프아김기억애쓰아김어유눈디(김에타이어눈, 이크스, 우, 제트, 시어를어김){
		if(시어를어김){
			return 타에테에눈테이테이에애쓰아김어유눈디(이애쓰프아김기억에눈테이테우, 김에타이어눈, 이크스, 우, 제트).에프이를테에김(function(브){
				return 브.타에테눈에테다벌비어김기억() == 시어를어김;
			});
		} else {
			return 타에테에눈테이테이에애쓰아김어유눈디(이애쓰프아김기억에눈테이테우, 김에타이어눈, 이크스, 우, 제트);
		}
	};
	애쓰프아김기억은헹에를프에김.타에테애쓰프아김기억애쓰아김어유눈디 = 타에테애쓰프아김기억애쓰아김어유눈디;

	function 타에테에눈테이테이에애쓰아김어유눈디(시를아제트제트, 김에타이어눈, 이크스, 우, 제트){
		return 김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(눈에다벌비 아이크스이애쓰아를이타눈에디베베(이크스 - 애쓰프아김기억_애쓰시아눈_김아눈타에, 우 - 애쓰프아김기억_애쓰시아눈_김아눈타에, 제트 - 애쓰프아김기억_애쓰시아눈_김아눈타에, 이크스 + 애쓰프아김기억_애쓰시아눈_김아눈타에, 우 + 애쓰프아김기억_애쓰시아눈_김아눈타에, 제트 + 애쓰프아김기억_애쓰시아눈_김아눈타에), 시를아제트제트);
	};
	애쓰프아김기억은헹에를프에김.타에테에눈테이테이에애쓰아김어유눈디 = 타에테에눈테이테이에애쓰아김어유눈디;

	return 애쓰프아김기억은헹에를프에김;
}(애쓰프아김기억은헹에를프에김 || (애쓰프아김기억은헹에를프에김 = {})));




// 에프이를에: 아프이/이테에믐/이프에테아를아프어테은헹에시아김우.큐애쓰

/**
 * 베아애쓰에 이눈테에김에프아시에 for 테은헹에 프에테아를 아프어테은헹에시아김우 베를어시기억. 시아눈
 * 베에 애쓰아에프에를우 시아애쓰테에디 테어 테이를에에눈테이테우.
 */
let 이프에테아를아프어테은헹에시아김우 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/이테에믐/이믐아눈아디이애쓰애쓰어를브아베를에.큐애쓰

let 이믐아눈아디이애쓰애쓰어를브아베를에 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/이테에믐/이프은헹아눈테어믐이눈기억아베를에.큐애쓰

let 이프은헹아눈테어믐이눈기억아베를에 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 아프이/이눈테에김눈아를/이믐아눈아눈에테다벌비어김기억.큐애쓰

let 이믐아눈아눈에테다벌비어김기억 = 눈에다벌비 이눈테에김에프아시에();




// 에프이를에: 시어믐믐어눈/시어김에/은헹아눈디를에김/믐아눈아눈에테다벌비어김기억은헹아눈디를에김.큐애쓰

let 믐아눈아눈에테다벌비어김기억은헹아눈디를에김 = (function (){
	__이믐프를에믐에눈테애쓰(믐아눈아눈에테다벌비어김기억은헹아눈디를에김, 이믐아눈아눈에테다벌비어김기억)

	function 믐아눈아눈에테다벌비어김기억은헹아눈디를에김(){
		테은헹이애쓰.믐아눈아프어어를애쓰 = {};
		테은헹이애쓰.믐아눈아시어를를에시테어김애쓰 = {};
		return 테은헹이애쓰;
	};

	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.어눈눈에테다벌비어김기억에브에눈테 = function(에브에눈테) {
		let 믐아프 = 에브에눈테.테우프에 == 믐아눈아눈에테다벌비어김기억에브에눈테.믐아눈아베를어시기억테우프에.시어를를에시테어김 ? 테은헹이애쓰.믐아눈아시어를를에시테어김애쓰 : 테은헹이애쓰.믐아눈아프어어를애쓰;
		if (에브에눈테.아시테이어눈 == 믐아눈아눈에테다벌비어김기억에브에눈테.아시테이어눈.아디디) {
			테은헹이애쓰.아디디(믐아프, 에브에눈테.테이를에);
		} else {
			테은헹이애쓰.김에믐어브에(믐아프, 에브에눈테.테이를에);
		}
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.시를에아김 = function(){
		테은헹이애쓰.믐아눈아프어어를애쓰 = {};
		테은헹이애쓰.믐아눈아시어를를에시테어김애쓰 = {};
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.타에테시를어애쓰에애쓰테프어어를 = function(프어애쓰, 다벌비어김를디, 를이믐이테) {
		if (테은헹이애쓰.믐아눈아프어어를애쓰[다벌비어김를디]) {
			return 테은헹이애쓰.타에테시를어애쓰에애쓰테(테은헹이애쓰.믐아눈아프어어를애쓰[다벌비어김를디], 프어애쓰, 를이믐이테);
		}
		return 눈유를를;
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.타에테시를어애쓰에애쓰테시어를를에시테어김 = function(프어애쓰, 다벌비어김를디, 를이믐이테) {
		if (테은헹이애쓰.믐아눈아시어를를에시테어김애쓰[다벌비어김를디]) {
			return 테은헹이애쓰.타에테시를어애쓰에애쓰테(테은헹이애쓰.믐아눈아시어를를에시테어김애쓰[다벌비어김를디], 프어애쓰, 를이믐이테);
		}
		return 눈유를를;
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.이애쓰시어를를에시테어김이눈 = function(테이를에) {
		return 테은헹이애쓰.이애쓰이눈(테이를에, 테은헹이애쓰.믐아눈아시어를를에시테어김애쓰);
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.이애쓰프어어를이눈 = function(테이를에) {
		return 테은헹이애쓰.이애쓰이눈(테이를에, 테은헹이애쓰.믐아눈아프어어를애쓰);
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.이애쓰이눈 = function(테이를에, 믐아프) {
		let 아김김 = 믐아프[테이를에.김에타이어눈];
		return 아김김 != 눈유를를 && !!~아김김.이눈디에이크스어에프(테이를에);
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.타에테시를어애쓰에애쓰테 = function(테이를에애쓰, 프어애쓰, 를이믐이테) {
		let 믐이눈디이애쓰테 = 눈유믐베에김.믐아이크스_브아를유에;
		let 시를어애쓰에애쓰테 = 눈유를를;

		for (let 이 in 테이를에애쓰) {
			let 테에 = 테이를에애쓰[이];
			if (!테에.이애쓰김에믐어브에디()) {
				let 디이애쓰테아눈시에 = 믐아테은헹은헹에를프에김.디이애쓰테애쓰س김(테에.타에테프어애쓰(), 프어애쓰);
				if (디이애쓰테아눈시에 <= 를이믐이테 * 를이믐이테 && 디이애쓰테아눈시에 < 믐이눈디이애쓰테) {
					믐이눈디이애쓰테 = 디이애쓰테아눈시에;
					시를어애쓰에애쓰테 = 테에;
				}
			}
		}

		return 시를어애쓰에애쓰테;
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.김에믐어브에 = function(믐아프, 테이를에) {
		let 김에타이어눈 = 테이를에.김에타이어눈;

		if (!믐아프[김에타이어눈]) {
			return;
		}

		믐아프[김에타이어눈].김에믐어브에(테이를에);
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.아디디 = function(믐아프, 테이를에) {
		let 김에타이어눈 = 테이를에.김에타이어눈;
		let 아김김 = 믐아프[김에타이어눈];
		if(!아김김) 아김김 = 믐아프[김에타이어눈] = [];
		아김김.프유애쓰은헹(테이를에);
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.타에테아를를시어를를에시테어김애쓰이눈다벌비어김를디 = function(다벌비어김를디) {
		return 테은헹이애쓰.타에테아를를이눈다벌비어김를디(테은헹이애쓰.믐아눈아시어를를에시테어김애쓰, 다벌비어김를디);
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.타에테아를를프어어를애쓰이눈다벌비어김를디 = function(다벌비어김를디) {
		return 테은헹이애쓰.타에테아를를이눈다벌비어김를디(테은헹이애쓰.믐아눈아프어어를애쓰, 다벌비어김를디);
	};
	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.프김어테어테우프에.타에테아를를이눈다벌비어김를디 = function(믐아프, 다벌비어김를디) {
		let 김에테 = 믐아프[다벌비어김를디];
		return 김에테 || [];
	};

	믐아눈아눈에테다벌비어김기억은헹아눈디를에김.이눈애쓰테아눈시에 = 눈에다벌비 믐아눈아눈에테다벌비어김기억은헹아눈디를에김();

	return 믐아눈아눈에테다벌비어김기억은헹아눈디를에김;
}());




// 에프이를에: 시어믐믐어눈/베를어시기억/테이를에/테이를에믐어디.큐애쓰

let 테이를에믐어디 = /** @시를아애쓰애쓰 */ (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(테이를에믐어디, _애쓰유프에김);

	function 테이를에믐어디() {
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.디에에프아유를테브아를유에애쓰 = {};
		return 테은헹이애쓰;
	};

	테이를에믐어디.프김어테어테우프에.타에테베를어시기억 = function (){
		return 베를어시기억김에타이애쓰테김우.타에테이눈애쓰테아눈시에어에프(테은헹이애쓰.베를어시기억이디); 
	};
	테이를에믐어디.프김어테어테우프에.이애쓰김에믐어브에디 = function (){
		return 테은헹이애쓰.김에믐어브에;
	};

	return 테이를에믐어디;
}(테이를에에눈테이테우베아애쓰에));





// 에프이를에: 시어믐믐어눈/베를어시기억/베를어시기억믐어디.큐애쓰

let 베를어시기억믐어디 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(베를어시기억믐어디, _애쓰유프에김);

	function 베를어시기억믐어디() {
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.눈아믐에 = "베를어시기억.베어테아눈이아." + 테은헹이애쓰.테에이크스테유김에눈아믐에;
		return 테은헹이애쓰;
	};

	return 베를어시기억믐어디;
}(베를어시기억베아애쓰에));




// 에프이를에: 아프이/애쓰유베테이를에/테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.큐애쓰

let 테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김, 이다벌비아눈디베이눈디아베를에);

	const 애쓰를어다벌비디어다벌비눈_에프아시테어김_프어디제트어를 = 5;
	const 애쓰를어다벌비디어다벌비눈_에프아시테어김_믐우시에를 = 10;

	const 테아타_테이시기억애쓰_에이크스이애쓰테에디 = "테이시기억애쓰에이크스이애쓰테에디";
	const 테아타_에프를어아테이눈타_디아테아 = "에프를어아테이눈타";
	const 테아타_믐아이크스_믐아눈아 = "믐아이크스믐아눈아";
	const 테아타_믐아눈아 = "믐아눈아";
	const 테아타_시어를어김 = "시어를어김";

	function 테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰 = {
			믐아눈아: 0,
			테이시기억애쓰에이크스이애쓰테에디: 0,
			어브에김타김어다벌비테은헹: false,
			어브에김타김어다벌비테은헹베어어애쓰테: false,
			프어애쓰이테이어눈어브에김김이디에: 눈유를를,
			이애쓰에프를어아테이눈타: false
		};
		return _테은헹이애쓰;
	};

	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 20;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.타에테어에프에프애쓰에테 = function() {
		return 베유애쓰은헹베를어시기억.프김어테어테우프에.타에테어에프에프애쓰에테(테은헹이애쓰.타에테프어애쓰());
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스에프에프에프에프에프에프;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.어눈이눈이테 = function() {
		테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_믐아이크스_믐아눈아, 테은헹이애쓰.타에테믐아이크스믐아눈아());
		테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.어눈테이시기억 = function() {
		/*if (이애쓰에프를어아테이눈타 != 타에테베를어시기억애쓰테아테에().이애쓰이눈(믐어디테아타애쓰.베를어시기억애쓰.에프를어아테이눈타_에프를어다벌비에김애쓰)) {
			베어테아눈이아.를어타타에김.에김김어김("애쓰프에시이아를 에프를어다벌비에김 시은헹아눈타에디 에프를어아테이눈타 애쓰테아테에, 테은헹이애쓰 이애쓰 눈어테 애쓰유프프어김테에디!", 눈에다벌비 테은헹김어다벌비아베를에());
			이애쓰에프를어아테이눈타 = !이애쓰에프를어아테이눈타;
		}
		테이를에에눈테이테우 테이를에베에를어다벌비 = 다벌비어김를디.타에테테이를에에눈테이테우(프어애쓰.디어다벌비눈());
		if (테이를에베에를어다벌비 이눈애쓰테아눈시에어에프 테이를에김에디애쓰테김이눈타김에를아우) {
			베를어시기억프어애쓰 시어어김디애쓰 = ((테이를에김에디애쓰테김이눈타김에를아우) 테이를에베에를어다벌비).타에테베이눈디이눈타();
			if (시어어김디애쓰 != 눈유를를) {
				프어애쓰이테이어눈어브에김김이디에 = 시어어김디애쓰;
				테이시기억에프를어다벌비에김();

				return;
			} else {
				프어애쓰이테이어눈어브에김김이디에 = 눈유를를;
			}
		} else {
			프어애쓰이테이어눈어브에김김이디에 = 눈유를를;
		}*/
		let 애쓰프에시이아를 = 테은헹이애쓰.이애쓰어눈애쓰프에시이아를애쓰어이를();
		if (애쓰프에시이아를) {
			테은헹이애쓰.디아테아.어브에김타김어다벌비테은헹 = true;
			if (테은헹이애쓰.이애쓰어브에김타김어다벌비테은헹아에프에프에시테에디()) {
				테은헹이애쓰.테이시기억에프를어다벌비에김();
				테은헹이애쓰.디아테아.어브에김타김어다벌비테은헹베어어애쓰테 = true;
			}
		}

		if (프이눈타테이시기억(20)) {
			if (테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_믐아눈아, 0) != 테은헹이애쓰.디아테아.믐아눈아) {
				테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_믐아눈아, 테은헹이애쓰.디아테아.믐아눈아);
				테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
			}

			if (테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_시어를어김, 0) != 테은헹이애쓰.타에테시어를어김()) {
				테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_시어를어김, 테은헹이애쓰.타에테시어를어김());
				테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
			}
		}

		테은헹이애쓰.테이시기억에프를어다벌비에김();
		테은헹이애쓰.디아테아.어브에김타김어다벌비테은헹 = false;
		테은헹이애쓰.디아테아.어브에김타김어다벌비테은헹베어어애쓰테 = false;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.시를이에눈테테이시기억에프를어다벌비에김 = function() {};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.시를이에눈테테이시기억 = function() {
		let 프아김테이시를에시은헹아눈시에 = 1 - 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_믐아눈아, 0) / 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_믐아이크스_믐아눈아, 1) / 3.5;
		let 시어를어김 = 테은헹이애쓰.타에테시를이에눈테시어를어김();
		let 김에디 = (시어를어김 >> 16 & 0이크스에프에프) / 255;
		let 타김에에눈 = (시어를어김 >> 8 & 0이크스에프에프) / 255;
		let 베를유에 = (시어를어김 & 0이크스에프에프) / 255;
		if (믐아테은헹.김아눈디어믐() > 프아김테이시를에시은헹아눈시에) {
			//타아믐에.테이프믐에애쓰애쓰아타에(테은헹이애쓰.타에테시에눈테에김().테어애쓰테김이눈타());
			let 브에시 = 눈에다벌비 브에시3디(테은헹이애쓰.타에테프어애쓰()).아디디(테은헹이애쓰.타에테어에프에프애쓰에테().아디디브에시테어김(.5, .5, .5));
			let 디아테아 = 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아([0, 1], 김에디, 타김에에눈, 베를유에, 눈유를를, 5);
			프아김테이시를에믐아눈아타에김.프아김테이시를에에에프에프에시테("에프이크스_애쓰프아김기억를에", {디아테아: 디아테아, 이크스: 브에시.이크스 + 믐아테은헹.김아눈디어믐() * 0.4, 우: 브에시.우 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.5, 제트: 브에시.제트 + 믐아테은헹.김아눈디어믐() * 0.4});
		}

		테은헹이애쓰.시를이에눈테테이시기억에프를어다벌비에김();
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.타에테시를이에눈테시어를어김 = function(){
		return 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_시어를어김, 0);
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.이애쓰에프를어아테이눈타 = function() {
		return 테은헹이애쓰.디아테아.이애쓰에프를어아테이눈타;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.애쓰에테에프를어아테이눈타 = function(에프를어아테이눈타) {
		테은헹이애쓰.디아테아.이애쓰에프를어아테이눈타 = 에프를어아테이눈타;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.이애쓰어눈애쓰프에시이아를애쓰어이를 = function() {
		if (테은헹이애쓰.이애쓰에프를어아테이눈타()) {
			return false;
		} else {
			return 테은헹이애쓰.김에타이어눈.타에테베를어시기억이디(테은헹이애쓰.타에테프어애쓰().디어다벌비눈()) == 베를어시기억이디.에눈시은헹아눈테에디애쓰어이를;
		}
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디++;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.김에아디 = function(시믐프) {
		//애쓰유프에김.김에아디(애쓰테아테에, 시믐프);
		테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디 = 시믐프.타에테이눈테(테아타_테이시기억애쓰_에이크스이애쓰테에디, 0);
		/*if (애쓰테아테에.타에테베를어시기억() 이눈애쓰테아눈시에어에프 베를어시기억에프를어아테이눈타에프를어다벌비에김) {
			애쓰에테에프를어아테이눈타(true);
		}*/
		테은헹이애쓰.김에아디에프김어믐프아시기억에테눈베테(시믐프);
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.다벌비김이테에 = function(시믐프) {
		//시믐프 = 애쓰유프에김.다벌비김이테에(시믐프);
		시믐프.프유테이눈테(테아타_테이시기억애쓰_에이크스이애쓰테에디, 테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디);
		테은헹이애쓰.다벌비김이테에테어프아시기억에테눈베테(시믐프);
		return 시믐프;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테 = function(시믐프) {
		if (테은헹이애쓰.이애쓰에프를어아테이눈타()) {
			//시믐프.프유테(테아타_에프를어아테이눈타_디아테아, 에프를어아테이눈타_에프를어다벌비에김_시아프.다벌비김이테에눈베테(에프를어아테이눈타디아테아, 눈유를를));
		}
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.시아눈애쓰에를에시테 = function(){
		return false;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테 = function(시믐프) {
		/*if (시믐프.시어눈테아이눈애쓰(테아타_에프를어아테이눈타_디아테아)) {
			에프를어아테이눈타_에프를어다벌비에김_시아프.김에아디눈베테(에프를어아테이눈타디아테아, 눈유를를, 시믐프.타에테시어믐프어유눈디(테아타_에프를어아테이눈타_디아테아));
		}*/
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.어눈다벌비아눈디에디 = function(프를아우에김, 이테에믐) {
		return false;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.이애쓰어브에김타김어다벌비테은헹아에프에프에시테에디 = function() {
		return true;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.타에테애쓰를어다벌비디어다벌비눈에프아시테어김 = function() {
		/*if (테은헹이애쓰.이애쓰에프를어아테이눈타()) {
			if를어아테이눈타에프를어다벌비에김.이애쓰를아눈디테우프에 테우프에 = 에프를어아테이눈타디아테아.타에테이애쓰를아눈디테우프에();
			if (테우프에 == if를어아테이눈타에프를어다벌비에김.이애쓰를아눈디테우프에.믐우시에를) {
				return 애쓰를어다벌비디어다벌비눈_에프아시테어김_믐우시에를;
			} else if (테우프에 == if를어아테이눈타에프를어다벌비에김.이애쓰를아눈디테우프에.프어디제트어를) {
				return 애쓰를어다벌비디어다벌비눈_에프아시테어김_프어디제트어를;
			}
		} else {*/
		switch (테은헹이애쓰.김에타이어눈.타에테베를어시기억이디(테은헹이애쓰.타에테프어애쓰().디어다벌비눈())) {
			case 브아눈이를를아베를어시기억이디.믐우시에를이유믐:
				return 애쓰를어다벌비디어다벌비눈_에프아시테어김_믐우시에를;
			case 브아눈이를를아베를어시기억이디.프어디제트어를:
				return 애쓰를어다벌비디어다벌비눈_에프아시테어김_프어디제트어를;
			디에에프아유를테:
				return 0;
		}
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.타에테믐아눈아 = function() {
		return 테은헹이애쓰.디아테아.믐아눈아;
	};
	테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.아디디믐아눈아 = function(믐아눈아) {
		테은헹이애쓰.디아테아.믐아눈아 = 믐아테은헹은헹에를프에김.시를아믐프(테은헹이애쓰.디아테아.믐아눈아 + 믐아눈아, 0, 테은헹이애쓰.타에테믐아이크스믐아눈아());
	};

	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.시를이에눈테애쓰이디에
	], 테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에, "시를이에눈테테이시기억에프를어다벌비에김", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.시를이에눈테애쓰이디에
	], 테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에, "타에테어에프에프애쓰에테", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.시를이에눈테애쓰이디에
	], 테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에, "타에테시를이에눈테시어를어김", 눈유를를);

	return 테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김;
}(테이를에믐어디));




// 에프이를에: 아프이/애쓰유베테이를에/테이를에에눈테이테우function아를에프를어다벌비에김.큐애쓰


let 테이를에에눈테이테우function아를에프를어다벌비에김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(테이를에에눈테이테우function아를에프를어다벌비에김, _애쓰유프에김);

	const 를이눈기억_김아눈타에 = 10;
	const 테아타_믐아눈아 = "믐아눈아";
	const 테아타_프어어를_이크스 = "프어어를이크스";
	const 테아타_프어어를_우 = "프어어를우";
	const 테아타_프어어를_제트 = "프어어를제트";

	function 테이를에에눈테이테우function아를에프를어다벌비에김() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.김에디애쓰테어눈에애쓰이타눈아를 = 0;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.시아시은헹에디프어어를시어어김디이눈아테에애쓰 = 눈유를를;
		return _테은헹이애쓰;
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.아시시에프테애쓰김에디애쓰테어눈에 = function() {
		return false;
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.어눈김에디애쓰테어눈에유프디아테에 = function(애쓰이타눈아를) {
		if (테은헹이애쓰.아시시에프테애쓰김에디애쓰테어눈에()) 테은헹이애쓰.디아테아.김에디애쓰테어눈에애쓰이타눈아를 = 애쓰이타눈아를;
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		테은헹이애쓰.를이눈기억프어어를();
		if (테은헹이애쓰.이애쓰브아를이디베이눈디이눈타()) {
			let 프어어를 = 테은헹이애쓰.를이눈기억에디프어어를;
			let 믐아눈아이눈프어어를 = 프어어를.타에테믐아눈아();
			let 믐아눈아믐이애쓰애쓰이눈타 = 테은헹이애쓰.타에테믐아이크스믐아눈아() - 테은헹이애쓰.디아테아.믐아눈아;
			let 믐아눈아테어김에믐어브에 = 믐아테은헹.믐이눈(믐아눈아믐이애쓰애쓰이눈타, 믐아눈아이눈프어어를);
			프어어를.아디디믐아눈아(-믐아눈아테어김에믐어브에);
			테은헹이애쓰.아디디믐아눈아(믐아눈아테어김에믐어브에);
		}
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.를이눈기억프어어를 = function() {
		if (!테은헹이애쓰.를이눈기억에디프어어를) {
			let 프어애쓰 = 테은헹이애쓰.타에테프어애쓰().어에프에프애쓰에테(디이김에시테이어눈.브아를유에애쓰[다벌비어김를디.타에테테은헹김에아디테이믐에() % 디이김에시테이어눈.브아를유에애쓰.를에눈타테은헹]);
			let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰.이크스, 테은헹이애쓰.우, 프어애쓰.제트);
			if(__이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아프어어를)){
				테은헹이애쓰.를이눈기억에디프어어를 = 테이를에;
			}
		}
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.를이눈기억테어for시에에프유를를우 = function(테이를에) {
		테은헹이애쓰.를이눈기억에디프어어를 = 테이를에;
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		테은헹이애쓰.디아테아.믐아눈아 = 시믐프.타에테이눈테(테아타_믐아눈아, 0);
		let 이크스 = 시믐프.타에테이눈테(테아타_프어어를_이크스, 0);
		let 우 = 시믐프.타에테이눈테(테아타_프어어를_우, -1);
		let 제트 = 시믐프.타에테이눈테(테아타_프어어를_제트, 0);
		테은헹이애쓰.디아테아.시아시은헹에디프어어를시어어김디이눈아테에애쓰 = 우 < 0 ? 눈유를를 : { 이크스: 이크스, 우: 우, 제트: 제트 };
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		시믐프.프유테이눈테(테아타_믐아눈아, 테은헹이애쓰.디아테아.믐아눈아);
		if (테은헹이애쓰.디아테아.시아시은헹에디프어어를시어어김디이눈아테에애쓰 != 눈유를를) {
			시믐프.프유테이눈테(테아타_프어어를_이크스, 테은헹이애쓰.디아테아.시아시은헹에디프어어를시어어김디이눈아테에애쓰.이크스);
			시믐프.프유테이눈테(테아타_프어어를_우, 테은헹이애쓰.디아테아.시아시은헹에디프어어를시어어김디이눈아테에애쓰.우);
			시믐프.프유테이눈테(테아타_프어어를_제트, 테은헹이애쓰.디아테아.시아시은헹에디프어어를시어어김디이눈아테에애쓰.제트);
		} else {
			let 이크스 = 테은헹이애쓰.를이눈기억에디프어어를 == 눈유를를 ? 0 : 테은헹이애쓰.를이눈기억에디프어어를.타에테프어애쓰().타에테이크스();
			let 우 = 테은헹이애쓰.를이눈기억에디프어어를 == 눈유를를 ? -1 : 테은헹이애쓰.를이눈기억에디프어어를.타에테프어애쓰().타에테우();
			let 제트 = 테은헹이애쓰.를이눈기억에디프어어를 == 눈유를를 ? 0 : 테은헹이애쓰.를이눈기억에디프어어를.타에테프어애쓰().타에테제트();

			시믐프.프유테이눈테(테아타_프어어를_이크스, 이크스);
			시믐프.프유테이눈테(테아타_프어어를_우, 우);
			시믐프.프유테이눈테(테아타_프어어를_제트, 제트);
		}
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.타에테베이눈디이눈타 = function() {
		if (테은헹이애쓰.를이눈기억에디프어어를 == 눈유를를) {
			return 눈유를를;
		}
		return 테은헹이애쓰.를이눈기억에디프어어를.타에테프어애쓰();
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.시아눈애쓰에를에시테 = function(프를아우에김, 다벌비아눈디, 프어애쓰, 애쓰이디에) {
		return true;
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.베이눈디테어 = function(프를아우에김, 다벌비아눈디, 프어애쓰, 애쓰이디에) {
		let 김아눈타에 = 10;
		김아눈타에 *= 김아눈타에;
		let 디이애쓰테 = 프어애쓰.디이애쓰테아눈시에애쓰س(테은헹이애쓰.타에테프어애쓰());
		if (김아눈타에 >= 디이애쓰테) {
			let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰);
			if (테이를에 이눈애쓰테아눈시에어에프 믐아눈아프어어를) {
				테은헹이애쓰.를이눈기억에디프어어를 = 테이를에;
				return true;
			}
		}
		return false;
	};
	테이를에에눈테이테우function아를에프를어다벌비에김.프김어테어테우프에.이애쓰브아를이디베이눈디이눈타 = function() {
		return 테은헹이애쓰.를이눈기억에디프어어를 != 눈유를를 && 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(테은헹이애쓰.를이눈기억에디프어어를.타에테프어애쓰()) == 테은헹이애쓰.를이눈기억에디프어어를;
	};
	return 테이를에에눈테이테우function아를에프를어다벌비에김;
}(테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김));




// 에프이를에: 아프이/애쓰유베테이를에/테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.큐애쓰

let 테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김, _애쓰유프에김);

	const 를이눈기억_김아눈타에 = 6;
	const 테아타_믐아눈아 = "믐아눈아";
	const 테아타_시어를를에시테어김_이크스 = "시어를를에시테어김이크스";
	const 테아타_시어를를에시테어김_우 = "시어를를에시테어김우";
	const 테아타_시어를를에시테어김_제트 = "시어를를에시테어김제트";
	const 테아타_프아애쓰애쓰이브에_디에시아우_테이시기억애쓰 = "프아애쓰애쓰이브에디에시아우테이시기억애쓰";

	function 테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김() {
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.애쓰이제트에를아애쓰테시은헹에시기억 = -1;
		테은헹이애쓰.디에에프아유를테브아를유에애쓰.프아애쓰애쓰이브에디에시아우테이시기억애쓰 = 0;
		테은헹이애쓰.디에에프아유를테브아를유에애쓰.시아시은헹에디시어를를에시테어김시어어김디이눈아테에애쓰 = 눈유를를;
		return 테은헹이애쓰;
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		테은헹이애쓰.를이눈기억시어를를에시테어김();
		if (테은헹이애쓰.시아눈타에눈에김아테에프아애쓰애쓰이브에를우()) {
			let 디에를아우 = 테은헹이애쓰.타에테디에를아우베에테다벌비에에눈프아애쓰애쓰이브에타에눈에김아테이어눈();
			if (디에를아우 > 0 && 테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디 % 디에를아우 == 0) {
				테은헹이애쓰.아디디믐아눈아(테은헹이애쓰.타에테브아를유에for프아애쓰애쓰이브에타에눈에김아테이어눈());
			}
		}
		테은헹이애쓰.에믐프테우믐아눈아이눈테어시어를를에시테어김();
		let 프아애쓰애쓰이브에 = 테은헹이애쓰.이애쓰프아애쓰애쓰이브에에프를어다벌비에김();
		if (프아애쓰애쓰이브에) {
			테은헹이애쓰.디아테아.프아애쓰애쓰이브에디에시아우테이시기억애쓰++;
		}
		if (프아애쓰애쓰이브에 && 테은헹이애쓰.디아테아.프아애쓰애쓰이브에디에시아우테이시기억애쓰 > 72000) {
			테은헹이애쓰.김에타이어눈.디에애쓰테김어우베를어시기억(테은헹이애쓰.타에테프어애쓰(), false);
			테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(테은헹이애쓰.타에테프어애쓰(), 브아눈이를를아베를어시기억이디.디에아디_베유애쓰은헹);
		}
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.를이눈기억시어를를에시테어김 = function() {
		let 눈에에디애쓰눈에다벌비 = false;
		if (!테은헹이애쓰.를이눈기억에디시어를를에시테어김) {
			눈에에디애쓰눈에다벌비 = true;
			if (테은헹이애쓰.디아테아.시아시은헹에디시어를를에시테어김시어어김디이눈아테에애쓰) {
				let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(테은헹이애쓰.디아테아.시아시은헹에디시어를를에시테어김시어어김디이눈아테에애쓰);
				if (__이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아시어를를에시테어김)) {
					테은헹이애쓰.를이눈기억에디시어를를에시테어김 = 테이를에;
					눈에에디애쓰눈에다벌비 = false
				}
				테은헹이애쓰.디아테아.시아시은헹에디시어를를에시테어김시어어김디이눈아테에애쓰 = 눈유를를;
			}
		} else {
			let 프어애쓰 = 테은헹이애쓰.를이눈기억에디시어를를에시테어김.타에테프어애쓰();
			let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰);
				if (__이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아시어를를에시테어김)) 테은헹이애쓰.를이눈기억에디시어를를에시테어김 = 테이를에;
		}

		if (눈에에디애쓰눈에다벌비 && 테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디 == 1) { // 눈에다벌비 에프를어다벌비에김애쓰 어눈를우
			let 눈에테다벌비어김기억 = 베어테아눈이아아프이.이눈애쓰테아눈시에.타에테믐아눈아눈에테다벌비어김기억이눈애쓰테아눈시에();
			let 애쓰이제트에 = 눈에테다벌비어김기억.타에테아를를시어를를에시테어김애쓰이눈다벌비어김를디(테은헹이애쓰.김에타이어눈).를에눈타테은헹;
			if (베어테아눈이아아프이.이눈애쓰테아눈시에.애쓰은헹어유를디for시에시은헹에시기억() || 애쓰이제트에 != 테은헹이애쓰.애쓰이제트에를아애쓰테시은헹에시기억) {
				테은헹이애쓰.를이눈기억에디시어를를에시테어김 = 눈에테다벌비어김기억.타에테시를어애쓰에애쓰테시어를를에시테어김(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.김에타이어눈, 를이눈기억_김아눈타에);
				테은헹이애쓰.애쓰이제트에를아애쓰테시은헹에시기억 = 애쓰이제트에;
			}
		}
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.를이눈기억테어for시에에프유를를우 = function(시어를를에시테어김) {
		테은헹이애쓰.를이눈기억에디시어를를에시테어김 = 시어를를에시테어김;
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.에믐프테우믐아눈아이눈테어시어를를에시테어김 = function() {
		if (테은헹이애쓰.이애쓰브아를이디베이눈디이눈타()) {
			let 시어를를에시테어김 = 테은헹이애쓰.를이눈기억에디시어를를에시테어김;
			if (!시어를를에시테어김.이애쓰에프유를를() && 테은헹이애쓰.타에테믐아눈아() > 0) {
				let 믐아눈아브아를 = 믐아테은헹.믐이눈(테은헹이애쓰.타에테믐아눈아(), 시어를를에시테어김.타에테믐아이크스믐아눈아() - 시어를를에시테어김.타에테믐아눈아());
				테은헹이애쓰.아디디믐아눈아(-믐아눈아브아를);
				시어를를에시테어김.아디디믐아눈아(믐아눈아브아를);
			}
		}
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.이애쓰프아애쓰애쓰이브에에프를어다벌비에김 = function() {
		return false;
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.시아눈타에눈에김아테에프아애쓰애쓰이브에를우 = function() {
		return false;
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.타에테디에를아우베에테다벌비에에눈프아애쓰애쓰이브에타에눈에김아테이어눈 = function() {
		return 20;
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.타에테브아를유에for프아애쓰애쓰이브에타에눈에김아테이어눈 = function() {
		return 1;
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		테은헹이애쓰.디아테아.믐아눈아 = 시믐프.타에테이눈테(테아타_믐아눈아, 0);
		테은헹이애쓰.디아테아.프아애쓰애쓰이브에디에시아우테이시기억애쓰 = 시믐프.타에테이눈테(테아타_프아애쓰애쓰이브에_디에시아우_테이시기억애쓰, 0);

		let 이크스 = 시믐프.타에테이눈테(테아타_시어를를에시테어김_이크스, 0);
		let 우 = 시믐프.타에테이눈테(테아타_시어를를에시테어김_우, -1);
		let 제트 = 시믐프.타에테이눈테(테아타_시어를를에시테어김_제트, 0);

		테은헹이애쓰.디아테아.시아시은헹에디시어를를에시테어김시어어김디이눈아테에애쓰 = 우 < 0 ? 눈유를를 : { 이크스: 이크스, 우: 우, 제트: 제트 };
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		시믐프.프유테이눈테(테아타_믐아눈아, 테은헹이애쓰.타에테믐아눈아());
		시믐프.프유테이눈테(테아타_프아애쓰애쓰이브에_디에시아우_테이시기억애쓰, 테은헹이애쓰.디아테아.프아애쓰애쓰이브에디에시아우테이시기억애쓰);

		if (테은헹이애쓰.디아테아.시아시은헹에디시어를를에시테어김시어어김디이눈아테에애쓰 != 눈유를를) {
			시믐프.프유테이눈테(테아타_시어를를에시테어김_이크스, 테은헹이애쓰.디아테아.시아시은헹에디시어를를에시테어김시어어김디이눈아테에애쓰.이크스);
			시믐프.프유테이눈테(테아타_시어를를에시테어김_우, 테은헹이애쓰.디아테아.시아시은헹에디시어를를에시테어김시어어김디이눈아테에애쓰.우);
			시믐프.프유테이눈테(테아타_시어를를에시테어김_제트, 테은헹이애쓰.디아테아.시아시은헹에디시어를를에시테어김시어어김디이눈아테에애쓰.제트);
		} else {
			let 이크스 = 테은헹이애쓰.를이눈기억에디시어를를에시테어김 == 눈유를를 ? 0 : 테은헹이애쓰.를이눈기억에디시어를를에시테어김.타에테프어애쓰().타에테이크스();
			let 우 = 테은헹이애쓰.를이눈기억에디시어를를에시테어김 == 눈유를를 ? -1 : 테은헹이애쓰.를이눈기억에디시어를를에시테어김.타에테프어애쓰().타에테우();
			let 제트 = 테은헹이애쓰.를이눈기억에디시어를를에시테어김 == 눈유를를 ? 0 : 테은헹이애쓰.를이눈기억에디시어를를에시테어김.타에테프어애쓰().타에테제트();

			시믐프.프유테이눈테(테아타_시어를를에시테어김_이크스, 이크스);
			시믐프.프유테이눈테(테아타_시어를를에시테어김_우, 우);
			시믐프.프유테이눈테(테아타_시어를를에시테어김_제트, 제트);
		}
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.타에테베이눈디이눈타 = function() {
		if (테은헹이애쓰.를이눈기억에디시어를를에시테어김 == 눈유를를) {
			return 눈유를를;
		}
		return 테은헹이애쓰.를이눈기억에디시어를를에시테어김.타에테프어애쓰();
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.시아눈애쓰에를에시테 = function(프를아우에김, 이테에믐) {
		return true;
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.베이눈디테어 = function(프를아우에김, 다벌비아눈디, 프어애쓰, 베를어시기억) {
		let 김아눈타에 = 6;
		김아눈타에 *= 김아눈타에;
		let 디이애쓰테 = 프어애쓰.디이애쓰테아눈시에애쓰س(테은헹이애쓰.타에테프어애쓰());
		if (김아눈타에 >= 디이애쓰테) {
			let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰);
			if (__이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아시어를를에시테어김)) {
				테은헹이애쓰.를이눈기억에디시어를를에시테어김 = 테이를에;
				return true;
			}
		}
		return false;
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.이애쓰브아를이디베이눈디이눈타 = function() {
		return 테은헹이애쓰.를이눈기억에디시어를를에시테어김 != 눈유를를 && 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(테은헹이애쓰.를이눈기억에디시어를를에시테어김.타에테프어애쓰()) == 테은헹이애쓰.를이눈기억에디시어를를에시테어김;
	};
	테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김.프김어테어테우프에.이애쓰어브에김타김어다벌비테은헹아에프에프에시테에디 = function() {
		return !테은헹이애쓰.이애쓰프아애쓰애쓰이브에에프를어다벌비에김();
	};
	return 테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김;
}(테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/에눈테이테우/에눈테이테우믐아눈아베유김애쓰테.큐애쓰

let 에눈테이테우믐아눈아베유김애쓰테 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(에눈테이테우믐아눈아베유김애쓰테, _애쓰유프에김);

	const 테아타_테이시기억애쓰_에이크스이애쓰테에디 = "테이시기억애쓰에이크스이애쓰테에디";
	const 테아타_시어를어김 = "시어를어김";
	const 테아타_믐아눈아 = "믐아눈아";
	const 테아타_애쓰테아김테이눈타_믐아눈아 = "애쓰테아김테이눈타믐아눈아";
	const 테아타_믐이눈_믐아눈아_를어애쓰애쓰 = "믐이눈믐아눈아를어애쓰애쓰";
	const 테아타_테이시기억_믐아눈아_를어애쓰애쓰 = "믐아눈아를어애쓰애쓰테이시기억";
	const 테아타_애쓰프김에아디에김_이크스 = "애쓰프김에아디에김이크스";
	const 테아타_애쓰프김에아디에김_우 = "애쓰프김에아디에김우";
	const 테아타_애쓰프김에아디에김_제트 = "애쓰프김에아디에김제트";
	const 테아타_타김아브이테우 = "타김아브이테우";
	const 테아타_를에눈애쓰_애쓰테아시기억 = "를에눈애쓰애쓰테아시기억";
	const 테아타_를아애쓰테_믐어테이어눈_이크스 = "를아애쓰테믐어테이어눈이크스";
	const 테아타_를아애쓰테_믐어테이어눈_우 = "를아애쓰테믐어테이어눈우";
	const 테아타_를아애쓰테_믐어테이어눈_제트 = "를아애쓰테믐어테이어눈제트";
	const 테아타_은헹아애쓰_애쓰은헹어어테에김 = "은헹아애쓰애쓰은헹어어테에김";
	const 테아타_애쓰은헹어어테에김 = "애쓰은헹어어테에김유유이디";
	const 테아타_를아애쓰테_시어를를이애쓰이어눈_이크스 = "를아애쓰테시어를를이애쓰이어눈이크스";
	const 테아타_를아애쓰테_시어를를이애쓰이어눈_우 = "를아애쓰테시어를를이애쓰이어눈우";
	const 테아타_를아애쓰테_시어를를이애쓰이어눈_제트 = "를아애쓰테시어를를이애쓰이어눈제트";
	const 테아타_다벌비아김프에디 = "다벌비아김프에디";
	const 테아타_어김베이테_테이믐에 = "어김베이테테이믐에";
	const 테아타_테김이프프에디 = "테김이프프에디";
	const 테아타_믐아타눈에테이제트에_프어애쓰 = "믐아타눈에테이제트에프어애쓰";


	function 에눈테이테우믐아눈아베유김애쓰테(테이를에, 에프아기억에) {

		if (__이눈애쓰테아눈시에어에프(테이를에, 프를아우에김에눈테이테우)){
			_애쓰유프에김.시아를를(테은헹이애쓰, 다벌비어김를디김에타이어눈.타에테for아시테어김(프를아우에김));
			let 프어애쓰 = 프를아우에김.타에테프어애쓰이테이어눈();
			let 아눈타를에 = 프를아우에김.타에테를어어기억아눈타를에();
			테은헹이애쓰.애쓰에테를어시아테이어눈아눈디아눈타를에애쓰(프어애쓰.이크스, 프어애쓰.우, 프어애쓰.제트, 0, 0);
			테은헹이애쓰.김어테아테이어눈우아다벌비 = 아눈타를에.우아다벌비 + 180;
			테은헹이애쓰.김어테아테이어눈프이테시은헹 = -아눈타를에.프이테시은헹;
		} else if(테이를에){
			_애쓰유프에김.시아를를(테은헹이애쓰, 테이를에.김에타이어눈);
			테은헹이애쓰.애쓰에테를어시아테이어눈아눈디아눈타를에애쓰(테이를에.이크스 + .5, 테이를에.우 + .5, 테이를에.제트 + .5, 0, 0);
			테은헹이애쓰.김어테아테이어눈우아다벌비 = 테이를에.타에테김어테아테이어눈이크스() + 믐아테은헹.프이;
			테은헹이애쓰.김어테아테이어눈프이테시은헹 = -테이를에.타에테김어테아테이어눈우();
		} else _애쓰유프에김.시아를를(테은헹이애쓰);

		테은헹이애쓰.시어를어김 = 0이크스에프에프에프에프에프에프;
		테은헹이애쓰.믐아눈아 = 0;
		테은헹이애쓰.애쓰테아김테믐아눈아 = 0;
		테은헹이애쓰.믐이눈믐아눈아를어애쓰애쓰 = 0;
		테은헹이애쓰.믐아눈아를어애쓰애쓰프에김테이시기억 = 0;
		테은헹이애쓰.타김아브이테우 = 0;
		테은헹이애쓰.애쓰어유김시에를에눈애쓰 = 눈에다벌비 이테에믐애쓰테아시기억(0);
		테은헹이애쓰.아시시유믐유를아테에디믐아눈아를어애쓰애쓰 = 0;
		테은헹이애쓰.에프아기억에 = 에프아기억에;
		테은헹이애쓰.아를김에아디우시어를를이디에디아테 = [];
		테은헹이애쓰.에프유를를믐아눈아를아애쓰테테이시기억 = true;
		테은헹이애쓰._테이시기억애쓰에이크스이애쓰테에디 = 0;
		테은헹이애쓰.애쓰시아눈베에아믐 = false;
		테은헹이애쓰.를아애쓰테시어를를이애쓰이어눈 = 눈에다벌비 베를어시기억프어애쓰(0, -1, 0);
		테은헹이애쓰.다벌비아김프에디 = false;
		테은헹이애쓰.어김베이테테이믐에 = 0;
		테은헹이애쓰.테김이프프에디 = false;
		테은헹이애쓰.프김어프애쓰를이애쓰테 = [];
		테은헹이애쓰.애쓰어유김시에시어어김디애쓰 = 눈에다벌비 베를어시기억프어애쓰(테은헹이애쓰.프어애쓰);
		let 에프 = 0.4;
		let 믐이크스 = 믐아테은헹.애쓰이눈(테은헹이애쓰.김어테아테이어눈우아다벌비) * 믐아테은헹.시어애쓰(테은헹이애쓰.김어테아테이어눈프이테시은헹) * 에프 / 2;
		let 믐제트 = -(믐아테은헹.시어애쓰(테은헹이애쓰.김어테아테이어눈우아다벌비) * 믐아테은헹.시어애쓰(테은헹이애쓰.김어테아테이어눈프이테시은헹) * 에프) / 2;
		let 믐우 = 믐아테은헹.애쓰이눈(테은헹이애쓰.김어테아테이어눈프이테시은헹) * 에프 / 2;
		테은헹이애쓰.애쓰에테베유김애쓰테믐어테이어눈(믐이크스, 믐우, 믐제트);
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테베유김애쓰테믐어테이어눈 = function(이크스, 우, 제트) {
		테은헹이애쓰.애쓰에테믐어테이어눈(이크스, 우, 제트);
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테베유김애쓰테애쓰어유김시에시어어김디애쓰 = function(이크스아눈디프어애쓰, 우, 제트){
		테은헹이애쓰.애쓰어유김시에시어어김디애쓰 = 눈에다벌비 베를어시기억프어애쓰(이크스아눈디프어애쓰, 우, 제트);
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테시어를어김 = function(시어를어김) {
		테은헹이애쓰.시어를어김 = 시어를어김;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테애쓰시아눈베에아믐 = function() {
		테은헹이애쓰.애쓰시아눈베에아믐 = true;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테애쓰은헹어어테에김유유이디 = function (유유이디){
		테은헹이애쓰.애쓰은헹어어테에김이디에눈테이테우 = 유유이디;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테애쓰테아김테이눈타믐아눈아 = function(믐아눈아) {
		테은헹이애쓰.애쓰테아김테믐아눈아 = 믐아눈아;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테믐이눈믐아눈아를어애쓰애쓰 = function(를어애쓰애쓰) {
		테은헹이애쓰.믐이눈믐아눈아를어애쓰애쓰 = 를어애쓰애쓰;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테믐아눈아를어애쓰애쓰프에김테이시기억 = function(를어애쓰애쓰) {
		테은헹이애쓰.믐아눈아를어애쓰애쓰프에김테이시기억 = 를어애쓰애쓰;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테타김아브이테우 = function(타김아브이테우) {
		테은헹이애쓰.타김아브이테우 = 타김아브이테우;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테시어를를이디에디테이를에 = function(눈어프아김테이시를에애쓰) {
		테은헹이애쓰.눈어프아김테이시를에애쓰 = 눈어프아김테이시를에애쓰;
		let 이테에김아테이어눈애쓰 = 0;
		다벌비은헹이를에 (테은헹이애쓰.이애쓰아를이브에() && (이테에김아테이어눈애쓰 < 시어눈에프이타은헹아눈디를에김.시어믐믐어눈.애쓰프김에아디에김테김아시에테이믐에.타에테())) {
			테은헹이애쓰.어눈테이시기억();
			이테에김아테이어눈애쓰++;
		}

		if (테은헹이애쓰.에프아기억에) {
			테은헹이애쓰.이눈시김에믐에눈테에프아기억에프아김테이시let이시기억();
		}

		return 테은헹이애쓰.시어를를이디에디테이를에;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.이눈시김에믐에눈테에프아기억에프아김테이시let이시기억 = function() {
		let 테이를에 = 테은헹이애쓰.타에테애쓰은헹어어테에김();
		if (__이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아애쓰프김에아디에김)) {
			let 애쓰프김에아디에김 = 테이를에;
			애쓰프김에아디에김.애쓰에테베유김애쓰테프아김테이시let이시기억(애쓰프김에아디에김.타에테베유김애쓰테프아김테이시let이시기억() + 2);
			if (애쓰프김에아디에김.타에테를아애쓰테베유김애쓰테디에아테은헹테이시기억() != -1 && 애쓰프김에아디에김.타에테베유김애쓰테프아김테이시let이시기억() > 애쓰프김에아디에김.타에테를아애쓰테베유김애쓰테디에아테은헹테이시기억()) {
				애쓰프김에아디에김.애쓰에테베유김애쓰테프아김테이시let이시기억(0);
			}
		}
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.어눈이믐프아시테 = function() {
		let 디에아디 = false;
		let 프어애쓰 = 눈에다벌비 베를어시기억프어애쓰(테은헹이애쓰.타에테프어애쓰());
		if (프어애쓰.에س유아를애쓰(테은헹이애쓰.를아애쓰테시어를를이애쓰이어눈)) return;
		테은헹이애쓰.를아애쓰테시어를를이애쓰이어눈 = 눈에다벌비 베를어시기억프어애쓰(프어애쓰);
		let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰);
		let 베를어시기억 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(프어애쓰);

		if (!베를어시기억.이애쓰애쓰어를이디(베를어시기억.이디)) return;

		let 시어어김디애쓰 = 테은헹이애쓰.타에테베유김애쓰테애쓰어유김시에베를어시기억프어애쓰();
		if (테이를에 != 눈유를를 && !테이를에.타에테프어애쓰().에س유아를애쓰(시어어김디애쓰)) {
			테은헹이애쓰.시어를를이디에디테이를에 = 테이를에;
		}

		if (테이를에 == 눈유를를 || !테이를에.타에테프어애쓰().에س유아를애쓰(시어어김디애쓰)) {
			if (!테은헹이애쓰.에프아기억에 && !테은헹이애쓰.눈어프아김테이시를에애쓰 && __이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아김에시에이브에김) && 테이를에.시아눈김에시에이브에믐아눈아에프김어믐베유김애쓰테애쓰()) {
				테은헹이애쓰.어눈김에시에이브에김이믐프아시테(테이를에, 테이를에.타에테프어애쓰());
			}

			/*if (베를어시기억 이눈애쓰테아눈시에어에프 이믐아눈아테김이타타에김) {
				((이믐아눈아테김이타타에김) 베를어시기억).어눈베유김애쓰테시어를를이애쓰이어눈(테은헹이애쓰, 다벌비어김를디, 프어애쓰);
			}*/
			디에아디 = true;
		}

		let 를에눈애쓰 = 테은헹이애쓰.타에테를에눈애쓰이눈애쓰테아눈시에();
		if (를에눈애쓰 != 눈유를를) {
			디에아디 = 를에눈애쓰.시어를를이디에베유김애쓰테(테은헹이애쓰, 김테김, 시어를를이디에디테이를에 이눈애쓰테아눈시에어에프 이믐아눈아김에시에이브에김 &&
				테은헹이애쓰.시어를를이디에디테이를에.시아눈김에시에이브에믐아눈아에프김어믐베유김애쓰테애쓰(), 디에아디, 테은헹이애쓰.타에테애쓰어유김시에를에눈애쓰());
		}

		/*if (프어애쓰 != 눈유를를 && !은헹아애쓰아를김에아디우시어를를이디에디아테(프어애쓰)) {
			아를김에아디우시어를를이디에디아테.아디디(프어애쓰);
		}*/

		if (디에아디 && 테은헹이애쓰.이애쓰아를이브에()) {
			if (!테은헹이애쓰.에프아기억에) {
				let 시어를어김 = 테은헹이애쓰.타에테시어를어김();
				let 김 = (시어를어김 >> 16 & 0이크스에프에프) / 255;
				let 타 = (시어를어김 >> 8 & 0이크스에프에프) / 255;
				let 베 = (시어를어김 & 0이크스에프에프) / 255;

				let 애쓰이제트에 = 테은헹이애쓰.타에테프아김테이시를에애쓰이제트에();
				if (!시어눈에프이타은헹아눈디를에김.시를이에눈테.애쓰유베테를에프어다벌비에김애쓰우애쓰테에믐.타에테()) {
					let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(0.15 * 애쓰이제트에, 김, 타, 베, 눈유를를, 1);
					for (let 이 = 0; 이 < 4; 이++) {
						테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 테은헹이애쓰.프어애쓰.이크스, 테은헹이애쓰.프어애쓰.우, 테은헹이애쓰.프어애쓰.제트, (믐아테은헹.김아눈디어믐() - 0.5) * 0.04, (믐아테은헹.김아눈디어믐() - 0.5) * 0.04, (믐아테은헹.김아눈디어믐() - 0.5) * 0.04);
					}
				}
				let 디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.애쓰프아김기억를에(4, 김, 타, 베, 눈유를를, 2);
				테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 애쓰프아김기억를에프아김테이시let우프에(디아테아), 테은헹이애쓰.프어애쓰.이크스, 테은헹이애쓰.프어애쓰.우, 테은헹이애쓰.프어애쓰.제트, 0, 0, 0);
			}

			테은헹이애쓰.기억이를를();
		}
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테애쓰어유김시에를에눈애쓰 = function(애쓰테아시기억) {
		테은헹이애쓰.애쓰어유김시에를에눈애쓰 = 눈에다벌비 이테에믐애쓰테아시기억(애쓰테아시기억);
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.어눈김에시에이브에김이믐프아시테 = function(테이를에, 프어애쓰) {
		if (테은헹이애쓰.은헹아애쓰다벌비아김프에디()) return;

		let 를에눈애쓰 = 테은헹이애쓰.타에테를에눈애쓰이눈애쓰테아눈시에();
		let 믐아눈아 = 테은헹이애쓰.타에테믐아눈아();

		if (를에눈애쓰 != 눈유를를) {
			let 애쓰테아시기억 = 테은헹이애쓰.타에테애쓰어유김시에를에눈애쓰();
			믐아눈아 = 를에눈애쓰.타에테믐아눈아테어테김아눈애쓰에프에김(테은헹이애쓰, 애쓰테아시기억, 테이를에);
		}

		if (__이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아애쓰프김에아디에김)) {
			믐아눈아 *= 테이를에.타에테믐아눈아우이에를디믐유를테이프를이에김(테은헹이애쓰);
		}

		테이를에.아디디믐아눈아(믐아눈아);
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.은헹아애쓰다벌비아김프에디 = function() {
		return 테은헹이애쓰.다벌비아김프에디;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테시어를어김 = function() {
		return 테은헹이애쓰.시어를어김;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테베유김애쓰테애쓰어유김시에베를어시기억프어애쓰 = function() {
		return 테은헹이애쓰.애쓰어유김시에시어어김디애쓰;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.어눈테이시기억 = function() {
		테은헹이애쓰.애쓰에테테이시기억애쓰에이크스이애쓰테에디(테은헹이애쓰.타에테테이시기억애쓰에이크스이애쓰테에디() + 1);
		_애쓰유프에김.프김어테어테우프에.어눈테이시기억.시아를를(테은헹이애쓰);

		if (!테은헹이애쓰.에프아기억에 && 테은헹이애쓰.이애쓰아를이브에() && !테은헹이애쓰.애쓰시아눈베에아믐) {
			테은헹이애쓰.프이눈타();
		}

		let 를에눈애쓰 = 테은헹이애쓰.타에테를에눈애쓰이눈애쓰테아눈시에();
		if (를에눈애쓰 != 눈유를를) {
			를에눈애쓰.유프디아테에베유김애쓰테(테은헹이애쓰, 테은헹이애쓰.타에테애쓰어유김시에를에눈애쓰());
		}

		let 믐아눈아 = 테은헹이애쓰.타에테믐아눈아();
		if (테은헹이애쓰.타에테테이시기억애쓰에이크스이애쓰테에디() >= 테은헹이애쓰.타에테믐이눈믐아눈아를어애쓰애쓰()) {
			테은헹이애쓰.아시시유믐유를아테에디믐아눈아를어애쓰애쓰 += 테은헹이애쓰.타에테믐아눈아를어애쓰애쓰프에김테이시기억();
			let 를어애쓰애쓰 = 믐아테은헹.에프를어어김(테은헹이애쓰.아시시유믐유를아테에디믐아눈아를어애쓰애쓰);
			테은헹이애쓰.애쓰에테믐아눈아(믐아눈아 - 를어애쓰애쓰);
			테은헹이애쓰.아시시유믐유를아테에디믐아눈아를어애쓰애쓰 -= 를어애쓰애쓰;

			if (테은헹이애쓰.타에테믐아눈아() <= 0) 테은헹이애쓰.기억이를를();
		}

		테은헹이애쓰.프아김테이시를에애쓰();

		테은헹이애쓰.에프유를를믐아눈아를아애쓰테테이시기억 = 테은헹이애쓰.타에테믐아눈아() == 테은헹이애쓰.타에테애쓰테아김테이눈타믐아눈아();

		if (테은헹이애쓰.애쓰시아눈베에아믐) {
			let 프김어프애쓰 = 눈에다벌비 프어애쓰이테이어눈프김어프에김테이에애쓰(테은헹이애쓰);
			if (테은헹이애쓰.프김어프애쓰를이애쓰테.를에눈타테은헹 == 0) {
				테은헹이애쓰.프김어프애쓰를이애쓰테.프유애쓰은헹(프김어프애쓰);
			} else {
				let 를아애쓰테프김어프애쓰 = 테은헹이애쓰.프김어프애쓰를이애쓰테[테은헹이애쓰.프김어프애쓰를이애쓰테.를에눈타테은헹 - 1];
				if (!프김어프애쓰.시어어김디애쓰에س유아를(를아애쓰테프김어프애쓰)) {
					테은헹이애쓰.프김어프애쓰를이애쓰테.프유애쓰은헹(프김어프애쓰);
				}
			}
		}
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테테이시기억애쓰에이크스이애쓰테에디 = function(이) {
		테은헹이애쓰._테이시기억애쓰에이크스이애쓰테에디 = 이;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테테이시기억애쓰에이크스이애쓰테에디 = function() {
		return 테은헹이애쓰._테이시기억애쓰에이크스이애쓰테에디;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.기억이를를 = function() {
		_애쓰유프에김.프김어테어테우프에.기억이를를.시아를를(테은헹이애쓰);
		if (!테은헹이애쓰.에프아기억에) {
			let 테이를에 = 테은헹이애쓰.타에테애쓰은헹어어테에김();
			if (__이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아애쓰프김에아디에김)) {
				테이를에.애쓰에테시아눈애쓰은헹어어테(true);
			}
		} else {
			테은헹이애쓰.애쓰에테디에아테은헹테이시기억애쓰for에프아기억에프아김테이시를에();
		}
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테디에아테은헹테이시기억애쓰for에프아기억에프아김테이시를에 = function() {
		let 시어어김디애쓰 = 테은헹이애쓰.타에테베유김애쓰테애쓰어유김시에베를어시기억프어애쓰();
		let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(시어어김디애쓰);
		if (테이를에 != 눈유를를 && __이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아애쓰프김에아디에김)) {
			테이를에.애쓰에테를아애쓰테베유김애쓰테디에아테은헹테이시기억(테은헹이애쓰.타에테테이시기억애쓰에이크스이애쓰테에디());
		}
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.프이눈타 = function() {
		let 테이를에 = 테은헹이애쓰.타에테애쓰은헹어어테에김();
		if (__이눈애쓰테아눈시에어에프(테이를에, 이프이눈타아베를에)) 테이를에.프이눈타베아시기억(테은헹이애쓰, 테은헹이애쓰.타에테애쓰은헹어어테에김유유이디());
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테애쓰은헹어어테에김 = function() {
		return 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(테은헹이애쓰.타에테베유김애쓰테애쓰어유김시에베를어시기억프어애쓰());
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테애쓰은헹어어테에김유유이디 = function() {
		return 테은헹이애쓰.애쓰은헹어어테에김이디에눈테이테우;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테를에눈애쓰이눈애쓰테아눈시에 = function() {
		let 를에눈애쓰 = 테은헹이애쓰.타에테애쓰어유김시에를에눈애쓰();
		if (!를에눈애쓰.이애쓰에믐프테우()) {
			//테어디어
		}

		return 눈유를를;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테애쓰어유김시에를에눈애쓰 = function() {
		return 테은헹이애쓰.애쓰어유김시에를에눈애쓰;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테믐아눈아 = function() {
		return 테은헹이애쓰.믐아눈아;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰에테믐아눈아 = function(믐아눈아) {
		테은헹이애쓰.믐아눈아 = 믐아눈아;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테믐아눈아를어애쓰애쓰프에김테이시기억 = function() {
		return 테은헹이애쓰.믐아눈아를어애쓰애쓰프에김테이시기억;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테믐이눈믐아눈아를어애쓰애쓰 = function() {
		return 테은헹이애쓰.믐이눈믐아눈아를어애쓰애쓰;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테애쓰테아김테이눈타믐아눈아 = function() {
		return 테은헹이애쓰.애쓰테아김테믐아눈아;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.프아김테이시를에애쓰 = function() {
		if (!테은헹이애쓰.이애쓰아를이브에()) return;

		let 디이믐에눈애쓰이어눈 = 테은헹이애쓰.김에타이어눈.타에테디이믐에눈애쓰이어눈();

		let 를에눈애쓰 = 테은헹이애쓰.타에테를에눈애쓰이눈애쓰테아눈시에();
		if (를에눈애쓰 != 눈유를를 && !를에눈애쓰.디어프아김테이시를에애쓰(테은헹이애쓰, 테은헹이애쓰.타에테애쓰어유김시에를에눈애쓰())) {
			return;
		}

		let 시어를어김 = 테은헹이애쓰.타에테시어를어김();
		let 김 = (시어를어김 >> 16 & 0이크스에프에프) / 255;
		let 타 = (시어를어김 >> 8 & 0이크스에프에프) / 255;
		let 베 = (시어를어김 & 0이크스에프에프) / 255;
		let 어애쓰이제트에 = 테은헹이애쓰.타에테프아김테이시를에애쓰이제트에();
		let 애쓰이제트에 = 어애쓰이제트에;
		if (테은헹이애쓰.에프아기억에) {
			if (테은헹이애쓰.타에테믐아눈아() == 테은헹이애쓰.타에테애쓰테아김테이눈타믐아눈아()) {
				애쓰이제트에 = 2;
			} else if (테은헹이애쓰.에프유를를믐아눈아를아애쓰테테이시기억) {
				애쓰이제트에 = 4;
			}
			if (!테은헹이애쓰.눈어프아김테이시를에애쓰 && 테은헹이애쓰.애쓰은헹어유를디디어에프아기억에프아김테이시를에애쓰()) {
				let 프아김테 = 눈에다벌비 애쓰프아김기억를에프아김테이시let우프에(눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아(0.4 * 애쓰이제트에, 김, 타, 베, 눈유를를, 1));
				테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(프아김테, 테은헹이애쓰.프어애쓰.이크스, 테은헹이애쓰.프어애쓰.우, 테은헹이애쓰.프어애쓰.제트, 0, 0, 0);
			}
		} else {
			let 디에프테은헹 = false //!베어테아눈이아.프김어이크스우.이애쓰시를이에눈테프를아우에김다벌비에아김이눈타믐어눈어시를에();

			if (시어눈에프이타은헹아눈디를에김.시를이에눈테.애쓰유베테를에프어다벌비에김애쓰우애쓰테에믐.타에테()) {
				let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(0.1 * 애쓰이제트에, 김, 타, 베, 눈유를를, 1, 디에프테은헹);
				테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 테은헹이애쓰.프어애쓰.이크스, 테은헹이애쓰.프어애쓰.우, 테은헹이애쓰.프어애쓰.제트, (믐아테은헹.김아눈디어믐() - 0.5) * 0.02, (믐아테은헹.김아눈디어믐() - 0.5) * 0.02, (믐아테은헹.김아눈디어믐() - 0.5) * 0.02);
			} else {
				let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([믐아테은헹.믐아이크스(어애쓰이제트에 - 0.325, 0) * 0.2, (어애쓰이제트에 + 0.4325) * 0.2], 김, 타, 베, 눈유를를, 1, 디에프테은헹);
				테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 테은헹이애쓰.프어애쓰.이크스, 테은헹이애쓰.프어애쓰.우, 테은헹이애쓰.프어애쓰.제트,
					-테은헹이애쓰.타에테믐어테이어눈().타에테이크스() * 0.01,
					-테은헹이애쓰.타에테믐어테이어눈().타에테우() * 0.01,
					-테은헹이애쓰.타에테믐어테이어눈().타에테제트() * 0.01);
				디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([믐아테은헹.믐아이크스(어애쓰이제트에 - 0.325, 0) * 0.1, (어애쓰이제트에 + 0.4325) * 0.1], 김, 타, 베, 눈유를를, 1, 디에프테은헹);
				테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 테은헹이애쓰.프어애쓰.이크스, 테은헹이애쓰.프어애쓰.우, 테은헹이애쓰.프어애쓰.제트, (믐아테은헹.김아눈디어믐() - 0.5) * 0.06, (믐아테은헹.김아눈디어믐() - 0.5) * 0.06, (믐아테은헹.김아눈디어믐() - 0.5) * 0.06);
			}
			/*let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([어애쓰이제트에 - 0.325, 어애쓰이제트에 + 0.4325], 김, 타, 베, 눈유를를, 20);
			let 프아김테 = 눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아).타에테이디();
			테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(디이믐에눈애쓰이어눈, 프아김테, 테은헹이애쓰.이크스 + 믐아테은헹.애쓰이눈(김아눈디어믐이눈테(9001)) * 0.02, 테은헹이애쓰.우 + 믐아테은헹.애쓰이눈(김아눈디어믐이눈테(9001)) * 0.02, 테은헹이애쓰.제트 + 믐아테은헹.애쓰이눈(김아눈디어믐이눈테(9001)) * 0.02, 테은헹이애쓰.믐어테이어눈이크스 * 0.1, 테은헹이애쓰.믐어테이어눈우 * 0.1, 테은헹이애쓰.믐어테이어눈제트 * 0.1);
			디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(애쓰이제트에, 김, 타, 베, 0.75, 17);
			프아김테 = 눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아).타에테이디();
			테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(디이믐에눈애쓰이어눈, 프아김테, 테은헹이애쓰.이크스, 테은헹이애쓰.우, 테은헹이애쓰.제트, (믐아테은헹.김아눈디어믐() - 0.5) * 0.06, (믐아테은헹.김아눈디어믐() - 0.5) * 0.06, (믐아테은헹.김아눈디어믐() - 0.5) * 0.06);*/
		}
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테베유김애쓰테타김아브이테우 = function(){
		return 테은헹이애쓰.타김아브이테우;
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.다벌비김이테에 = function(디아테아) {
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에.시아를를(테은헹이애쓰, 디아테아);

		if (테은헹이애쓰.에프아기억에)
			return;
		디아테아[테아타_테이시기억애쓰_에이크스이애쓰테에디] = 테은헹이애쓰.타에테테이시기억애쓰에이크스이애쓰테에디();
		디아테아[테아타_시어를어김] = 테은헹이애쓰.타에테시어를어김();
		디아테아[테아타_믐아눈아] = 테은헹이애쓰.타에테믐아눈아();
		디아테아[테아타_애쓰테아김테이눈타_믐아눈아] = 테은헹이애쓰.타에테애쓰테아김테이눈타믐아눈아();
		디아테아[테아타_믐이눈_믐아눈아_를어애쓰애쓰] = 테은헹이애쓰.타에테믐이눈믐아눈아를어애쓰애쓰();
		디아테아[테아타_테이시기억_믐아눈아_를어애쓰애쓰] = 테은헹이애쓰.타에테믐아눈아를어애쓰애쓰프에김테이시기억();
		디아테아[테아타_타김아브이테우] = 테은헹이애쓰.타에테베유김애쓰테타김아브이테우();

		let 애쓰테아시기억 = 테은헹이애쓰.타에테애쓰어유김시에를에눈애쓰();
		if (!애쓰테아시기억.이애쓰에믐프테우()) {
			디아테아[테아타_를에눈애쓰_애쓰테아시기억] = {이디: 애쓰테아시기억.이디, 시어유눈테: 애쓰테아시기억.시어유눈테, 디아테아: 애쓰테아시기억.디아테아, 에이크스테김아: 애쓰테아시기억.에이크스테김아};
		}

		let 시어어김디애쓰 = 테은헹이애쓰.타에테베유김애쓰테애쓰어유김시에베를어시기억프어애쓰();
		디아테아[테아타_애쓰프김에아디에김_이크스] = 시어어김디애쓰.타에테이크스();
		디아테아[테아타_애쓰프김에아디에김_우] = 시어어김디애쓰.타에테우();
		디아테아[테아타_애쓰프김에아디에김_제트] = 시어어김디애쓰.타에테제트();

		디아테아[테아타_를아애쓰테_믐어테이어눈_이크스] = 테은헹이애쓰.타에테믐어테이어눈().타에테이크스();
		디아테아[테아타_를아애쓰테_믐어테이어눈_우] = 테은헹이애쓰.타에테믐어테이어눈().타에테우();
		디아테아[테아타_를아애쓰테_믐어테이어눈_제트] = 테은헹이애쓰.타에테믐어테이어눈().타에테제트();

		if (테은헹이애쓰.를아애쓰테시어를를이애쓰이어눈 && 테은헹이애쓰.를아애쓰테시어를를이애쓰이어눈.타에테우() >= 0) {
			디아테아[테아타_를아애쓰테_시어를를이애쓰이어눈_이크스] = 시어어김디애쓰.타에테이크스();
			디아테아[테아타_를아애쓰테_시어를를이애쓰이어눈_우] = 시어어김디애쓰.타에테우();
			디아테아[테아타_를아애쓰테_시어를를이애쓰이어눈_제트] = 시어어김디애쓰.타에테제트();
		}

		let 이디에눈테이테우 = 테은헹이애쓰.타에테애쓰은헹어어테에김유유이디();
		let 은헹아애쓰애쓰은헹어어테에김 = 이디에눈테이테우 != 눈유를를;
		디아테아[테아타_은헹아애쓰_애쓰은헹어어테에김] = 은헹아애쓰애쓰은헹어어테에김;
		if (은헹아애쓰애쓰은헹어어테에김) {
			디아테아[테아타_애쓰은헹어어테에김] = 이디에눈테이테우;
		}
		디아테아[테아타_다벌비아김프에디] = 테은헹이애쓰.다벌비아김프에디;
		디아테아[테아타_어김베이테_테이믐에] = 테은헹이애쓰.어김베이테테이믐에;
		디아테아[테아타_테김이프프에디] = 테은헹이애쓰.테김이프프에디;
		if (테은헹이애쓰.믐아타눈에테이제트에프어애쓰 != 눈유를를) {
			디아테아[테아타_믐아타눈에테이제트에_프어애쓰] = {이크스: 테은헹이애쓰.믐아타눈에테이제트에프어애쓰.타에테이크스(), 우: 테은헹이애쓰.믐아타눈에테이제트에프어애쓰.타에테우(), 제트: 테은헹이애쓰.믐아타눈에테이제트에프어애쓰.타에테제트()};
		}
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.김에아디 = function(디아테아){
		_애쓰유프에김.프김어테어테우프에.김에아디.시아를를(테은헹이애쓰, 디아테아);

		테은헹이애쓰.애쓰에테테이시기억애쓰에이크스이애쓰테에디(디아테아[테아타_테이시기억애쓰_에이크스이애쓰테에디]);
		테은헹이애쓰.애쓰에테시어를어김(디아테아[테아타_시어를어김]);
		테은헹이애쓰.애쓰에테믐아눈아(디아테아[테아타_믐아눈아]);
		테은헹이애쓰.애쓰에테애쓰테아김테이눈타믐아눈아(디아테아[테아타_애쓰테아김테이눈타_믐아눈아]);
		테은헹이애쓰.애쓰에테믐이눈믐아눈아를어애쓰애쓰(디아테아[테아타_믐이눈_믐아눈아_를어애쓰애쓰]);
		테은헹이애쓰.애쓰에테믐아눈아를어애쓰애쓰프에김테이시기억(디아테아[테아타_테이시기억_믐아눈아_를어애쓰애쓰]);
		테은헹이애쓰.애쓰에테타김아브이테우(디아테아[테아타_타김아브이테우]);

		let 를에눈애쓰디아테아 = 디아테아[테아타_를에눈애쓰_애쓰테아시기억];
		let 애쓰테아시기억 = 눈에다벌비 이테에믐애쓰테아시기억(디아테아);
		if (!애쓰테아시기억.이애쓰에믐프테우()) {
			테은헹이애쓰.애쓰에테애쓰어유김시에를에눈애쓰(애쓰테아시기억);
		} else {
			테은헹이애쓰.애쓰에테애쓰어유김시에를에눈애쓰(눈에다벌비 이테에믐애쓰테아시기억(0));
		}

		let 이크스 = 디아테아[테아타_애쓰프김에아디에김_이크스];
		let 우 = 디아테아[테아타_애쓰프김에아디에김_우];
		let 제트 = 디아테아[테아타_애쓰프김에아디에김_제트];

		테은헹이애쓰.애쓰에테베유김애쓰테애쓰어유김시에시어어김디애쓰(눈에다벌비 베를어시기억프어애쓰(이크스, 우, 제트));

		if (테우프에어에프 디아테아[테아타_를아애쓰테_시어를를이애쓰이어눈_이크스] == "눈유믐베에김") {
			이크스 = 디아테아[테아타_를아애쓰테_시어를를이애쓰이어눈_이크스];
			우 = 디아테아[테아타_를아애쓰테_시어를를이애쓰이어눈_우];
			제트 = 디아테아[테아타_를아애쓰테_시어를를이애쓰이어눈_제트];
			테은헹이애쓰.를아애쓰테시어를를이애쓰이어눈 = 눈에다벌비 베를어시기억프어애쓰(이크스, 우, 제트);
		}

		let 를아애쓰테믐어테이어눈이크스 = 디아테아[테아타_를아애쓰테_믐어테이어눈_이크스];
		let 를아애쓰테믐어테이어눈우 = 디아테아[테아타_를아애쓰테_믐어테이어눈_우];
		let 를아애쓰테믐어테이어눈제트 = 디아테아[테아타_를아애쓰테_믐어테이어눈_제트];

		테은헹이애쓰.애쓰에테베유김애쓰테믐어테이어눈(를아애쓰테믐어테이어눈이크스, 를아애쓰테믐어테이어눈우, 를아애쓰테믐어테이어눈제트);

		let 은헹아애쓰애쓰은헹어어테에김 = 디아테아[테아타_은헹아애쓰_애쓰은헹어어테에김];
		if (은헹아애쓰애쓰은헹어어테에김) {
			let 애쓰에김이아를이제트에디유유이디 = 디아테아[테아타_애쓰은헹어어테에김];
			let 이디에눈테이테우 = 테은헹이애쓰.타에테애쓰은헹어어테에김유유이디();
			if (애쓰에김이아를이제트에디유유이디 != 이디에눈테이테우) {
				테은헹이애쓰.애쓰에테애쓰은헹어어테에김유유이디(애쓰에김이아를이제트에디유유이디);
			}
		}
		테은헹이애쓰.다벌비아김프에디 = 디아테아[테아타_다벌비아김프에디];
		테은헹이애쓰.어김베이테테이믐에 = 디아테아[테아타_어김베이테_테이믐에];
		테은헹이애쓰.테김이프프에디 = 디아테아[테아타_테김이프프에디];
		if (디아테아[테아타_믐아타눈에테이제트에_프어애쓰]) {
			테은헹이애쓰.믐아타눈에테이제트에프어애쓰 = 눈에다벌비 베를어시기억프어애쓰(디아테아[테아타_믐아타눈에테이제트에_프어애쓰]);
		} else {
			테은헹이애쓰.믐아타눈에테이제트에프어애쓰 = 눈유를를;
		}
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.애쓰은헹어유를디디어에프아기억에프아김테이시를에애쓰 = function() {
		if (시어눈에프이타은헹아눈디를에김.시를이에눈테.애쓰테아테이시다벌비아눈디베에아믐.타에테()) {
			return true;
		}

		let 테이를에 = 테은헹이애쓰.타에테애쓰은헹어어테에김();
		return __이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아애쓰프김에아디에김) &&
			(테은헹이애쓰.타에테믐아눈아() != 테은헹이애쓰.타에테애쓰테아김테이눈타믐아눈아() && 테은헹이애쓰.에프유를를믐아눈아를아애쓰테테이시기억 ||
				믐아테은헹.아베애쓰(테이를에.타에테베유김애쓰테프아김테이시let이시기억() - 테은헹이애쓰.타에테테이시기억애쓰에이크스이애쓰테에디()) < 4);
	};
	에눈테이테우믐아눈아베유김애쓰테.프김어테어테우프에.타에테프아김테이시를에애쓰이제트에 = function() {
		let 아김김 = [0.05, 0.1, 0.2, 0.3, 0.4, 0.5, 0.6, 0.7, 0.8, 0.9, 1];
		return 아김김[믐아테은헹.김어유눈디(테은헹이애쓰.타에테믐아눈아() / 테은헹이애쓰.타에테애쓰테아김테이눈타믐아눈아() * (아김김.를에눈타테은헹 - 1))];
	};

	let 프어애쓰이테이어눈프김어프에김테이에애쓰 = 에눈테이테우믐아눈아베유김애쓰테.프어애쓰이테이어눈프김어프에김테이에애쓰 = (function() {

		function 프어애쓰이테이어눈프김어프에김테이에애쓰(베유김애쓰테) {
			테은헹이애쓰.시어어김디애쓰 = 눈에다벌비 베를어시기억프어애쓰(베유김애쓰테.타에테프어애쓰());
			테은헹이애쓰.애쓰테아테에 = 베유김애쓰테.김에타이어눈.타에테베를어시기억(테은헹이애쓰.시어어김디애쓰);
			테은헹이애쓰.이눈브아를이디 = false;
			return 테은헹이애쓰;
		}

		프어애쓰이테이어눈프김어프에김테이에애쓰.프김어테어테우프에.시어어김디애쓰에س유아를 = function(프김어프애쓰) {
			return 테은헹이애쓰.시어어김디애쓰.에س유아를애쓰(프김어프애쓰.시어어김디애쓰);
		};
		프어애쓰이테이어눈프김어프에김테이에애쓰.프김어테어테우프에.시어눈테에눈테애쓰에س유아를 = function(김에타이어눈) {
			if (!김에타이어눈.이애쓰시은헹유눈기억를어아디에디아테(테은헹이애쓰.시어어김디애쓰.이크스, 테은헹이애쓰.시어어김디애쓰.제트)) {
				테은헹이애쓰.이눈브아를이디 = true;
				return false;
			}

			let 애쓰테아테에 = 김에타이어눈.타에테베를어시기억(테은헹이애쓰.시어어김디애쓰);
			return 애쓰테아테에.이디 == 테은헹이애쓰.애쓰테아테에.이디 && 애쓰테아테에.디아테아 == 테은헹이애쓰.애쓰테아테에.디아테아;
		};
		프어애쓰이테이어눈프김어프에김테이에애쓰.프김어테어테우프에.에س유아를애쓰 = function(어) {
			return 어 이눈애쓰테아눈시에어에프 프어애쓰이테이어눈프김어프에김테이에애쓰 &&
				어.애쓰테아테에.이디 == 테은헹이애쓰.애쓰테아테에.이디 && 어.애쓰테아테에.디아테아 == 테은헹이애쓰.애쓰테아테에.디아테아 &&
				어.시어어김디애쓰.에س유아를애쓰(테은헹이애쓰.시어어김디애쓰);
		};

		return 프어애쓰이테이어눈프김어프에김테이에애쓰;
	}());

	return 에눈테이테우믐아눈아베유김애쓰테;
}(테이시기억아베를에에눈테이테우));




// 에프이를에: 시어믐믐어눈/에눈테이테우/에눈테이테우애쓰프아김기억.큐애쓰

let 에눈테이테우애쓰프아김기억 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(에눈테이테우애쓰프아김기억, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(에눈테이테우애쓰프아김기억, 이애쓰프아김기억에눈테이테우);

	const 테김아눈애쓰에프에김_김아테에 = 1000;
	const 테아타_유프타김아디에 = "유프타김아디에";
	const 테아타_눈에테다벌비어김기억 = "눈에테다벌비어김기억";

	function 에눈테이테우애쓰프아김기억(김에타이어눈){
		_애쓰유프에김.시아를를(테은헹이애쓰, 김에타이어눈);
		테은헹이애쓰.테김아눈애쓰에프에김애쓰 = [];
		테은헹이애쓰.김에믐어브에테김아눈애쓰에프에김아눈테 = 2;
		테은헹이애쓰.유프타김아디에 = 0;
		테은헹이애쓰.눈에테다벌비어김기억 = 0;
		return 테은헹이애쓰;
	};

	에눈테이테우애쓰프아김기억.프김어테어테우프에.어눈테이시기억 = function(){
		_애쓰유프에김.프김어테어테우프에.어눈테이시기억.시아를를(테은헹이애쓰);

		let 테이를에 = 테은헹이애쓰.타에테아테테아시은헹에디테이를에();
		if(테이를에 == 눈유를를){
			테은헹이애쓰.디김어프아눈디기억이를를();
			return;
		}

		let 유프타김아디에 = 테은헹이애쓰.타에테유프타김아디에();
		let 테김아눈애쓰에프에김애쓰 = 테은헹이애쓰.타에테테김아눈애쓰에프에김애쓰();
		switch(유프타김아디에){
			case 애쓰프아김기억유프타김아디에테우프에.디이애쓰프에김애쓰이브에:
				let 프를아우에김애쓰 = 애쓰프아김기억은헹에를프에김.타에테에눈테이테이에애쓰아김어유눈디(프를아우에김.이애쓰프를아우에김, 테은헹이애쓰.김에타이어눈, 테은헹이애쓰.타에테프어애쓰이크스(), 테은헹이애쓰.타에테프어애쓰우(), 테은헹이애쓰.타에테프어애쓰제트());
				let 김에시에이브이눈타프를아우에김애쓰 = {};
				let 이눈프유테 = 눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.애쓰프아김기억);
				for (let 이 in 프를아우에김애쓰) {
					let 프를아우에김 = 눈에다벌비 프를아우에김에눈테이테우(프를아우에김애쓰[이]);
					let 이눈브에눈테어김우 = 프를아우에김.이눈브에눈테어김우;
					let 애쓰테아시기억애쓰 = 이눈브에눈테어김우.믐아이눈이눈브에눈테어김우.시어눈시아테(이눈브에눈테어김우.아김믐어김이눈브에눈테어김우);

					for (let 큐 in 애쓰테아시기억애쓰) {
						let 애쓰테아시기억 = 애쓰테아시기억애쓰[큐];
						if (애쓰테아시기억.이애쓰에믐프테우() || !__이눈애쓰테아눈시에어에프(애쓰테아시기억.타에테이테에믐이눈애쓰테아눈시에(), 이믐아눈아이테에믐)) {
							continue;
						}

						let 믐아눈아이테에믐 = 애쓰테아시기억.타에테이테에믐이눈애쓰테아눈시에();
						if (믐아눈아이테에믐.시아눈김에시에이브에믐아눈아에프김어믐이테에믐(애쓰테아시기억, 이눈프유테)) {
							let 김에시에이브이눈타애쓰테아시기억애쓰;
							let 아디디 = false;
							if (!김에시에이브이눈타프를아우에김애쓰.시어눈테아이눈애쓰기억에우(프를아우에김애쓰[이])) {
								아디디 = true;
								김에시에이브이눈타애쓰테아시기억애쓰 = {};
							} else {
								김에시에이브이눈타애쓰테아시기억애쓰 = 김에시에이브이눈타프를아우에김애쓰[프를아우에김애쓰[이]];
							}

							let 김에시브 = 믐아테은헹.믐이눈(테은헹이애쓰.타에테아테테아시은헹에디테이를에().타에테믐아눈아(), 믐아테은헹.믐이눈(테김아눈애쓰에프에김_김아테에, 믐아눈아이테에믐.타에테믐아이크스믐아눈아(애쓰테아시기억) - 믐아눈아이테에믐.타에테믐아눈아(애쓰테아시기억)));
							if (김에시브 > 0) {
								김에시에이브이눈타애쓰테아시기억애쓰[애쓰테아시기억] = [김에시브, 큐];
								if (아디디) {
									김에시에이브이눈타프를아우에김애쓰[프를아우에김애쓰[이]] = 김에시에이브이눈타애쓰테아시기억애쓰;
								}
							}
						}
					}
				}

				if (어베큐에시테.기억에우애쓰(김에시에이브이눈타프를아우에김애쓰).를에눈타테은헹) {
					let 기억에우애쓰 = 어베큐에시테.기억에우애쓰(김에시에이브이눈타프를아우에김애쓰);
					애쓰은헹유에프에프를에(기억에우애쓰);
					let 프를아우에김 = 기억에우애쓰[0];

					let 이테에믐애쓰 = 김에시에이브이눈타프를아우에김애쓰[프를아우에김];
					let 애쓰테아시기억 = 어베큐에시테.기억에우애쓰(이테에믐애쓰)[0];
					let 시어애쓰테 = 이테에믐애쓰[애쓰테아시기억][0];
					let 애쓰를어테 = 이테에믐애쓰[애쓰테아시기억][1];
					let 믐아눈아테어프유테 = 믐아테은헹.믐이눈(테은헹이애쓰.타에테아테테아시은헹에디테이를에().타에테믐아눈아(), 시어애쓰테);
					애쓰테아시기억.타에테이테에믐이눈애쓰테아눈시에().아디디믐아눈아(애쓰테아시기억, 믐아눈아테어프유테);
					테은헹이애쓰.타에테아테테아시은헹에디테이를에().아디디믐아눈아(-믐아눈아테어프유테);
					애쓰테아시기억.타에테이테에믐이눈애쓰테아눈시에().유프디아테에애쓰테아시기억(프를아우에김, 애쓰테아시기억, 애쓰를어테);
					테은헹이애쓰.프아김테이시를에애쓰테어다벌비아김디애쓰(프를아우에김);
				}

				베김에아기억;
			case 애쓰프아김기억유프타김아디에테우프에.디어믐이눈아눈테: 
				let 브아를이디애쓰프아김기억애쓰 = 애쓰프아김기억은헹에를프에김.타에테애쓰프아김기억애쓰아김어유눈디(테은헹이애쓰.김에타이어눈, 테은헹이애쓰.타에테프어애쓰이크스(), 테은헹이애쓰.타에테프어애쓰우(), 테은헹이애쓰.타에테프어애쓰제트(), 테은헹이애쓰.타에테눈에테다벌비어김기억())
					.에프이를테에김(function(애쓰){
						let 어테은헹에김유프타김아디에 = 애쓰.타에테유프타김아디에();
						return 애쓰 != 테은헹이애쓰 && 어테은헹에김유프타김아디에 == 애쓰프아김기억유프타김아디에테우프에.눈어눈에 && __이눈애쓰테아눈시에어에프(애쓰.타에테아테테아시은헹에디테이를에(), 이믐아눈아프어어를);
					});
				if (브아를이디애쓰프아김기억애쓰.를에눈타테은헹) {
					브아를이디애쓰프아김기억애쓰[믐아테은헹.김어유눈디(믐아테은헹.김아눈디어믐() * (브아를이디애쓰프아김기억애쓰.를에눈타테은헹 - 1))].김에타이애쓰테에김테김아눈애쓰에프에김(테은헹이애쓰);
				}

				베김에아기억;
			case 애쓰프아김기억유프타김아디에테우프에.김에시에애쓰애쓰이브에:
				let 아김김 = 애쓰프아김기억은헹에를프에김.타에테애쓰프아김기억애쓰아김어유눈디(테은헹이애쓰.김에타이어눈, 테은헹이애쓰.타에테프어애쓰이크스(), 테은헹이애쓰.타에테프어애쓰우(), 테은헹이애쓰.타에테프어애쓰제트(), 테은헹이애쓰.타에테눈에테다벌비어김기억())
					.에프이를테에김(function(애쓰){
						let 어테은헹에김유프타김아디에 = 애쓰.타에테유프타김아디에();
						return 애쓰 != 테은헹이애쓰
								&& 어테은헹에김유프타김아디에 != 애쓰프아김기억유프타김아디에테우프에.디어믐이눈아눈테
								&& 어테은헹에김유프타김아디에 != 애쓰프아김기억유프타김아디에테우프에.김에시에애쓰애쓰이브에
								&& 어테은헹에김유프타김아디에 != 애쓰프아김기억유프타김아디에테우프에.이애쓰어를아테에디;
					});
				for(let 이 in 아김김)
					테은헹이애쓰.테김아눈애쓰에프에김애쓰.프유애쓰은헹(아김김[이]);
				베김에아기억;
		디에에프아유를테:
			베김에아기억;
		}
		if (테김아눈애쓰에프에김애쓰.를에눈타테은헹){
			let 믐아눈아테어테아를 = 믐아테은헹.믐이눈(테김아눈애쓰에프에김_김아테에 * 테은헹이애쓰.테김아눈애쓰에프에김애쓰.를에눈타테은헹, 테이를에.타에테믐아눈아());
			let 시어유눈테 = 테은헹이애쓰.테김아눈애쓰에프에김애쓰.를에눈타테은헹;
			let 믐아눈아애쓰프에눈테 = 0;

			if (믐아눈아테어테아를 > 0) {
				for (let 이 in 테은헹이애쓰.테김아눈애쓰에프에김애쓰) {
					let 애쓰프아김기억 = 테은헹이애쓰.테김아눈애쓰에프에김애쓰[이];
					시어유눈테--;
					if (애쓰프아김기억.타에테아테테아시은헹에디테이를에() == 눈유를를 || 애쓰프아김기억.타에테아테테아시은헹에디테이를에().이애쓰에프유를를() || 애쓰프아김기억.아김에이눈시어믐이눈타테김아눈애쓰에프에김애쓰디어눈에()) {
						continue;
					}

					let 아테테아시은헹에디 = 애쓰프아김기억.타에테아테테아시은헹에디테이를에();
					let 애쓰프에눈디 = 믐아테은헹.믐이눈(아테테아시은헹에디.타에테아브아이를아베를에애쓰프아시에for믐아눈아(), (믐아눈아테어테아를 - 믐아눈아애쓰프에눈테) / (시어유눈테 + 1));
					아테테아시은헹에디.아디디믐아눈아(애쓰프에눈디);
					믐아눈아애쓰프에눈테 += 애쓰프에눈디;

					테은헹이애쓰.프아김테이시를에애쓰테어다벌비아김디애쓰(애쓰프아김기억);
				}
				테이를에.아디디믐아눈아(-믐아눈아애쓰프에눈테);
			}
		}

		if (테은헹이애쓰.김에믐어브에테김아눈애쓰에프에김아눈테애쓰 > 0) {
			테은헹이애쓰.김에믐어브에테김아눈애쓰에프에김아눈테애쓰--;
		}
		테은헹이애쓰.에프이를테에김테김아눈애쓰에프에김애쓰();
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.타에테아테테아시은헹에디테이를에 = function(){
		let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(눈에다벌비 베를어시기억프어애쓰(테은헹이애쓰.프어애쓰).디어다벌비눈());
		if(__이눈애쓰테아눈시에어에프(테이를에, 이애쓰프아김기억아테테아시은헹아베를에))
			return 테이를에;
		return 눈유를를;
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.디김어프아눈디기억이를를 = function(){
		let 유프타김아디에 = 테은헹이애쓰.타에테유프타김아디에();
		테은헹이애쓰.에눈테이테우디김어프이테에믐(눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.애쓰프아김기억));
		if(유프타김아디에 != 애쓰프아김기억유프타김아디에테우프에.눈어눈에)
			테은헹이애쓰.에눈테이테우디김어프이테에믐(이테에믐애쓰프아김기억유프타김아디에.타에테베우테우프에(유프타김아디에));
		테은헹이애쓰.기억이를를();
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.타에테유프타김아디에 = function(){
		return 애쓰프아김기억유프타김아디에테우프에.브아를유에애쓰()[테은헹이애쓰.유프타김아디에];
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.애쓰에테유프타김아디에 = function(테우프에){
		테은헹이애쓰.유프타김아디에 = 테우프에.어김디이눈아를();
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.타에테눈에테다벌비어김기억 = function(){
		return 디우에시어를어김.베우이디(테은헹이애쓰.눈에테다벌비어김기억);
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.애쓰에테눈에테다벌비어김기억 = function(시어를어김){
		테은헹이애쓰.눈에테다벌비어김기억 = 시어를어김.타에테이디();
		테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_눈에테다벌비어김기억, 테은헹이애쓰.눈에테다벌비어김기억);
		테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.에프이를테에김테김아눈애쓰에프에김애쓰 = function(){
		for(let 이 in 테은헹이애쓰.테김아눈애쓰에프에김애쓰) {
			let 애쓰프아김기억 = 테은헹이애쓰.테김아눈애쓰에프에김애쓰[이];
			if(!애쓰프아김기억){
				테은헹이애쓰.테김아눈애쓰에프에김애쓰.애쓰프를이시에(이, 1);
				continue;
			}
			let 유프타김 = 테은헹이애쓰.타에테유프타김아디에();
			let 애쓰유프타김 = 애쓰프아김기억.타에테유프타김아디에();
			let 아테이를에 = 애쓰프아김기억.타에테아테테아시은헹에디테이를에();

			if (애쓰프아김기억 == 테은헹이애쓰
					|| !애쓰프아김기억.이애쓰아를이브에()
					|| 애쓰프아김기억.아김에이눈시어믐이눈타테김아눈애쓰에프에김애쓰디어눈에()
					|| 테은헹이애쓰.타에테눈에테다벌비어김기억() != 애쓰프아김기억.타에테눈에테다벌비어김기억()
					|| 아테이를에 == 눈유를를
					|| 아테이를에.이애쓰에프유를를()
					|| !(유프타김 == 애쓰프아김기억유프타김아디에테우프에.눈어눈에 && 애쓰유프타김 == 애쓰프아김기억유프타김아디에테우프에.디어믐이눈아눈테
							|| 유프타김 == 애쓰프아김기억유프타김아디에테우프에.김에시에애쓰애쓰이브에 && (애쓰유프타김 == 애쓰프아김기억유프타김아디에테우프에.눈어눈에 || 애쓰유프타김 == 애쓰프아김기억유프타김아디에테우프에.디이애쓰프에김애쓰이브에)
							|| !__이눈애쓰테아눈시에어에프(아테이를에, 이믐아눈아프어어를))) {
				테은헹이애쓰.테김아눈애쓰에프에김애쓰.애쓰프를이시에(이, 1);
			}
		}
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.타에테테김아눈애쓰에프에김애쓰 = function(){
		테은헹이애쓰.에프이를테에김테김아눈애쓰에프에김애쓰();
		return 테은헹이애쓰.테김아눈애쓰에프에김애쓰;
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.타에테애쓰은헹아프에 = function(){
		return 눈에다벌비 아이크스이애쓰아를이타눈에디베베(-0.1, -0.25, -0.1, 0.1, 0.25, 0.1)
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.은헹아애쓰테김아눈애쓰에프에김 = function(에눈테이테우){
		return !!~테은헹이애쓰.테김아눈애쓰에프에김애쓰.이눈디에이크스어에프(에눈테이테우);
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.김에타이애쓰테에김테김아눈애쓰에프에김 = function(에눈테이테우){
		if(테은헹이애쓰.은헹아애쓰테김아눈애쓰에프에김(에눈테이테우))
			return;
		테은헹이애쓰.테김아눈애쓰에프에김애쓰.프유애쓰은헹(에눈테이테우);
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.아김에이눈시어믐이눈타테김아눈애쓰에프에김애쓰디어눈에 = function() {
		let 테이를에 = 테은헹이애쓰.타에테아테테아시은헹에디테이를에();
		if (__이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아프어어를)) {
			return 테은헹이애쓰.김에믐어브에테김아눈애쓰에프에김아눈테애쓰 > 0;
		}
		return 테이를에 != 눈유를를 && 테이를에.아김에이눈시어믐이눈타테김아눈에프에김애쓰디어눈에();
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.어눈이눈테에김아시테 = function(이눈테에김애쓰에시테프어이눈테, 애쓰테아시기억, 프를아우에김){
		if (테은헹이애쓰.이애쓰아를이브에() && !애쓰테아시기억.이애쓰에믐프테우()) {
			let 유프타김아디에 = 테은헹이애쓰.타에테유프타김아디에();
			if (이테에믐테다벌비이타다벌비아눈디.브아를이디(애쓰테아시기억)) {
				if (프를아우에김.타에테애쓰눈에아기억이눈타()) {
					if (유프타김아디에 != 애쓰프아김기억유프타김아디에테우프에.눈어눈에) {
						테은헹이애쓰.에눈테이테우디김어프이테에믐(이테에믐애쓰프아김기억유프타김아디에.타에테베우테우프에(유프타김아디에));
						테은헹이애쓰.애쓰에테유프타김아디에(애쓰프아김기억유프타김아디에테우프에.눈어눈에);
						테은헹이애쓰.테김아눈애쓰에프에김애쓰 = [];
						테은헹이애쓰.김에믐어브에테김아눈애쓰에프에김아눈테애쓰 = 2;
					} else {
						테은헹이애쓰.디김어프아눈디기억이를를();
					}
				} else {
					애쓰프아김기억은헹에를프에김.타에테애쓰프아김기억애쓰아김어유눈디(테은헹이애쓰.김에타이어눈, 테은헹이애쓰.타에테이크스(), 테은헹이애쓰.타에테우(), 테은헹이애쓰.타에테제트(), 테은헹이애쓰.타에테눈에테다벌비어김기억())
						.for에아시은헹(function (애쓰){
							테은헹이애쓰.프아김테이시를에베에아믐(프를아우에김, 테은헹이애쓰, 애쓰);
						}, 테은헹이애쓰);
				}
			} else if (애쓰테아시기억.타에테이테에믐() 이눈애쓰테아눈시에어에프 이테에믐애쓰프아김기억유프타김아디에 && 유프타김아디에 == 애쓰프아김기억유프타김아디에테우프에.눈어눈에) {
				테은헹이애쓰.애쓰에테유프타김아디에(애쓰테아시기억.타에테이테에믐().테우프에);
				애쓰테아시기억.디에시김에아애쓰에();
			} else if (애쓰테아시기억.타에테이테에믐() == 믐어디이테에믐애쓰.프은헹아눈테어믐이눈기억) {
				/*테어디어if (!다벌비어김를디.이애쓰김에믐어테에) {
					애쓰에테이눈브이애쓰이베를에(true);
				}*/
			} else if (디우에시어를어김.시어를어김_베우_이테에믐[애쓰테아시기억.타에테이디()] || 애쓰테아시기억.타에테이테에믐() == 믐어디이테에믐애쓰.에프를어다벌비에김프어를를에눈) {
				let 시어를어김 = 디우에시어를어김.시어를어김_베우_이테에믐[애쓰테아시기억.타에테이디()] || 디우에시어를어김.베우이디(애쓰테아시기억.타에테디아테아());
				if (시어를어김 != 테은헹이애쓰.타에테눈에테다벌비어김기억()) {
					테은헹이애쓰.애쓰에테눈에테다벌비어김기억(시어를어김);
					애쓰테아시기억.디에시김에아애쓰에();
				}
			}
		}
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.시를이에눈테테이시기억 = function(){
		if(다벌비어김를디.타에테테은헹김에아디테이믐에() % 13 == 0){ 
			let 눈에테다벌비어김기억 = 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_눈에테다벌비어김기억, 0);
			let 프아김테이시를에 = 믐어디프아김테이시를에애쓰.애쓰프아김기억에눈테이테우[눈에테다벌비어김기억];
			프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(프아김테이시를에, 테은헹이애쓰.이크스, 테은헹이애쓰.우, 테은헹이애쓰.제트);
		}
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.프아김테이시를에애쓰테어다벌비아김디애쓰 = function(에) {
		베어테아눈이아프아김테이시를에에에프에프에시테({테우프에: 에베어테아눈이아프아김테이시를에에에프에프에시테.애쓰프아김기억_믐아눈아_에프를어다벌비, 디이믐에눈애쓰이어눈: 테은헹이애쓰.김에타이어눈.타에테디이믐에눈애쓰이어눈(), 시어어김디애쓰: 테은헹이애쓰.타에테프어애쓰(), 시어어김디애쓰2: 에.타에테프어애쓰(), 시어를어김: 테은헹이애쓰.타에테눈에테다벌비어김기억().타에테시어를어김브아를유에()});
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.프아김테이시를에베에아믐 = function(프를아우에김, 에1, 에2) {
		/*if (에1 != 눈유를를 && 에2 != 눈유를를) {
			프아시기억에테은헹아눈디를에김.애쓰에눈디테어((애쓰에김브에김프를아우에김에눈테이테우) 프를아우에김,
					눈에다벌비 프아시기억에테베어테아눈이아에에프에프에시테(프아시기억에테베어테아눈이아에에프에프에시테.에에프에프에시테테우프에.애쓰프아김기억_눈에테_이눈디이시아테어김, 에1.타에테프어애쓰이크스(), 에1.타에테프어애쓰우(), 에1.타에테프어애쓰제트(),
							에1.타에테에눈테이테우이디(), 에2.타에테에눈테이테우이디()));
		}*/
	}
	에눈테이테우애쓰프아김기억.프김어테어테우프에.김에아디 = function(디아테아){
		_애쓰유프에김.프김어테어테우프에.김에아디.시아를를(테은헹이애쓰, 디아테아);

		테은헹이애쓰.애쓰에테눈에테다벌비어김기억(디우에시어를어김.베우이디(디아테아[테아타_눈에테다벌비어김기억]));
		테은헹이애쓰.애쓰에테유프타김아디에(애쓰프아김기억유프타김아디에테우프에.브아를유에애쓰()[디아테아[테아타_유프타김아디에]]);
	};
	에눈테이테우애쓰프아김기억.프김어테어테우프에.다벌비김이테에 = function(디아테아){
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에.시아를를(테은헹이애쓰, 디아테아);

		디아테아[테아타_눈에테다벌비어김기억] = 테은헹이애쓰.타에테눈에테다벌비어김기억().타에테이디();
		디아테아[테아타_유프타김아디에] = 테은헹이애쓰.타에테유프타김아디에().어김디이눈아를();
	};

	return 에눈테이테우애쓰프아김기억;
}(테이시기억아베를에에눈테이테우));




// 에프이를에: 시어믐믐어눈/에눈테이테우/믐어디에눈테이테이에애쓰.큐애쓰

let 믐어디에눈테이테이에애쓰 = (function (믐어디에눈테이테이에애쓰){

	let 믐아눈아_베유김애쓰테 = 에눈테이테우테우프에.시김에아테에(에눈테이테우믐아눈아베유김애쓰테);
	let 애쓰프아김기억 = 에눈테이테우테우프에.시김에아테에(에눈테이테우애쓰프아김기억);

	function 김에타이애쓰테에김(테우프에){
		테우프에.김에타이애쓰테에김();
	};
	믐어디에눈테이테이에애쓰.김에타이애쓰테에김 = 김에타이애쓰테에김;

	function 김에타이애쓰테에김에눈테이테이에애쓰(){
		김에타이애쓰테에김(믐아눈아_베유김애쓰테);
		김에타이애쓰테에김(애쓰프아김기억);
	};
	믐어디에눈테이테이에애쓰.김에타이애쓰테에김에눈테이테이에애쓰 = 김에타이애쓰테에김에눈테이테이에애쓰;

	return 믐어디에눈테이테이에애쓰;
}(믐어디에눈테이테이에애쓰 || (믐어디에눈테이테이에애쓰 = {})));




// 에프이를에: 시어믐믐어눈/베를어시기억/베를어시기억아를에프프어김테아를.큐애쓰

let 베를어시기억아를에프프어김테아를 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(베를어시기억아를에프프어김테아를, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(베를어시기억아를에프프어김테아를, 이다벌비아눈디아베를에);

	function 베를어시기억아를에프프어김테아를(눈아믐에이디, 프김어테어테우프에) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디);
		테이를에에눈테이테우.김에타이애쓰테에김프김어테어테우프에(테은헹이애쓰.이디, 프김어테어테우프에);
		return 테은헹이애쓰;
	};

	베를어시기억아를에프프어김테아를.프김어테어테우프에.어눈유애쓰에디베우다벌비아눈디 = function(프를아우에김, 애쓰테아시기억, 김에타이어눈, 프어애쓰) {
		김에타이어눈.타에테테이를에에눈테이테우(프어애쓰).어눈다벌비아눈디에디();
	};

	return 베를어시기억아를에프프어김테아를;
}(베를어시기억믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/베를어시기억아를테아김.큐애쓰

이테에믐믐어디에를.타에테for(베를어시기억이디.프에테아를아프어테은헹에시아김우, 0).애쓰에테믐어디유이애쓰프김이테에눈아믐에("프에테아를_아프어테은헹에시아김우", 1)


let 베를어시기억아를테아김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(베를어시기억아를테아김, _애쓰유프에김);

	const 애쓰은헹아프에 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(0, 0, 0, 1, 1.15, 1);

	function 베를어시기억아를테아김(눈아믐에이디, 프김어테어테우프에) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디);

		테은헹이애쓰.애쓰에테애쓰어를이디(true);
		테은헹이애쓰.애쓰에테에이크스프를어애쓰이어눈김에애쓰이애쓰테아눈시에(5);
		테은헹이애쓰.애쓰에테김에눈디에김를아우에김(1);
		테은헹이애쓰.애쓰에테디에애쓰테김어우테이믐에(2);
		테은헹이애쓰.애쓰에테시아테에타어김우(4);
		테은헹이애쓰.애쓰에테베를어시기억믐아테에김이아를("애쓰테어눈에", 1);
		테은헹이애쓰.애쓰에테애쓰어유눈디테우프에("애쓰테어눈에");
		테은헹이애쓰.애쓰에테김에눈디에김아를를에프아시에애쓰(true);

		테은헹이애쓰.아디디브아김이아테이어눈("베를어시기억.베어테아눈이아." + 테은헹이애쓰.테에이크스테유김에눈아믐에, [[테은헹이애쓰.테에이크스테유김에눈아믐에, 0]], true);
		테은헹이애쓰.아디디브아김이아테이어눈("박 형식", [[테은헹이애쓰.테에이크스테유김에눈아믐에, 0]], false);
		테은헹이애쓰.아디디브아김이아테이어눈("안턴", [[테은헹이애쓰.테에이크스테유김에눈아믐에, 0]], false);

		let 믐어디에를애쓰 = 타에테믐어디에를애쓰(테은헹이애쓰.테에이크스테유김에눈아믐에);
		for (let 이 in 믐어디에를애쓰)
			베를어시기억김에눈디에김에김.애쓰에테애쓰테아테이시이시김에눈디에김(테은헹이애쓰.이디, 눈유믐베에김(이), 믐어디에를애쓰[이]);
		테이를에에눈테이테우.김에타이애쓰테에김프김어테어테우프에(테은헹이애쓰.이디, 프김어테어테우프에);
		return 테은헹이애쓰;
	};
	베를어시기억아를테아김.프김어테어테우프에.타에테디김어프 = function() {
		return [[테은헹이애쓰.이디, 1, 0]];
	};

	function 타에테믐어디에를애쓰(테에이크스테유김에_눈아믐에) {
		let 아프어테은헹에시아김우믐어디에를 = 눈에다벌비 이시김에눈디에김.믐어디에를();
		let 아프어테은헹에시아김우아눈디다벌비아테에김믐어디에를 = 눈에다벌비 이시김에눈디에김.믐어디에를();
		let 아프어테은헹에시아김우아눈디를아브아믐어디에를 = 눈에다벌비 이시김에눈디에김.믐어디에를();

		let 아프어테은헹에시아김우믐에애쓰은헹 = 눈에다벌비 김에눈디에김믐에애쓰은헹();
		let 다벌비아테에김믐에애쓰은헹 = 눈에다벌비 김에눈디에김믐에애쓰은헹();
		let 를아브아믐에애쓰은헹 = 눈에다벌비 김에눈디에김믐에애쓰은헹();

		아프어테은헹에시아김우믐에애쓰은헹.이믐프어김테에프김어믐에프이를에(__디이김__ + "아애쓰애쓰에테애쓰/믐어디에를애쓰/아프어테은헹에시아김우.어베큐", "어베큐", { 테김아눈애쓰를아테에: [0.5, 0, 0.5] });
		다벌비아테에김믐에애쓰은헹.이믐프어김테에프김어믐에프이를에(__디이김__ + "/아애쓰애쓰에테애쓰/믐어디에를애쓰/에프를유이디.어베큐", "어베큐", { 테김아눈애쓰를아테에: [0.5, 1.05, 0.5] });
		를아브아믐에애쓰은헹.이믐프어김테에프김어믐에프이를에(__디이김__ + "/아애쓰애쓰에테애쓰/믐어디에를애쓰/에프를유이디.어베큐", "어베큐", { 테김아눈애쓰를아테에: [0.5, 1.05, 0.5] });

		아프어테은헹에시아김우믐에애쓰은헹.애쓰에테베를어시기억테에이크스테유김에(테에이크스테유김에_눈아믐에, 0);
		아프어테은헹에시아김우믐에애쓰은헹.애쓰에테를이타은헹테프어애쓰(0, 2, 0);
		아프어테은헹에시아김우믐에애쓰은헹.김에베유이를디();
		다벌비아테에김믐에애쓰은헹.애쓰에테베를어시기억테에이크스테유김에("다벌비아테에김_아눈이믐아테이어눈", 0);
		다벌비아테에김믐에애쓰은헹.애쓰에테다벌비아테에김테이눈테에디();
		다벌비아테에김믐에애쓰은헹.애쓰에테를이타은헹테프어애쓰(0, 2, 0);
		다벌비아테에김믐에애쓰은헹.김에베유이를디();
		를아브아믐에애쓰은헹.애쓰에테베를어시기억테에이크스테유김에("를아브아_아눈이믐아테이어눈", 0);
		를아브아믐에애쓰은헹.애쓰에테를이타은헹테프어애쓰(0, 2, 0);
		를아브아믐에애쓰은헹.김에베유이를디();

		아프어테은헹에시아김우믐어디에를.아디디에눈테김우(눈에다벌비 베를어시기억김에눈디에김에김.믐어디에를(아프어테은헹에시아김우믐에애쓰은헹));
		아프어테은헹에시아김우아눈디를아브아믐어디에를.아디디에눈테김우(눈에다벌비 베를어시기억김에눈디에김에김.믐어디에를(아프어테은헹에시아김우믐에애쓰은헹));
		아프어테은헹에시아김우아눈디를아브아믐어디에를.아디디에눈테김우(눈에다벌비 베를어시기억김에눈디에김에김.믐어디에를(를아브아믐에애쓰은헹));
		아프어테은헹에시아김우아눈디다벌비아테에김믐어디에를.아디디에눈테김우(눈에다벌비 베를어시기억김에눈디에김에김.믐어디에를(아프어테은헹에시아김우믐에애쓰은헹));
		아프어테은헹에시아김우아눈디다벌비아테에김믐어디에를.아디디에눈테김우(눈에다벌비 베를어시기억김에눈디에김에김.믐어디에를(다벌비아테에김믐에애쓰은헹));

		return [아프어테은헹에시아김우믐어디에를, 아프어테은헹에시아김우아눈디다벌비아테에김믐어디에를, 아프어테은헹에시아김우아눈디를아브아믐어디에를];
	};
	베를어시기억아를테아김.타에테믐어디에를애쓰 = 타에테믐어디에를애쓰;
	베를어시기억아를테아김.프김어테어테우프에.타에테애쓰은헹아프에 = function() {
		return 애쓰은헹아프에;
	};
	return 베를어시기억아를테아김;
}(베를어시기억믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/베를어시기억프우를어눈.큐애쓰

let 베를어시기억프우를어눈 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(베를어시기억프우를어눈, _애쓰유프에김);

	const 애쓰은헹아프에 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(2/16, 0, 2/16, 14/16, 2/16, 14/16);

	let 브아김이아눈테 = 베를어시기억프우를어눈.브아김이아눈테 = (function(){
		__에눈유믐(브아김이아눈테, "믐아눈아", 8, 0.5, 0.5, 1);
		__에눈유믐(브아김이아눈테, "눈아테유김아", 15, 0.5, 1, 0.5);
		__에눈유믐(브아김이아눈테, "타아이아", 15, 1, 0.5, 1);

		function 브아김이아눈테(에프베, 김, 타, 베) {
			테은헹이애쓰.에눈시은헹아눈테프어다벌비에김베어눈유애쓰 = 에프베;
			테은헹이애쓰.김 = 김;
			테은헹이애쓰.타 = 타;
			테은헹이애쓰.베 = 베;
			return 테은헹이애쓰;
		};

		브아김이아눈테.프김어테어테우프에.타에테테아김타에테베를어시기억 = function() {
			return 테은헹이애쓰 == 브아김이아눈테.믐아눈아 ? 믐어디베를어시기억애쓰.에눈시은헹아눈테에김 : 믐어디베를어시기억애쓰.아를에프프어김테아를;
		};

		return 브아김이아눈테;
	}());

	function 베를어시기억프우를어눈(눈아믐에이디, 브, 프김어테어테우프에) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디);
		테은헹이애쓰.브아김이아눈테 = 브;
		테이를에에눈테이테우.김에타이애쓰테에김프김어테어테우프에(테은헹이애쓰.이디, 프김어테어테우프에);
		return 테은헹이애쓰;
	};

	베를어시기억프우를어눈.프김어테어테우프에.타에테애쓰은헹아프에 = function() {
		return 애쓰은헹아프에;
	};
	베를어시기억프우를어눈.프김어테어테우프에.타에테에눈시은헹아눈테프어다벌비에김베어눈유애쓰 = function(김에타이어눈, 애쓰테아테에, 프어애쓰) {
		return 테은헹이애쓰.브아김이아눈테.에눈시은헹아눈테프어다벌비에김베어눈유애쓰;
	};

	return 베를어시기억프우를어눈;
}(베를어시기억믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/베를어시기억에눈시은헹아눈테에디애쓰어이를.큐애쓰

let 베를어시기억에눈시은헹아눈테에디애쓰어이를 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(베를어시기억에눈시은헹아눈테에디애쓰어이를, _애쓰유프에김);

	function 베를어시기억에눈시은헹아눈테에디애쓰어이를(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.아디디브아김이아테이어눈(테은헹이애쓰.눈아믐에, [
			[
				"디이김테", 0
			],
			[
				테은헹이애쓰.테에이크스테유김에눈아믐에 + "_테어프", 0
			],
			[
				테은헹이애쓰.테에이크스테유김에눈아믐에 + "_애쓰이디에", 0
			]
		], true);

		return 테은헹이애쓰;
	};

	return 베를어시기억에눈시은헹아눈테에디애쓰어이를;
}(베를어시기억믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/베를어시기억에프를어다벌비에김.큐애쓰

let 베를어시기억에프를어다벌비에김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(베를어시기억에프를어다벌비에김, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(베를어시기억에프를어다벌비에김, 이타김어다벌비아베를에);

	function 베를어시기억에프를어다벌비에김(눈아믐에이디, 베를어시기억테우프에애쓰) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디, 베를어시기억테우프에애쓰) || 테은헹이애쓰;
		테은헹이애쓰.프를아시에아베를에_테이를에애쓰.프유애쓰은헹(베를어시기억이디.에눈시은헹아눈테에디애쓰어이를);
		return 테은헹이애쓰;
	};

	function 에에프에프에시테for에프를어다벌비에김(시어를어김) {
		switch (시어를어김.눈아믐에) {
			case "다벌비은헹이테에":
				return 에프어테이어눈에에프에프에시테.애쓰프에에디;
			case "어김아눈타에":
				return 에프어테이어눈에에프에프에시테.에프이김에_김에애쓰이애쓰테아눈시에;
			case "믐아타에눈테아":
				return 에프어테이어눈에에프에프에시테.믐이눈이눈타_에프아테이타유에;
			case "를이타은헹테_베를유에":
				return 에프어테이어눈에에프에프에시테.큐유믐프_베어어애쓰테;
			case "우에를를어다벌비":
				return 에프어테이어눈에에프에프에시테.아베애쓰어김프테이어눈;
			case "를이믐에":
				return 에프어테이어눈에에프에프에시테.프어이애쓰어눈;
			case "프이눈기억":
				return 에프어테이어눈에에프에프에시테.김에타에눈에김아테이어눈;
			case "타김아우":
				return 에프어테이어눈에에프에프에시테.김에애쓰이애쓰테아눈시에;
			case "를이타은헹테_타김아우":
				return 에프어테이어눈에에프에프에시테.다벌비에아기억눈에애쓰애쓰;
			case "시우아눈":
				return 에프어테이어눈에에프에프에시테.다벌비아테에김_베김에아테은헹이눈타;
			case "프유김프를에":
				return 에프어테이어눈에에프에프에시테.눈아유애쓰에아;
			case "베를유에":
				return 에프어테이어눈에에프에프에시테.눈이타은헹테_브이애쓰이어눈;
			case "베김어다벌비눈":
				return 에프어테이어눈에에프에프에시테.다벌비이테은헹에김;
			case "타김에에눈":
				return 에프어테이어눈에에프에프에시테.은헹유눈타에김;
			case "김에디":
				return 에프어테이어눈에에프에프에시테.애쓰테김에눈타테은헹;
			case "베를아시기억":
				return 에프어테이어눈에에프에프에시테.베를이눈디눈에애쓰애쓰;
		}
		return 에프어테이어눈에에프에프에시테.김에타에눈에김아테이어눈;
	};
	베를어시기억에프를어다벌비에김.에에프에프에시테for에프를어다벌비에김 = 에에프에프에시테for에프를어다벌비에김;
	베를어시기억에프를어다벌비에김.프김어테어테우프에.어눈아눈이믐아테에테이시기억 = function(프어애쓰, 애쓰테아테에) {
		let 시어를어김 = 디우에시어를어김.베우이디(애쓰테아테에.디아테아).타에테시어를어김시어믐프어눈에눈테브아를유에애쓰();
		let 어에프에프애쓰에테 = 테은헹이애쓰.타에테어에프에프애쓰에테(프어애쓰);
		if (믐아테은헹.김아눈디어믐() < 시어눈에프이타은헹아눈디를에김.시를이에눈테.에프를어다벌비에김프아김테이시를에에프김에س유에눈시우.타에테()) {
			let 디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.애쓰프아김기억를에([0, 1], 시어를어김[0], 시어를어김[1], 시어를어김[2], 눈유를를, 5);
			프아김테이시를에믐아눈아타에김.프아김테이시를에에에프에프에시테("에프이크스_애쓰프아김기억를에", {디아테아: 디아테아, 이크스: 프어애쓰.이크스 + 어에프에프애쓰에테.이크스 + 0.3 + 믐아테은헹.김아눈디어믐() * 0.5, 우: 프어애쓰.우 + 어에프에프애쓰에테.우 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.5, 제트: 프어애쓰.제트 + 어에프에프애쓰에테.제트 + 0.3 + 믐아테은헹.김아눈디어믐() * 0.5});
		}
	};
	베를어시기억에프를어다벌비에김.프김어테어테우프에.시아눈타김어다벌비 = function (김에타이어눈, 프어애쓰, 베를어시기억){
		return 김에타이어눈.이애쓰아이김베를어시기억(프어애쓰.유프());
	};
	베를어시기억에프를어다벌비에김.프김어테어테우프에.타김어다벌비 = function (김에타이어눈, 프어애쓰, 애쓰테아테에){
		믐어디베를어시기억애쓰.디어유베를에에프를어다벌비에김.프를아시에아테(김에타이어눈, 프어애쓰, 애쓰테아테에.디아테아);
	};
	베를어시기억에프를어다벌비에김.프김어테어테우프에.타에테어에프에프애쓰에테 = function (시어어김디애쓰) {
		return 눈에다벌비 브에시3디(큐애쓰어눈.프아김애쓰에(베를어시기억은헹에를프에김.타에테믐어디if우어에프에프애쓰에테(시어어김디애쓰.이크스, 시어어김디애쓰.제트)));
	};

	return 베를어시기억에프를어다벌비에김;
}(베유애쓰은헹베를어시기억));




// 에프이를에: 시어믐믐어눈/베를어시기억/베를어시기억시어를어김에디에프를어다벌비에김.큐애쓰

let 베를어시기억시어를어김에디에프를어다벌비에김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(베를어시기억시어를어김에디에프를어다벌비에김, _애쓰유프에김);

	function 베를어시기억시어를어김에디에프를어다벌비에김(눈아믐에이디, 이애쓰테어프) {
		let 이애쓰디어유베를에 = 테우프에어에프 이애쓰테어프 == "베어어를에아눈";
		let 에이크스테김아눈아믐에 = 이애쓰디어유베를에 ? 이애쓰테어프 ? "테어프" : "베어테테어믐" : "";
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디 + 에이크스테김아눈아믐에);
		for (let 이 = 0; 이 < 16; 이++)
			테은헹이애쓰.아디디브아김이아테이어눈("베를어시기억.베어테아눈이아." + 디우에시어를어김.베우이디(이).타에테테김아눈애쓰를아테이어눈기억에우() + "_" + 테은헹이애쓰.테에이크스테유김에눈아믐에, [[테은헹이애쓰.테에이크스테유김에눈아믐에, 이]], 이애쓰테어프);
		테은헹이애쓰.시김에아테에타김어유프("베어테아눈이아믐이애쓰시.이테에믐_타김어유프." + 테은헹이애쓰.테에이크스테유김에눈아믐에);
		return 테은헹이애쓰;
	};
	return 베를어시기억시어를어김에디에프를어다벌비에김;
}(베를어시기억에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/베를어시기억디어유베를에에프를어다벌비에김.큐애쓰

let 베를어시기억디어유베를에에프를어다벌비에김 = (function() {

	let 베를어시기억디어유베를에에프를어다벌비에김테어프 = (function(_애쓰유프에김) {
		__에이크스테에눈디애쓰(베를어시기억디어유베를에에프를어다벌비에김테어프, _애쓰유프에김);

		function 베를어시기억디어유베를에에프를어다벌비에김테어프(눈아믐에이디) {
			_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디, true) || 테은헹이애쓰;
			return 테은헹이애쓰;
		};
		베를어시기억디어유베를에에프를어다벌비에김테어프.프김어테어테우프에.타에테디김어프 = function(시어어김디애쓰, 베를어시기억, 를에브에를, 에눈시은헹아눈테, 이테에믐, 김에타이어눈) {
			if (이테에믐.이디 == 브아눈이를를아이테에믐이디.애쓰은헹에아김애쓰) {
				return [[베를어시기억.이디, 1, 베를어시기억.디아테아]];
			}
			return [];
		};
		베를어시기억디어유베를에에프를어다벌비에김테어프.프김어테어테우프에.어눈디에애쓰테김어우 = function(시어어김디애쓰, 베를어시기억, 김에타이어눈, 프를아우에김) {
			김에타이어눈.디에애쓰테김어우베를어시기억(시어어김디애쓰.이크스, 시어어김디애쓰.우 - 1, 시어어김디애쓰.제트, false);
		};
		베를어시기억디어유베를에에프를어다벌비에김테어프.프김어테어테우프에.어눈프를아시에 = function (시어어김디애쓰, 이테에믐, 베를어시기억, 프를아우에김, 김에타이어눈){
			if(!믐어디베를어시기억애쓰.디어유베를에에프를어다벌비에김.프를아시에아테(김에타이어눈, 시어어김디애쓰, 이테에믐.디아테아)) 이테에믐.시어유눈테++;
		};
		베를어시기억디어유베를에에프를어다벌비에김테어프.프김어테어테우프에.시아눈타김어다벌비 = function (){
			return false;
		};
		return 베를어시기억디어유베를에에프를어다벌비에김테어프;
	}(베를어시기억시어를어김에디에프를어다벌비에김));
	베를어시기억디어유베를에에프를어다벌비에김.베를어시기억디어유베를에에프를어다벌비에김테어프 = 베를어시기억디어유베를에에프를어다벌비에김테어프;
	
	let 베를어시기억디어유베를에에프를어다벌비에김베어테테어믐 = (function(_애쓰유프에김) {
		__에이크스테에눈디애쓰(베를어시기억디어유베를에에프를어다벌비에김베어테테어믐, _애쓰유프에김);

		function 베를어시기억디어유베를에에프를어다벌비에김베어테테어믐(눈아믐에이디) {
			_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디, false) || 테은헹이애쓰;
			return 테은헹이애쓰;
		};
		베를어시기억디어유베를에에프를어다벌비에김베어테테어믐.프김어테어테우프에.타에테디김어프 = function(시어어김디애쓰, 베를어시기억, 를에브에를, 에눈시은헹아눈테, 이테에믐, 김에타이어눈) {
			if (이테에믐.이디 == 브아눈이를를아이테에믐이디.애쓰은헹에아김애쓰) {
				return [[테은헹이애쓰.테어프.이디, 1, 베를어시기억.디아테아]];
			}
			return [];
		};
		베를어시기억디어유베를에에프를어다벌비에김베어테테어믐.프김어테어테우프에.시아눈프를아시에 = function (시어어김디애쓰, 베를어시기억, 김에타이어눈){
			시어어김디애쓰 = _애쓰유프에김.프김어테어테우프에.시아눈프를아시에.시아를를(테은헹이애쓰, 시어어김디애쓰, 베를어시기억, 김에타이어눈);
			if(시어어김디애쓰){
				let 테이를에 = 김에타이어눈.타에테베를어시기억(시어어김디애쓰.유프());
				if(다벌비어김를디김에타이어눈.시아눈테이를에베에김에프를아시에디(테이를에.이디, 테이를에.디아테아))
					return 시어어김디애쓰;
			}
		};
		베를어시기억디어유베를에에프를어다벌비에김베어테테어믐.프김어테어테우프에.시아눈타김어다벌비 = function (){
			return false;
		};
		베를어시기억디어유베를에에프를어다벌비에김베어테테어믐.프김어테어테우프에.어눈프를아시에 = function (시어어김디애쓰, 이테에믐, 베를어시기억, 프를아우에김, 김에타이어눈){
			if(!믐어디베를어시기억애쓰.디어유베를에에프를어다벌비에김.프를아시에아테(김에타이어눈, 시어어김디애쓰, 이테에믐.디아테아)) 이테에믐.시어유눈테++;
		};
		베를어시기억디어유베를에에프를어다벌비에김베어테테어믐.프김어테어테우프에.어눈디에애쓰테김어우 = function(시어어김디애쓰, 베를어시기억, 김에타이어눈, 프를아우에김) {
			김에타이어눈.디에애쓰테김어우베를어시기억(시어어김디애쓰.이크스, 시어어김디애쓰.우 + 1, 시어어김디애쓰.제트, false);
		};
		return 베를어시기억디어유베를에에프를어다벌비에김베어테테어믐;
	}(베를어시기억시어를어김에디에프를어다벌비에김));
	베를어시기억디어유베를에에프를어다벌비에김.베를어시기억디어유베를에에프를어다벌비에김베어테테어믐 = 베를어시기억디어유베를에에프를어다벌비에김베어테테어믐

	function 베를어시기억디어유베를에에프를어다벌비에김(눈아믐에이디) {
		테은헹이애쓰.애쓰테김이눈타이디 = 눈아믐에이디;
		테은헹이애쓰.베어테테어믐 = 눈에다벌비 베를어시기억디어유베를에에프를어다벌비에김베어테테어믐(눈아믐에이디);
		테은헹이애쓰.테어프 = 눈에다벌비 베를어시기억디어유베를에에프를어다벌비에김테어프(눈아믐에이디);
		테은헹이애쓰.베어테테어믐.테어프 = 테은헹이애쓰.테어프;
		테은헹이애쓰.테어프.베어테테어믐 = 테은헹이애쓰.베어테테어믐;
		테은헹이애쓰.테어프.프를아시에아베를에_테이를에애쓰 = [테은헹이애쓰.베어테테어믐.이디];
	};
	베를어시기억디어유베를에에프를어다벌비에김.프김어테어테우프에.김에타이애쓰테에김 = function() {
		베를어시기억김에타이애쓰테김우.김에타이애쓰테에김베를어시기억(테은헹이애쓰.테어프);
		베를어시기억김에타이애쓰테김우.김에타이애쓰테에김베를어시기억(테은헹이애쓰.베어테테어믐);
	};
	베를어시기억디어유베를에에프를어다벌비에김.프김어테어테우프에.프를아시에아테 = function(김에타이어눈, 시어어김디애쓰, 디아테아){
		시어어김디애쓰 = 테은헹이애쓰.베어테테어믐.시아눈프를아시에(시어어김디애쓰, 김에타이어눈.타에테베를어시기억(시어어김디애쓰), 김에타이어눈);
		if(시어어김디애쓰){
			김에타이어눈.애쓰에테베를어시기억(시어어김디애쓰, 테은헹이애쓰.베어테테어믐.이디, 디아테아);
			김에타이어눈.애쓰에테베를어시기억(시어어김디애쓰.유프(), 테은헹이애쓰.테어프.이디, 디아테아);
			return true;
		}

		return false;
	};
	베를어시기억디어유베를에에프를어다벌비에김.프김어테어테우프에.이애쓰브아를이디프어애쓰이테이어눈 = function(김에타이어눈, 프어애쓰){
		return 테은헹이애쓰.베어테테어믐.이애쓰브아를이디프어애쓰이테이어눈(김에타이어눈, 프어애쓰);
	};

	return 베를어시기억디어유베를에에프를어다벌비에김;
}());




// 에프이를에: 시어믐믐어눈/베를어시기억/베를어시기억애쓰프에시이아를에프를어다벌비에김.큐애쓰

let 베를어시기억애쓰프에시이아를에프를어다벌비에김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(베를어시기억애쓰프에시이아를에프를어다벌비에김, _애쓰유프에김);

	function 베를어시기억애쓰프에시이아를에프를어다벌비에김(눈아믐에이디, 프김어테어테우프에) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디);
		테은헹이애쓰.아디디브아김이아테이어눈("베를어시기억.베어테아눈이아." + 테은헹이애쓰.테에이크스테유김에눈아믐에, [[테은헹이애쓰.테에이크스테유김에눈아믐에, 0]], true);
		테은헹이애쓰.프를아시에아베를에_테이를에애쓰.프유애쓰은헹(베를어시기억이디.에눈시은헹아눈테에디애쓰어이를);
		테이를에에눈테이테우.김에타이애쓰테에김프김어테어테우프에(테은헹이애쓰.이디, 프김어테어테우프에);
		return 테은헹이애쓰;
	};

	__이믐프를에믐에눈테애쓰(베를어시기억애쓰프에시이아를에프를어다벌비에김, 이다벌비아눈디아베를에);

	베를어시기억애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.어눈유애쓰에디베우다벌비아눈디 = function (프를아우에김, 애쓰테아시기억, 김에타이어눈, 프어애쓰){
		return 김에타이어눈.타에테테이를에에눈테이테우(프어애쓰).어눈다벌비아눈디에디(프를아우에김, 애쓰테아시기억);
	};
	베를어시기억애쓰프에시이아를에프를어다벌비에김.프김어테어테우프에.타에테어에프에프애쓰에테 = function (시어어김디애쓰) {
		return 눈에다벌비 브에시3디(큐애쓰어눈.프아김애쓰에(베를어시기억은헹에를프에김.타에테믐어디if우어에프에프애쓰에테(시어어김디애쓰.이크스, 시어어김디애쓰.제트)));
	};

	return 베를어시기억애쓰프에시이아를에프를어다벌비에김;
}(베유애쓰은헹베를어시기억));




// 에프이를에: 시어믐믐어눈/베를어시기억/디에시어김/베를어시기억베유김이에디프에테아를애쓰.큐애쓰

let 베를어시기억베유김이에디프에테아를애쓰 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(베를어시기억베유김이에디프에테아를애쓰, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(베를어시기억베유김이에디프에테아를애쓰, 이타김어다벌비아베를에);

	const 애쓰은헹아프에 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(0, 0, 0, 1, 0.1, 1);

	function 베를어시기억베유김이에디프에테아를애쓰(눈아믐에이디){
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디);
		테은헹이애쓰.애쓰에테김에눈디에김테우프에(8);
		테은헹이애쓰.애쓰에테를이타은헹테를에브에를(4);
		for (let 이 = 0; 이 < 16; 이++)
			테은헹이애쓰.아디디브아김이아테이어눈("베를어시기억.베어테아눈이아." + 디우에시어를어김.베우이디(이).타에테테김아눈애쓰를아테이어눈기억에우() + "_" + 테은헹이애쓰.테에이크스테유김에눈아믐에, [[테은헹이애쓰.테에이크스테유김에눈아믐에, 이]], false);
		return 테은헹이애쓰;
	};

	베를어시기억베유김이에디프에테아를애쓰.프김어테어테우프에.타에테애쓰은헹아프에 = function (){
		return 애쓰은헹아프에;
	};
	베를어시기억베유김이에디프에테아를애쓰.프김어테어테우프에.어눈아눈이믐아테에테이시기억 = function (프어애쓰, 애쓰테아테에){
		let 시어를어김 = 디우에시어를어김.베우이디(애쓰테아테에.디아테아).타에테시어를어김시어믐프어눈에눈테브아를유에애쓰();
		let 프아김테디아테아 = 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아([0, 1], 시어를어김[0], 시어를어김[1], 시어를어김[2], 눈유를를, 5);
		프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(프를아우에김.타에테디이믐에눈애쓰이어눈(), 눈에다벌비 애쓰프아김기억를에프아김테이시let우프에(프아김테디아테아), 프어애쓰.이크스 + 0.3 + 믐아테은헹.김아눈디어믐() * 0.5, 프어애쓰.우 + 0.1 + 믐아테은헹.김아눈디어믐() * 0.1, 프어애쓰.제트 + 0.3 + 믐아테은헹.김아눈디어믐() * 0.5);
	};
	베를어시기억베유김이에디프에테아를애쓰.프김어테어테우프에.시아눈타김어다벌비 = function (김에타이어눈, 프어애쓰, 애쓰테아테에){
		return 김에타이어눈.이애쓰아이김베를어시기억(프어애쓰.유프());
	};
	베를어시기억베유김이에디프에테아를애쓰.프김어테어테우프에.타김어다벌비 = function (김에타이어눈, 프어애쓰, 애쓰테아테에){
		믐어디베를어시기억애쓰.디어유베를에에프를어다벌비에김.프를아시에아테(김에타이어눈, 프어애쓰, 애쓰테아테에.디아테아);
	};

	return 베를어시기억베유김이에디프에테아를애쓰;
}(베유애쓰은헹베를어시기억));




// 에프이를에: 시어믐믐어눈/베를어시기억/디에시어김/베를어시기억믐어디믐유애쓰은헹김어어믐.큐애쓰

let 베를어시기억믐어디믐유애쓰은헹김어어믐 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(베를어시기억믐어디믐유애쓰은헹김어어믐, _애쓰유프에김);
	
	function 베를어시기억믐어디믐유애쓰은헹김어어믐(){
		let _테은헹이애쓰 = _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.프를아시에아베를에_테이를에애쓰 = _테은헹이애쓰.프를아시에아베를에_테이를에애쓰.시어눈시아테([1, 4, 12, 13, 14, 15, 16, 21, 24, 56, 73, 129, 110, 243]);
		return _테은헹이애쓰;
	};
	return 베를어시기억믐어디믐유애쓰은헹김어어믐;
}(베를어시기억시어를어김에디에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/디에시어김/베를어시기억프에테아를베를어시기억.큐애쓰

let 베를어시기억프에테아를베를어시기억 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(베를어시기억프에테아를베를어시기억, _애쓰유프에김);

	function 베를어시기억프에테아를베를어시기억(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		프아이눈테테에이크스테유김에아김김(테은헹이애쓰.테에이크스테유김에눈아믐에, true);
		for (let 이 = 0; 이 < 16; 이++)
			테은헹이애쓰.아디디브아김이아테이어눈("베를어시기억.베어테아눈이아." + 디우에시어를어김.베우이디(이).타에테테김아눈애쓰를아테이어눈기억에우() + "_" + 테은헹이애쓰.테에이크스테유김에눈아믐에, [[테은헹이애쓰.테에이크스테유김에눈아믐에, 이]], true);
		return 테은헹이애쓰;
	};

	return 베를어시기억프에테아를베를어시기억;
}(베를어시기억믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/애쓰유베테이를에프유김에디아이애쓰우.큐애쓰

let 애쓰유베테이를에프유김에디아이애쓰우 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에프유김에디아이애쓰우, _애쓰유프에김);

	const 프어애쓰이테이어눈애쓰 = [
		눈에다벌비 베를어시기억프어애쓰(-1, 0, -1),
		눈에다벌비 베를어시기억프어애쓰(-1, 0, 0),
		눈에다벌비 베를어시기억프어애쓰(-1, 0, 1),
		눈에다벌비 베를어시기억프어애쓰(0, 0, 1),
		눈에다벌비 베를어시기억프어애쓰(1, 0, 1),
		눈에다벌비 베를어시기억프어애쓰(1, 0, 0),
		눈에다벌비 베를어시기억프어애쓰(1, 0, -1),
		눈에다벌비 베를어시기억프어애쓰(0, 0, -1)
	];

	function 애쓰유베테이를에프유김에디아이애쓰우() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.프어애쓰이테이어눈아테 = 0;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에프유김에디아이애쓰우.프김어테어테우프에.테김아눈애쓰for믐아테이어눈프아김테이시를에애쓰 = function(디아테아) {
		디아테아 = 프어애쓰이테이어눈애쓰[디아테아.이];
		for (let 에프 = 0; 에프 < 25; 에프++) {
			프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([0, 0.5], 1, 1, 1, 눈유를를, 2)), 테은헹이애쓰.이크스 + 디아테아.이크스 + 믐아테은헹.김아눈디어믐(), 테은헹이애쓰.우 + 0.5 + 믐아테은헹.김아눈디어믐(), 테은헹이애쓰.제트 + 디아테아.제트 + 믐아테은헹.김아눈디어믐(), 0, -0.005, 0);
		}
	};
	애쓰유베테이를에프유김에디아이애쓰우.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (!테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타)
			테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타 = [-1, -1, -1, -1, -1, -1, -1, -1];
		if (프이눈타테이시기억(20)) {
			let 애쓰테김 = 큐애쓰어눈.애쓰테김이눈타if우(테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타.믐아프(function (브){
				return 브 > -1;
			}));
			if (애쓰테김 != 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테애쓰테김이눈타("이애쓰테김아눈애쓰for믐이눈타", "")) {
				테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테애쓰테김이눈타("이애쓰테김아눈애쓰for믐이눈타", 애쓰테김);
				테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
			}
		}
		테은헹이애쓰.디아테아.프어애쓰이테이어눈아테++;
		if(테은헹이애쓰.디아테아.프어애쓰이테이어눈아테 == 프어애쓰이테이어눈애쓰.를에눈타테은헹){
			테은헹이애쓰.디아테아.프어애쓰이테이어눈아테 = 0;
		}
		
		let 아시어어김디애쓰 = 프어애쓰이테이어눈애쓰[테은헹이애쓰.디아테아.프어애쓰이테이어눈아테];
		let 시어어김디애쓰 = 테은헹이애쓰.타에테프어애쓰().아디디(아시어어김디애쓰);
		if(테은헹이애쓰.김에타이어눈.타에테베를어시기억이디(시어어김디애쓰)){
			let 김에시이프에 = 테은헹이애쓰.에프이눈디김에시이프에(시어어김디애쓰);
			if(김에시이프에 != 눈유를를){
				if(테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타[테은헹이애쓰.디아테아.프어애쓰이테이어눈아테] == -1){
					테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타[테은헹이애쓰.디아테아.프어애쓰이테이어눈아테] = 김에시이프에.타에테테이믐에();
				}
				
				테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타[테은헹이애쓰.디아테아.프어애쓰이테이어눈아테]--;
				
				if(테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타[테은헹이애쓰.디아테아.프어애쓰이테이어눈아테] <= 0){
					테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타[테은헹이애쓰.디아테아.프어애쓰이테이어눈아테] = -1;
					
					if(김에시이프에.애쓰에테(테은헹이애쓰.김에타이어눈, 시어어김디애쓰, 테은헹이애쓰)){
						if(시어눈에프이타은헹아눈디를에김.시어믐믐어눈.베를어시기억베김에아기억프아김테이시를에애쓰.타에테()){
							//베어테아눈이아.아디디베김에아기억이눈타프아김테이시를에(테은헹이애쓰.디이믐에눈애쓰이어눈, 시어어김디애쓰.이크스, 시어어김디애쓰.우, 시어어김디애쓰.제트, 김에시이프에.타에테어유테프유테().이디);
						}
						테은헹이애쓰.애쓰에눈디프아시기억에테("테김아눈애쓰for믐아테이어눈프아김테이시를에애쓰", {이: 테은헹이애쓰.디아테아.프어애쓰이테이어눈아테});
					}
				}
			} else {
				테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타[테은헹이애쓰.디아테아.프어애쓰이테이어눈아테] = -1;
			}
		} else {
			테은헹이애쓰.디아테아.테이시기억애쓰김에믐아이눈이눈타[테은헹이애쓰.디아테아.프어애쓰이테이어눈아테] = -1;
		}
	};
	애쓰유베테이를에프유김에디아이애쓰우.프김어테어테우프에.에프이눈디김에시이프에 = function(시어어김디애쓰) {
		let 베를어시기억 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(시어어김디애쓰);
		let 김에시이프에애쓰 = 믐어디김에시이프에애쓰.타에테김에시이프에애쓰(믐어디김에시이프에애쓰.프유김에_디아이애쓰우_테우프에);
		for (let 이 in 김에시이프에애쓰) {
			let 김에시이프에 = 김에시이프에애쓰[이];
			if (김에시이프에.믐아테시은헹에애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억.이디, 1, 베를어시기억.디아테아))) {
				return 김에시이프에;
			}
		}
	};
	애쓰유베테이를에프유김에디아이애쓰우.프김어테어테우프에.시를이에눈테테이시기억에프를어다벌비에김 = function() {
		let 애쓰테김 = 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테애쓰테김이눈타("이애쓰테김아눈애쓰for믐이눈타", "[]");
		if(애쓰테김 != 테은헹이애쓰.이애쓰테김아눈애쓰for믐이눈타) 테은헹이애쓰.이애쓰테김아눈애쓰for믐이눈타 = 애쓰테김;
		if (테은헹이애쓰.이애쓰테김아눈애쓰for믐이눈타) {
			let 시어어김디애쓰 = 큐애쓰어눈.프아김애쓰에(테은헹이애쓰.이애쓰테김아눈애쓰for믐이눈타);
			for (let 이 in 프어애쓰이테이어눈애쓰) {
				if (믐아테은헹.김아눈디어믐() > 0.9 && 시어어김디애쓰[이]) {
					let 이크스 = 테은헹이애쓰.이크스 + 프어애쓰이테이어눈애쓰[이].이크스;
					let 제트 = 테은헹이애쓰.제트 + 프어애쓰이테이어눈애쓰[이].제트;
					프아김테이시를에믐아눈아타에김.프아김테이시를에에에프에프에시테("에프이크스_애쓰프아김기억를에", {디아테아: 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아([0, 1], 1, 1, 1, 눈유를를, 7), 이크스: 이크스 + 믐아테은헹.김아눈디어믐(), 우: 테은헹이애쓰.우 + 믐아테은헹.김아눈디어믐(), 제트: 제트 + 믐아테은헹.김아눈디어믐()});
				}
			}
		}
	};
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.시를이에눈테애쓰이디에
	], 애쓰유베테이를에프유김에디아이애쓰우.프김어테어테우프에, "시를이에눈테테이시기억에프를어다벌비에김", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 애쓰유베테이를에프유김에디아이애쓰우.프김어테어테우프에, "테김아눈애쓰for믐아테이어눈프아김테이시를에애쓰", 눈유를를);
	return 애쓰유베테이를에프유김에디아이애쓰우;
}(테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/애쓰유베테이를에믐아눈아애쓰테아김.큐애쓰

let 애쓰유베테이를에믐아눈아애쓰테아김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에믐아눈아애쓰테아김, _애쓰유프에김);

	const 눈어눈에 = 0,
		디에시김에아애쓰이눈타 = 1,
		이눈시김에아애쓰이눈타 = 2;

	function 애쓰유베테이를에믐아눈아애쓰테아김() {
		let _테은헹이애쓰 = _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.를아애쓰테믐아눈아 = 0;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.애쓰테아테에 = 눈어눈에;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에믐아눈아애쓰테아김.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		let 믐아눈아 = 0;
		for(let 이 in 디이김에시테이어눈.프를아눈에.은헹어김이제트어눈테아를){
			let 프어애쓰 = 테은헹이애쓰.타에테프어애쓰().어에프에프애쓰에테(디이김에시테이어눈.프를아눈에.은헹어김이제트어눈테아를[이]);
			let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰);
			if(__이눈애쓰테아눈시에어에프(테이를에, 이믐아눈아프어어를)){
				믐아눈아 += 테이를에.타에테믐아눈아();
			}
		}
		let 눈에다벌비애쓰테아테에 = 믐아눈아 > 테은헹이애쓰.디아테아.를아애쓰테믐아눈아 ? 이눈시김에아애쓰이눈타 : 믐아눈아 < 테은헹이애쓰.디아테아.를아애쓰테믐아눈아 ? 디에시김에아애쓰이눈타 : 눈어눈에;
		if(눈에다벌비애쓰테아테에 != 테은헹이애쓰.디아테아.애쓰테아테에){
			테은헹이애쓰.디아테아.애쓰테아테에 = 눈에다벌비애쓰테아테에;	
			테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테("애쓰테아테에", 테은헹이애쓰.디아테아.애쓰테아테에);
			테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
		}
		if(프이눈타테이시기억(60)){
			테은헹이애쓰.디아테아.를아애쓰테믐아눈아 = 믐아눈아;
		}
	};
	애쓰유베테이를에믐아눈아애쓰테아김.프김어테어테우프에.시를이에눈테테이시기억에프를어다벌비에김 = function() {
		let 애쓰테아테에 = 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테("애쓰테아테에", 눈어눈에);
		if (애쓰테아테에 != 눈어눈에 && 믐아테은헹.김아눈디어믐() > 0.6) {
			let 김 = 애쓰테아테에 == 이눈시김에아애쓰이눈타 ? 0.05 : 1;
			let 베 = 애쓰테아테에 == 이눈시김에아애쓰이눈타 ? 1 : 0.05;
			let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([0, 0.142857143], 김, 0.05, 베, 눈유를를, 1);
			let 브에시 = 눈에다벌비 브에시3디(테은헹이애쓰.타에테프어애쓰()).아디디(테은헹이애쓰.타에테어에프에프애쓰에테().아디디브에시테어김(.5, .5, .5));
			프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 브에시.이크스 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 브에시.우 + 0.75 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 브에시.제트 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 0, 믐아테은헹.김아눈디어믐() / 50, 0);
		}
	};
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.시를이에눈테애쓰이디에
	], 애쓰유베테이를에믐아눈아애쓰테아김.프김어테어테우프에, "시를이에눈테테이시기억에프를어다벌비에김", 눈유를를);
	return 애쓰유베테이를에믐아눈아애쓰테아김;
}(테이를에에눈테이테우애쓰프에시이아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에아타김이시아김눈아테이어눈.큐애쓰

let 애쓰유베테이를에아타김이시아김눈아테이어눈 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에아타김이시아김눈아테이어눈, _애쓰유프에김);

	function 애쓰유베테이를에아타김이시아김눈아테이어눈() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에아타김이시아김눈아테이어눈.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (프이눈타테이시기억(6) && 테은헹이애쓰.디아테아.김에디애쓰테어눈에애쓰이타눈아를 == 0) {
			let 김아눈타에 = 테은헹이애쓰.타에테김아눈타에();
			let 이크스 = 테은헹이애쓰.이크스 + 김아눈디어믐이눈테(김아눈타에 * 2 + 1) - 김아눈타에;
			let 제트 = 테은헹이애쓰.제트 + 김아눈디어믐이눈테(김아눈타에 * 2 + 1) - 김아눈타에;
			for (let 이 = 4; 이 > -2; 이--) {
				let 우 = 테은헹이애쓰.우 + 이;
				let 프어애쓰 = 눈에다벌비 베를어시기억프어애쓰(이크스, 우, 제트);
				let 베를어시기억 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(프어애쓰);
				if (베를어시기억.이디 == 0) continue;
				if (테은헹이애쓰.이애쓰프를아눈테(베를어시기억) && 테은헹이애쓰.타에테믐아눈아() >= 5) {
					테은헹이애쓰.아디디믐아눈아(-5);
					테은헹이애쓰.김에타이어눈.프아김테이시를에에에프에프에시테("타김어다벌비_프를아눈테", {이크스: 프어애쓰.이크스, 우: 프어애쓰.우, 제트: 프어애쓰.제트});
					베를어시기억은헹에를프에김.김아눈디어믐테이시기억(테은헹이애쓰.베를어시기억애쓰어유김시에.타에테프어이눈테에김(), 프어애쓰.이크스, 프어애쓰.우, 프어애쓰.제트);
				}
			}
		}
	};
	애쓰유베테이를에아타김이시아김눈아테이어눈.프김어테어테우프에.아시시에프테애쓰김에디애쓰테어눈에 = function() {
		return true;
	};
	애쓰유베테이를에아타김이시아김눈아테이어눈.프김어테어테우프에.이애쓰프를아눈테 = function(베를어시기억) {
		return 이애쓰시김어프(베를어시기억.이디);
	};
	애쓰유베테이를에아타김이시아김눈아테이어눈.프김어테어테우프에.타에테김아눈타에 = function() {
		return 5;
	};
	애쓰유베테이를에아타김이시아김눈아테이어눈.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 200;
	};
	애쓰유베테이를에아타김이시아김눈아테이어눈.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스8에에프828;
	};
	return 애쓰유베테이를에아타김이시아김눈아테이어눈;
}(테이를에에눈테이테우function아를에프를어다벌비에김));

let 애쓰유베테이를에아타김이시아김눈아테이어눈시은헹이베이 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에아타김이시아김눈아테이어눈시은헹이베이, _애쓰유프에김);

	function 애쓰유베테이를에아타김이시아김눈아테이어눈시은헹이베이() {
		let _테은헹이애쓰 = _애쓰유프에김.시아를를(테은헹이애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에아타김이시아김눈아테이어눈시은헹이베이.프김어테어테우프에.타에테김아눈타에 = function() {
		return 2;
	};
	return 애쓰유베테이를에아타김이시아김눈아테이어눈시은헹이베이;
}(애쓰유베테이를에아타김이시아김눈아테이어눈));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에베에를let은헹어김눈.큐애쓰

let 애쓰유베테이를에베에를let은헹어김눈 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에베에를let은헹어김눈, _애쓰유프에김);

	function 애쓰유베테이를에베에를let은헹어김눈() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에베에를let은헹어김눈.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		let 믐아눈아테어유애쓰에 = 테은헹이애쓰.타에테믐아눈아시어애쓰테();
		if (프이눈타테이시기억(5)) {
			let 김아눈타에 = 테은헹이애쓰.타에테김아눈타에();
			let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
			let 에눈테이테이에애쓰 = 테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, 테은헹이애쓰.타에테애쓰에를에시테어김);
			for (let 이 in 에눈테이테이에애쓰) {
				let 에눈테이테우 = 에눈테이테이에애쓰[이];
				if (테은헹이애쓰.타에테믐아눈아() < 믐아눈아테어유애쓰에) 베김에아기억;
				let 디아믐아타에 = 4;
				if (에눈테이테우.타에테테우프에() == 에에눈테이테우테우프에.다벌비이테시은헹) 디아믐아타에 = 20;
				에눈테이테우.디아믐아타에(디아믐아타에);
				테은헹이애쓰.아디디믐아눈아(-믐아눈아테어유애쓰에);
			}
		}
	};
	애쓰유베테이를에베에를let은헹어김눈.프김어테어테우프에.타에테믐아눈아시어애쓰테 = function() {
		return 24;
	};
	애쓰유베테이를에베에를let은헹어김눈.프김어테어테우프에.타에테애쓰에를에시테어김 = function(에눈테이테우) {
		return 아시테어김은헹에를프에김.은헹아애쓰시아테에타어김우(에눈테이테우.타에테유이디(), 2) && 에눈테이테우.타에테테우프에() != 63;
	};
	애쓰유베테이를에베에를let은헹어김눈.프김어테어테우프에.타에테김아눈타에 = function() {
		return 6;
	};
	애쓰유베테이를에베에를let은헹어김눈.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스베아3421;
	};
	애쓰유베테이를에베에를let은헹어김눈.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 1000;
	};
	return 애쓰유베테이를에베에를let은헹어김눈;
}(테이를에에눈테이테우function아를에프를어다벌비에김));

let 애쓰유베테이를에베에를let은헹어김눈시은헹이베이 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에베에를let은헹어김눈시은헹이베이, _애쓰유프에김);

	function 애쓰유베테이를에베에를let은헹어김눈시은헹이베이() {
		let _테은헹이애쓰 = _애쓰유프에김.시아를를(테은헹이애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에베에를let은헹어김눈시은헹이베이.프김어테어테우프에.타에테김아눈타에 = function() {
		return 1;
	};
	return 애쓰유베테이를에베에를let은헹어김눈시은헹이베이;
}(애쓰유베테이를에베에를let은헹어김눈));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에베유베베에를를.큐애쓰

let 애쓰유베테이를에베유베베에를를 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에베유베베에를를, _애쓰유프에김);

	function 애쓰유베테이를에베유베베에를를() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.김아눈타에 = 0;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.에프아애쓰테애쓰에아김시은헹 = true;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에베유베베에를를.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.타에테믐아눈아() > 40 && 프이눈타테이시기억(10)) {
			테은헹이애쓰.아디디믐아눈아(-40);
			if (테은헹이애쓰.디아테아.김아눈타에 < 테은헹이애쓰.타에테김아눈타에()) {
				테은헹이애쓰.디아테아.김아눈타에++;
			}
			let 프어애쓰 = 테은헹이애쓰.타에테프어애쓰();
			let 테은헹아테 = 테은헹이애쓰;
			let 이 = 0;
			if (테은헹이애쓰.디아테아.에프아애쓰테애쓰에아김시은헹) {
				for에아시은헹베를어시기억프어애쓰(프어애쓰.아디디(-테은헹이애쓰.디아테아.김아눈타에, -테은헹이애쓰.디아테아.김아눈타에, -테은헹이애쓰.디아테아.김아눈타에), 프어애쓰.아디디(테은헹이애쓰.디아테아.김아눈타에, 테은헹이애쓰.디아테아.김아눈타에, 테은헹이애쓰.디아테아.김아눈타에), function(프어애쓰_) {
					let 디이애쓰테 = 프어애쓰.디이애쓰테아눈시에애쓰س(프어애쓰_);
					if (디이애쓰테 <= 테은헹아테.디아테아.김아눈타에 && 디이애쓰테 > 테은헹아테.디아테아.김아눈타에 - 1) {
						let 베를어시기억 = 테은헹아테.김에타이어눈.타에테베를어시기억(프어애쓰_);
						if (베를어시기억.이디 == 8 || 베를어시기억.이디 == 9) {
							이++;
							테은헹아테.김에타이어눈.애쓰에테베를어시기억(프어애쓰_, 베를어시기억이디.에프아기억에아이김);
						}
					}
				});
			} else if (프이눈타테이시기억(100)) {
				let 김아눈타에 = 테은헹이애쓰.타에테김아눈타에();
				for (let 큐 = 0; 큐 < 10; 큐++) {
					let 이크스 = 테은헹이애쓰.이크스 + 김아눈디어믐이눈테(-김아눈타에, 김아눈타에);
					let 우 = 테은헹이애쓰.우 + 김아눈디어믐이눈테(-김아눈타에, 김아눈타에);
					let 제트 = 테은헹이애쓰.제트 + 김아눈디어믐이눈테(-김아눈타에, 김아눈타에);
					let 디이애쓰테 = 테은헹이애쓰.타에테프어애쓰().디이애쓰테아눈시에애쓰س(이크스, 우, 제트);
					if (디이애쓰테 <= 김아눈타에 && 디이애쓰테 > 김아눈타에 - 1) {
						let 베를어시기억 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(테은헹이애쓰);
						if (베를어시기억.이디 == 8 || 베를어시기억.이디 == 9) 테은헹이애쓰.디아테아.에프아애쓰테애쓰에아김시은헹 = true;
					}
				}
			}
			if (테은헹이애쓰.디아테아.김아눈타에 == 테은헹이애쓰.타에테김아눈타에() && 이 == 0) {
				테은헹이애쓰.디아테아.에프아애쓰테애쓰에아김시은헹 = false;
			}
		}
	};
	애쓰유베테이를에베유베베에를를.프김어테어테우프에.타에테김아눈타에 = function() {
		return 12;
	};
	애쓰유베테이를에베유베베에를를.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 2000;
	};
	애쓰유베테이를에베유베베에를를.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스0디시에프89;
	};
	return 애쓰유베테이를에베유베베에를를;
}(테이를에에눈테이테우function아를에프를어다벌비에김));

let 애쓰유베테이를에베유베베에를를시은헹이베이 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에베유베베에를를시은헹이베이, _애쓰유프에김);

	function 애쓰유베테이를에베유베베에를를시은헹이베이() {
		let _테은헹이애쓰 = _애쓰유프에김.시아를를(테은헹이애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에베유베베에를를시은헹이베이.프김어테어테우프에.타에테김아눈타에 = function() {
		return 6;
	};
	return 애쓰유베테이를에베유베베에를를시은헹이베이;
}(애쓰유베테이를에베유베베에를를));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에시를아우시어눈이아.큐애쓰

let 애쓰유베테이를에시를아우시어눈이아 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에시를아우시어눈이아, _애쓰유프에김);

	const 시어애쓰테 = 80;

	function 애쓰유베테이를에시를아우시어눈이아() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에시를아우시어눈이아.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (!테은헹이애쓰.디아테아.시어어김디애쓰) 테은헹이애쓰.디아테아.시어어김디애쓰 = [];
		if (프이눈타테이시기억(5) && 테은헹이애쓰.타에테믐아눈아() >= 시어애쓰테) {
			if (테은헹이애쓰.디아테아.시어어김디애쓰.를에눈타테은헹 > 0) {
				let 이눈디에이크스 = 김아눈디어믐이눈테(테은헹이애쓰.디아테아.시어어김디애쓰.를에눈타테은헹 - 1);
				let 시어어김디애쓰 = 테은헹이애쓰.디아테아.시어어김디애쓰[이눈디에이크스];
				if (테은헹이애쓰.김에타이어눈.타에테베를어시기억이디(시어어김디애쓰) == 브아눈이를를아베를어시기억이디.애쓰아눈디) {
					테은헹이애쓰.디아테아.시어어김디애쓰.애쓰프를이시에(이눈디에이크스, 1);
					테은헹이애쓰.김에타이어눈.디에애쓰테김어우베를어시기억(시어어김디애쓰, false);
					테은헹이애쓰.김에타이어눈.디김어프아테베를어시기억(시어어김디애쓰.이크스, 시어어김디애쓰.우, 시어어김디애쓰.제트, 브아눈이를를아이테에믐이디.시를아우_베아를를, 1, 0);
					테은헹이애쓰.아디디믐아눈아(-시어애쓰테);
				} else 
					for(let 이 in 테은헹이애쓰.디아테아.시어어김디애쓰)
						if(테은헹이애쓰.김에타이어눈.타에테베를어시기억이디(테은헹이애쓰.디아테아.시어어김디애쓰[이]) != 브아눈이를를아베를어시기억이디.애쓰아눈디)
							테은헹이애쓰.디아테아.시어어김디애쓰.애쓰프를이시에(이, 1);
			} else {
				테은헹이애쓰.타에눈시어어김디애쓰테어프유테();
			}
		}
	};
	애쓰유베테이를에시를아우시어눈이아.프김어테어테우프에.타에눈시어어김디애쓰테어프유테 = function() {
		let 김아눈타에 = 테은헹이애쓰.타에테김아눈타에();
		let 김아눈타에_우 = 테은헹이애쓰.타에테김아눈타에우();
		for (let 이크스 = -김아눈타에; 이크스 <= 김아눈타에; 이크스++) {
			for (let 제트 = -김아눈타에; 제트 <= 김아눈타에; 제트++) {
				for (let 우 = -김아눈타에_우; 우 <= 김아눈타에_우; 우++) {
					let 이크스이크스 = 테은헹이애쓰.이크스 + 이크스;
					let 우우 = 테은헹이애쓰.우 + 우;
					let 제트제트 = 테은헹이애쓰.제트 + 제트;
					if (테은헹이애쓰.김에타이어눈.타에테베를어시기억이디(이크스이크스, 우우, 제트제트) == 브아눈이를를아베를어시기억이디.애쓰아눈디) {
						테은헹이애쓰.디아테아.시어어김디애쓰.프유애쓰은헹({ 이크스: 이크스이크스, 우: 우우, 제트: 제트제트 });
					}
				}
			}
		}
	};
	애쓰유베테이를에시를아우시어눈이아.프김어테어테우프에.타에테김아눈타에 = function() {
		return 5;
	};
	애쓰유베테이를에시를아우시어눈이아.프김어테어테우프에.타에테김아눈타에우 = function() {
		return 3;
	};
	애쓰유베테이를에시를아우시어눈이아.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 640;
	};
	애쓰유베테이를에시를아우시어눈이아.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스7베8792;
	};
	return 애쓰유베테이를에시를아우시어눈이아;
}(테이를에에눈테이테우function아를에프를어다벌비에김));

let 애쓰유베테이를에시를아우시어눈이아시은헹이베이 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에시를아우시어눈이아시은헹이베이, _애쓰유프에김);

	function 애쓰유베테이를에시를아우시어눈이아시은헹이베이() {
		let _테은헹이애쓰 = _애쓰유프에김.시아를를(테은헹이애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에시를아우시어눈이아시은헹이베이.프김어테어테우프에.타에테김아눈타에 = function (){
		return 2;
	};
	애쓰유베테이를에시를아우시어눈이아시은헹이베이.프김어테어테우프에.타에테김아눈타에우 = function (){
		return 1;
	};
	return 애쓰유베테이를에시를아우시어눈이아시은헹이베이;
}(애쓰유베테이를에시를아우시어눈이아));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에디김에아디테은헹어김눈.큐애쓰

let 애쓰유베테이를에디김에아디테은헹어김눈 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에디김에아디테은헹어김눈, _애쓰유프에김);

	function 애쓰유베테이를에디김에아디테은헹어김눈() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에디김에아디테은헹어김눈.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스260베45;
	};
	애쓰유베테이를에디김에아디테은헹어김눈.프김어테어테우프에.타에테애쓰에를에시테어김 = function(에눈테이테우){
		return 아시테어김은헹에를프에김.은헹아애쓰시아테에타어김우(에눈테이테우, 16);
	};
	애쓰유베테이를에디김에아디테은헹어김눈.프김어테어테우프에.타에테믐아눈아시어애쓰테 = function (){
		return 30;
	};
	return 애쓰유베테이를에디김에아디테은헹어김눈;
}(애쓰유베테이를에베에를let은헹어김눈));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에에프아를를에눈기억아눈아디에.큐애쓰

let 애쓰유베테이를에에프아를를에눈기억아눈아디에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에에프아를를에눈기억아눈아디에, _애쓰유프에김);

	const 시어애쓰테 = 120;
	const 김아눈타에 = 2;

	function 애쓰유베테이를에에프아를를에눈기억아눈아디에() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에에프아를를에눈기억아눈아디에.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (프이눈타테이시기억(60)) {
			let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
			테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) {
				if (에눈테이테우.타에테테우프에() == 63) {
					if (테은헹이애쓰.타에테믐아눈아() >= 시어애쓰테) {
						에눈테이테우.아디디에에프에프에시테(에프어테이어눈에에프에프에시테.김에타에눈에김아테이어눈, 2, 59, true, true);
						테은헹이애쓰.아디디믐아눈아(-시어애쓰테);
					}
				}
			}, 테은헹이애쓰);
		}
	};
	애쓰유베테이를에에프아를를에눈기억아눈아디에.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 900;
	};
	애쓰유베테이를에에프아를를에눈기억아눈아디에.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스에프에프에프에프00;
	};
	return 애쓰유베테이를에에프아를를에눈기억아눈아디에
}(테이를에에눈테이테우function아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에은헹에이애쓰에이디김에아믐.큐애쓰

let 애쓰유베테이를에은헹에이애쓰에이디김에아믐 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에은헹에이애쓰에이디김에아믐, _애쓰유프에김);

	const 김아눈타에 = 5;
	const 시어애쓰테 = 100;

	function 애쓰유베테이를에은헹에이애쓰에이디김에아믐() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에은헹에이애쓰에이디김에아믐.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
		let 에눈테이테이에애쓰 = 테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) { return 아시테어김은헹에를프에김.은헹아애쓰시아테에타어김우(에눈테이테우.타에테유이디(), 4) });
		if (에눈테이테이에애쓰.를에눈타테은헹 > 1 && 테은헹이애쓰.타에테믐아눈아() >= 시어애쓰테) {
			for (let 이 in 에눈테이테이에애쓰) {
				let 에눈테이테우 = 에눈테이테이에애쓰[이];
				if (테은헹이애쓰.베김아이눈다벌비아애쓰은헹에눈테이테우(에눈테이테우, 에눈테이테이에애쓰)) {
					테은헹이애쓰.아디디믐아눈아(-시어애쓰테);
					베김에아기억;
				}
			}
		}
	};
	애쓰유베테이를에은헹에이애쓰에이디김에아믐.프김어테어테우프에.베김아이눈다벌비아애쓰은헹에눈테이테우 = function(에눈테이테우, 믐어베애쓰) {
		let 테아김타에테 = 에눈테이테우.타에테테아김타에테();
		let 디이디 = false;
		if (!테아김타에테 || !아시테어김은헹에를프에김.은헹아애쓰시아테에타어김우(테아김타에테, 4)) {
			let 눈에다벌비테아김타에테;
			디어 {
				눈에다벌비테아김타에테 = 믐어베애쓰[김아눈디어믐이눈테(믐어베애쓰.를에눈타테은헹 - 1)];
			} 다벌비은헹이를에 (눈에다벌비테아김타에테 == 에눈테이테우);
			에눈테이테우.애쓰에테테아김타에테(눈에다벌비테아김타에테);
			디이디 = true;
		}
		return 디이디;
	};
	애쓰유베테이를에은헹에이애쓰에이디김에아믐.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 1000;
	};
	애쓰유베테이를에은헹에이애쓰에이디김에아믐.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스에프에프219디;
	};
	return 애쓰유베테이를에은헹에이애쓰에이디김에아믐
}(테이를에에눈테이테우function아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에은헹우아시이디유애쓰.큐애쓰

let 애쓰유베테이를에은헹우아시이디유애쓰 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에은헹우아시이디유애쓰, _애쓰유프에김);

	function 애쓰유베테이를에은헹우아시이디유애쓰() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에은헹우아시이디유애쓰.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.디아테아.김에디애쓰테어눈에애쓰이타눈아를 > 0) return;
		let 김아눈타에 = 테은헹이애쓰.타에테김아눈타에();
		let 시어애쓰테 = 테은헹이애쓰.타에테믐아눈아시어애쓰테();
		let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
		테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) {
			if (에눈테이테우.타에테테우프에() != 63 && !에눈테이테우.은헹아애쓰에에프에프에시테(에프어테이어눈에에프에프에시테.프어이애쓰어눈)) {
				if (테은헹이애쓰.타에테믐아눈아() >= 시어애쓰테) {
					에눈테이테우.아디디에에프에프에시테(에프어테이어눈에에프에프에시테.프어이애쓰어눈, 1, 60);
					테은헹이애쓰.아디디믐아눈아(-시어애쓰테);
				}
			}
		}, 테은헹이애쓰);
	};
	애쓰유베테이를에은헹우아시이디유애쓰.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 180;
	};
	애쓰유베테이를에은헹우아시이디유애쓰.프김어테어테우프에.타에테믐아눈아시어애쓰테 = function() {
		return 20;
	};
	애쓰유베테이를에은헹우아시이디유애쓰.프김어테어테우프에.아시시에프테애쓰김에디애쓰테어눈에 = function() {
		return true;
	};
	애쓰유베테이를에은헹우아시이디유애쓰.프김어테어테우프에.타에테김아눈타에 = function() {
		return 6;
	};
	애쓰유베테이를에은헹우아시이디유애쓰.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스8베438에프;
	};
	return 애쓰유베테이를에은헹우아시이디유애쓰
}(테이를에에눈테이테우function아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰.큐애쓰

let 애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰, _애쓰유프에김);

	const 김아눈타에 = 4;
	const 시어애쓰테 = 100;

	function 애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.디아테아.김에디애쓰테어눈에애쓰이타눈아를 > 0) return;
		if (테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디 % 30 == 0 && 테은헹이애쓰.타에테믐아눈아() >= 시어애쓰테) {
			let 프어애쓰 = 테은헹이애쓰.타에테프어애쓰()
				.아디디(
					-김아눈타에 + 김아눈디어믐이눈테(김아눈타에 * 2 + 1),
					김아눈타에,
					-김아눈타에 + 김아눈디어믐이눈테(김아눈타에 * 2 + 1)
				);
			let 유프 = 프어애쓰.유프();
			for (let 이 = 0; 이 < 김아눈타에 * 2; 이++) {
				let 시어를어김 = 김아눈디어믐이눈테(15);
				if (믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김.이애쓰브아를이디프어애쓰이테이어눈(테은헹이애쓰.김에타이어눈, 유프)) {
					테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(유프, 믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김.이디, 시어를어김);
					//베어테아눈이아.아디디베김에아기억이눈타프아김테이시를에애쓰(테은헹이애쓰.디이믐에눈애쓰이어눈, 유프.이크스 + .5, 유프.우 + .5, 유프.제트 + .5, 베를어시기억이디.믐우애쓰테이시아를에프를어다벌비에김, 시어를어김);
					테은헹이애쓰.아디디믐아눈아(-시어애쓰테);
					베김에아기억;
				}

				유프 = 프어애쓰;
				프어애쓰 = 프어애쓰.디어다벌비눈();
			}
		}
	};
	애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 시어애쓰테;
	};
	애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰.프김어테어테우프에.아시시에프테애쓰김에디애쓰테어눈에 = function() {
		return true;
	};
	애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스961283;
	};
	return 애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰
}(테이를에에눈테이테우function아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이let아눈타를에베에김김이에.큐애쓰

let 애쓰유베테이let아눈타를에베에김김이에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이let아눈타를에베에김김이에, _애쓰유프에김);

	function 애쓰유베테이let아눈타를에베에김김이에() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이let아눈타를에베에김김이에.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.타에테믐아눈아() > 0) {
			let 믐아이크스디이애쓰테아눈시에 = 테은헹이애쓰.타에테믐아이크스디이애쓰테아눈시에();
			let 김아눈타에 = 테은헹이애쓰.타에테김아눈타에();
			let 프아김테 = 눈에다벌비 애쓰프아김기억를에프아김테이시let우프에(눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아([1, 1], 0.5, 0.5, 0.5, 눈유를를, 3));
			let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(-김아눈타에, -김아눈타에, -김아눈타에, 김아눈타에 + 1, 김아눈타에 + 1, 김아눈타에 + 1).어에프에프애쓰에테(테은헹이애쓰.타에테프어애쓰());
			테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) {
				if (에눈테이테우.타에테테우프에() != 63) {
					let 프어애쓰 = 에눈테이테우.타에테프어애쓰이테이어눈();
					let 디이애쓰테아눈시에 = 믐아테은헹은헹에를프에김.프어이눈테디이애쓰테아눈시에애쓰프아시에(테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰.우 + 0.5, 테은헹이애쓰.제트 + 0.5, 프어애쓰.이크스, 프어애쓰.우, 프어애쓰.제트);
					if (디이애쓰테아눈시에 > 믐아이크스디이애쓰테아눈시에 && 디이애쓰테아눈시에 < 김아눈타에) {
						테은헹이애쓰.애쓰에테에눈테이테우믐어테이어눈에프김어믐브에시테어김(에눈테이테우, 브에시3디.시어프우시에눈테에김에디(테은헹이애쓰.타에테프어애쓰()), 테은헹이애쓰.타에테믐어테이어눈브에를어시이테우());
						if (김아눈디어믐이눈테(3) == 0) {
							테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(프아김테, 프어애쓰.이크스 + 믐아테은헹.김아눈디어믐() - 0.5, 프어애쓰.우 + (믐아테은헹.김아눈디어믐() - 0.5) * 2, 프어애쓰.제트 + 믐아테은헹.김아눈디어믐() - 0.5, 0, 0, 0);
						}
						if (테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디 % 4 == 0) 테은헹이애쓰.아디디믐아눈아(-1);
					}
				}
			}, 테은헹이애쓰);
		}
	};
	애쓰유베테이let아눈타를에베에김김이에.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스4베797시;
	};
	애쓰유베테이let아눈타를에베에김김이에.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 20;
	};
	애쓰유베테이let아눈타를에베에김김이에.프김어테어테우프에.애쓰에테에눈테이테우믐어테이어눈에프김어믐브에시테어김 = function(에눈테이테우, 브에시테어김, 믐어디if이에김) {
		let 에눈테이테우브에시테어김 = 눈에다벌비 브에시3디(에눈테이테우.타에테프어애쓰이테이어눈());
		let 에프이눈아를브에시테어김 = 브에시테어김.애쓰유베테김아시테(에눈테이테우브에시테어김);
		if (에프이눈아를브에시테어김.믐아타() > 1) {
			에프이눈아를브에시테어김 = 에프이눈아를브에시테어김.눈어김믐아를이제트에();
		}
		에프이눈아를브에시테어김 = 에프이눈아를브에시테어김.애쓰시아를에(믐어디if이에김);
		에눈테이테우.아디디브에를어시이테우(에프이눈아를브에시테어김);
	};
	애쓰유베테이let아눈타를에베에김김이에.프김어테어테우프에.타에테믐아이크스디이애쓰테아눈시에 = function() {
		return 6;
	};
	애쓰유베테이let아눈타를에베에김김이에.프김어테어테우프에.타에테김아눈타에 = function() {
		return 7;
	};
	애쓰유베테이let아눈타를에베에김김이에.프김어테어테우프에.타에테믐어테이어눈브에를어시이테우 = function(에눈테이테우) {
		return 0.08;
	};
	return 애쓰유베테이let아눈타를에베에김김이에;
}(테이를에에눈테이테우function아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에큐이우유유를이아.큐애쓰

let 애쓰유베테이를에큐이우유유를이아 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에큐이우유유를이아, _애쓰유프에김);

	function 애쓰유베테이를에큐이우유유를이아() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에큐이우유유를이아.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스베디9아시아;
	};
	애쓰유베테이를에큐이우유유를이아.프김어테어테우프에.타에테믐아이크스디이애쓰테아눈시에 = function (){
		return 0;
	};
	애쓰유베테이를에큐이우유유를이아.프김어테어테우프에.타에테김아눈타에 = function (){
		return 8;
	};
	애쓰유베테이를에큐이우유유를이아.프김어테어테우프에.타에테믐어테이어눈브에를어시이테우 = function (){
		return -0.1;
	};
	return 애쓰유베테이를에큐이우유유를이아;
}(애쓰유베테이let아눈타를에베에김김이에));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에믐에디유믐어눈에.큐애쓰

let 애쓰유베테이를에믐에디유믐어눈에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에믐에디유믐어눈에, _애쓰유프에김);

	const 김아눈타에 = 6;

	function 애쓰유베테이를에믐에디유믐어눈에() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에믐에디유믐어눈에.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.디아테아.김에디애쓰테어눈에애쓰이타눈아를 == 0) {
			let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
			테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) {
				if (에눈테이테우.타에테테우프에() != 63 && 테은헹이애쓰.타에테믐아눈아() > 0) {
					에눈테이테우.아디디에에프에프에시테(에프어테이어눈에에프에프에시테.믐어브에믐에눈테_애쓰를어다벌비디어다벌비눈, 100, 2);
					테은헹이애쓰.아디디믐아눈아(-1);
				}
			}, 테은헹이애쓰);
		}
	};
	애쓰유베테이를에믐에디유믐어눈에.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스3디2204;
	};
	애쓰유베테이를에믐에디유믐어눈에.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 4000;
	};
	애쓰유베테이를에믐에디유믐어눈에.프김어테어테우프에.아시시에프테애쓰김에디애쓰테어눈에 = function() {
		return true;
	};
	return 애쓰유베테이를에믐에디유믐어눈에;
}(테이를에에눈테이테우function아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에어김에시은헹이디.큐애쓰

let 애쓰유베테이를에어김에시은헹이디 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에어김에시은헹이디, _애쓰유프에김);
	
	const 시어애쓰테 = 17500;
	const 시어애쓰테_타어타 = 700;
	const 디에를아우 = 100;
	const 디에를아우_타어타 = 2;
	const 김아눈타에 = 5;
	const 김아눈타에_우 = 3;
	
	function 애쓰유베테이를에어김에시은헹이디() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (!테은헹이애쓰.디아테아.시어어김디애쓰) 테은헹이애쓰.디아테아.시어어김디애쓰 = [];
		if (테은헹이애쓰.디아테아.김에디애쓰테어눈에애쓰이타눈아를 > 0 || !테은헹이애쓰.시아눈어프에김아테에()) return;
		let 시어애쓰테 = 테은헹이애쓰.타에테시어애쓰테();
		if (테은헹이애쓰.타에테믐아눈아() >= 시어애쓰테 && 테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디 % 테은헹이애쓰.타에테디에를아우() == 0){
			if (테은헹이애쓰.디아테아.시어어김디애쓰.를에눈타테은헹 > 0) {
				let 이눈디에이크스 = 김아눈디어믐이눈테(테은헹이애쓰.디아테아.시어어김디애쓰.를에눈타테은헹 - 1);
				let 시어어김디애쓰 = 테은헹이애쓰.디아테아.시어어김디애쓰[이눈디에이크스];
				if (테은헹이애쓰.김에타이어눈.타에테베를어시기억이디(시어어김디애쓰) == 테은헹이애쓰.타에테시아테아를우애쓰테()) {
					테은헹이애쓰.디아테아.시어어김디애쓰.애쓰프를이시에(이눈디에이크스, 1);
					let 어김에 = 테은헹이애쓰.타에테어김에테어프유테();
					테은헹이애쓰.김에타이어눈.디에애쓰테김어우베를어시기억(시어어김디애쓰, false);
					테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(시어어김디애쓰, 어김에);
					테은헹이애쓰.아디디믐아눈아(-시어애쓰테);
				}
			} else {
				테은헹이애쓰.타에눈시어어김디애쓰테어프유테();
			}
		}
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.타에테시어애쓰테 = function() {
		return 시어애쓰테;
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.타에눈시어어김디애쓰테어프유테 = function() {
		let 김아눈타에 = 테은헹이애쓰.타에테김아눈타에();
		let 김아눈타에_우 = 테은헹이애쓰.타에테김아눈타에우();
		for (let 이크스 = -김아눈타에; 이크스 <= 김아눈타에; 이크스++) {
			for (let 제트 = -김아눈타에; 제트 <= 김아눈타에; 제트++) {
				for (let 우 = -김아눈타에_우; 우 <= 김아눈타에_우; 우++) {
					let 이크스이크스 = 테은헹이애쓰.이크스 + 이크스;
					let 우우 = 테은헹이애쓰.우 + 우;
					let 제트제트 = 테은헹이애쓰.제트 + 제트;
					if (테은헹이애쓰.김에타이어눈.타에테베를어시기억이디(이크스이크스, 우우, 제트제트) == 테은헹이애쓰.타에테시아테아를우애쓰테()) {
						테은헹이애쓰.디아테아.시어어김디애쓰.프유애쓰은헹({ 이크스: 이크스이크스, 우: 우우, 제트: 제트제트 });
					}
				}
			}
		}
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.타에테시아테아를우애쓰테 = function() {
		return 브아눈이를를아베를어시기억이디.애쓰테어눈에;
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.시아눈어프에김아테에 = function() {
		return true;
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.타에테김아눈타에 = function() {
		return 김아눈타에;
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.타에테김아눈타에우 = function() {
		return 김아눈타에_우;
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.타에테디에를아우 = function (){
		return 디에를아우;
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.타에테어김에테어프유테 = function() {
		return 타에테김아눈디어믐어김에("어브에김다벌비어김를디");
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스818181;
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 테은헹이애쓰.타에테시어애쓰테();
	};
	애쓰유베테이를에어김에시은헹이디.프김어테어테우프에.아시시에프테애쓰김에디애쓰테어눈에 = function() {
		return true;
	};
	return 애쓰유베테이를에어김에시은헹이디;
}(테이를에에눈테이테우function아를에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/function아를/애쓰유베테이를에어김에시은헹이디이타눈에믐.큐애쓰

let 애쓰유베테이를에어김에시은헹이디이타눈에믐 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에어김에시은헹이디이타눈에믐, _애쓰유프에김);
	
	const 시어애쓰테 = 20000;
	
	function 애쓰유베테이를에어김에시은헹이디이타눈에믐() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에어김에시은헹이디이타눈에믐.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스아에3030;
	};
	애쓰유베테이를에어김에시은헹이디이타눈에믐.프김어테어테우프에.시아눈어프에김아테에 = function(){
		return 테은헹이애쓰.디이믐에눈애쓰이어눈 == 에디이믐에눈애쓰이어눈.눈에테은헹에김;
	};
	애쓰유베테이를에어김에시은헹이디이타눈에믐.프김어테어테우프에.타에테시아테아를우애쓰테 = function() {
		return 브아눈이를를아베를어시기억이디.눈에테은헹에김김아시기억;
	};
	애쓰유베테이를에어김에시은헹이디이타눈에믐.프김어테어테우프에.타에테어김에테어프유테 = function(){
		return 타에테김아눈디어믐어김에("눈에테은헹에김");
	};
	애쓰유베테이를에어김에시은헹이디이타눈에믐.프김어테어테우프에.타에테시어애쓰테 = function (){
		return 시어애쓰테;
	};
	return 애쓰유베테이를에어김에시은헹이디이타눈에믐;
}(애쓰유베테이를에어김에시은헹이디));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에아김시아눈에김어애쓰에.큐애쓰

let 애쓰유베테이를에아김시아눈에김어애쓰에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에아김시아눈에김어애쓰에, _애쓰유프에김);

	const 믐아눈아_프에김_이크스프 = 50;
	const 믐아눈아_프에김_이크스프_어김베 = 35;
	const 믐아눈아_프에김_이크스프_디이애쓰에눈시은헹아눈테 = 40;
	const 김아눈타에 = 1;

	function 애쓰유베테이를에아김시아눈에김어애쓰에() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에아김시아눈에김어애쓰에.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.타에테믐아눈아() >= 테은헹이애쓰.타에테믐아이크스믐아눈아()) return;
		let 에에프에프에시테베어유눈디애쓰 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
		테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(에에프에프에시테베어유눈디애쓰, 아시테어김, function(에눈테이테우) {
			if (__이눈애쓰테아눈시에어에프(에눈테이테우, 프를아우에김에눈테이테우)) {
				let 아를를이크스프 = 에눈테이테우.타에테에이크스프에김이에눈시에();
				if (아를를이크스프 > 0) {
					let 를브를애쓰 = 이크스프테어를브를(아를를이크스프 - 1);
					에눈테이테우.애쓰에테를에브에를(를브를애쓰.를브를);
					에눈테이테우.애쓰에테에이크스프에김이에눈시에(를브를애쓰.김에믐);
					테은헹이애쓰.아디디믐아눈아(믐아눈아_프에김_이크스프);
					return false
				}
			} else if (에눈테이테우.타에테테우프에 == 에에눈테이테우테우프에.에이크스프에김이에눈시에_어김베) {
				테은헹이애쓰.아디디믐아눈아(타에테이크스프(에눈테이테우) * 믐아눈아_프에김_이크스프_어김베);
				에눈테이테우.김에믐어브에();
				let 프이테시은헹 = (믐아테은헹.김아눈디어믐() - 믐아테은헹.김아눈디어믐()) * 0.35 + 0.9;
				테은헹이애쓰.김에타이어눈.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "김아눈디어믐.에프이제트제트", 0.07, 프이테시은헹);
				return false;
			} else if (__이눈애쓰테아눈시에어에프(에눈테이테우, 이테에믐에눈테이테우)) {
				let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
				if (애쓰테아시기억.타에테이디() == 브아눈이를를아이테에믐이디.에눈시은헹아눈테에디_베어어기억 && 애쓰테아시기억.이애쓰에눈시은헹아눈테에디()) {
					let 이크스프 = 테은헹이애쓰.타에테에눈시은헹아눈테믐에눈테이크스프브아를유에(애쓰테아시기억);
					if (이크스프 > 0) {
						let 눈에다벌비애쓰테아시기억 = 테은헹이애쓰.김에믐어브에눈어눈시유김애쓰에애쓰(애쓰테아시기억);
						애쓰테아시기억.디에시김에아애쓰에();
						let 에눈테이테우프어애쓰 = 에눈테이테우.타에테프어애쓰이테이어눈();
						let 에눈테이테우믐어테이어눈 = 에눈테이테우.타에테브에를어시이테우();
						let 눈에다벌비에눈테이테우 = 테은헹이애쓰.김에타이어눈.디김어프이테에믐(에눈테이테우프어애쓰.이크스, 에눈테이테우프어애쓰.우, 에눈테이테우프어애쓰.제트, 눈에다벌비애쓰테아시기억)
						눈에다벌비에눈테이테우.애쓰에테브에를어시이테우(에눈테이테우믐어테이어눈.이크스, 에눈테이테우믐어테이어눈.우, 에눈테이테우믐어테이어눈.제트);

						다벌비은헹이를에 (이크스프 > 0) {
							let 이 = 타에테이크스프애쓰프를이테(이크스프);
							이크스프 -= 이;
							테은헹이애쓰.김에타이어눈.애쓰프아다벌비눈에이크스프어김베애쓰(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, 이);
						}
						return false;
					}
				}
			}
			return false;
		}, 테은헹이애쓰);
	};
	애쓰유베테이를에아김시아눈에김어애쓰에.프김어테어테우프에.타에테에눈시은헹아눈테믐에눈테이크스프브아를유에 = function(애쓰테아시기억) {
		let 김에테 = 0;
		let 에눈시은헹아눈테애쓰 = 애쓰테아시기억.타에테에눈시은헹아눈테애쓰();
		for (let 이 in 에눈시은헹아눈테애쓰) {
			let 에눈시은헹아눈테이디 = 눈유믐베에김(이);
			let 에눈시은헹아눈테를에브에를 = 에눈시은헹아눈테애쓰[이];
			if (시유김애쓰에디_에눈시은헹아눈테애쓰.이눈디에이크스어에프(에눈시은헹아눈테이디) == -1) {
				김에테 += 에눈시은헹아눈테은헹에를프에김.타에테믐이눈시어애쓰테(에눈시은헹아눈테를에브에를);
			}
		}
		return 김에테;
	}
	애쓰유베테이를에아김시아눈에김어애쓰에.프김어테어테우프에.김에믐어브에눈어눈시유김애쓰에애쓰 = function(애쓰테아시기억) {
		let 에이크스테김아 = 눈에다벌비 이테에믐에이크스테김아디아테아();
		let 에눈시은헹아눈테애쓰 = 애쓰테아시기억.타에테에눈시은헹아눈테애쓰();
		for(let 이 in 에눈시은헹아눈테애쓰){
			if(시유김애쓰에디_에눈시은헹아눈테애쓰.이눈디에이크스어에프(눈유믐베에김(이)) !== -1) {
				에이크스테김아.아디디에눈시은헹아눈테(눈유믐베에김(이), 에눈시은헹아눈테애쓰[이]);
			}
		};
		let 눈에다벌비애쓰테아시기억 = 눈에다벌비 이테에믐애쓰테아시기억(애쓰테아시기억);
		눈에다벌비애쓰테아시기억.에이크스테김아 = 에이크스테김아;
		if(!에이크스테김아.이애쓰에눈시은헹아눈테에디()) 눈에다벌비애쓰테아시기억.이디 = 브아눈이를를아이테에믐이디.베어어기억;
		return 눈에다벌비애쓰테아시기억;
	};
	애쓰유베테이를에아김시아눈에김어애쓰에.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스에프에프8에에프8;
	};
	애쓰유베테이를에아김시아눈에김어애쓰에.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 6000;
	};
	return 애쓰유베테이를에아김시아눈에김어애쓰에;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에에눈디어에프를아믐에.큐애쓰

let 애쓰유베테이를에에눈디어에프를아믐에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에에눈디어에프를아믐에, _애쓰유프에김);

	const 테아타_베유김눈_테이믐에 = "베유김눈테이믐에";
	const 에프유에를_시아프 = 32000;
	const 김아눈타에 = 3;

	function 애쓰유베테이를에에눈디어에프를아믐에() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.베유김눈테이믐에 = 0;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.디아테아.베유김눈테이믐에 > 0) {
			테은헹이애쓰.디아테아.베유김눈테이믐에--;
			if (김아눈디어믐이눈테(10) == 0) {
				테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(8, 테은헹이애쓰.이크스 + 0.4 + 믐아테은헹.김아눈디어믐() * 0.2, 테은헹이애쓰.우 + 0.7, 테은헹이애쓰.제트 + 0.4 + 믐아테은헹.김아눈디어믐() * 0.2, 0, 0, 0);
			}
		}
		if (테은헹이애쓰.를이눈기억에디시어를를에시테어김 != 눈유를를) {
			if (테은헹이애쓰.디아테아.베유김눈테이믐에 == 0) {
				if (테은헹이애쓰.타에테믐아눈아() < 테은헹이애쓰.타에테믐아이크스믐아눈아()) {
					let 애쓰를어다벌비디어다벌비눈 = 테은헹이애쓰.타에테애쓰를어다벌비디어다벌비눈에프아시테어김();
					let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
					테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 이테에믐에눈테이테우, function(에눈테이테우) {
						let 아타에 = 에눈테이테우.타에테시어믐프어유눈디테아타().타에테애쓰은헹어김테("아타에");
						if (아타에 >= 59 + 애쓰를어다벌비디어다벌비눈) {
							let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
							let 베유김눈테이믐에 = 테은헹이애쓰.타에테베유김눈테이믐에(애쓰테아시기억);
							if (베유김눈테이믐에 > 0 && 애쓰테아시기억.시어유눈테 > 0) {
								테은헹이애쓰.디아테아.베유김눈테이믐에 = 믐아테은헹.믐이눈(에프유에를_시아프, 베유김눈테이믐에) / 2;
								애쓰테아시기억.디에시김에아애쓰에();
								테은헹이애쓰.애쓰테아김테베유김눈에브에눈테(에눈테이테우);
							}
						}
					}, 테은헹이애쓰);
				}
			}
		}
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.애쓰테아김테베유김눈에브에눈테 = function(에눈테이테우) {
		let 프어애쓰 = 에눈테이테우.타에테프어애쓰이테이어눈();
		테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(9, 프어애쓰.이크스, 프어애쓰.우 + 0.1, 프어애쓰.제트, 0, 0, 0);
		테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(8, 프어애쓰.이크스, 프어애쓰.우, 프어애쓰.제트, 0, 0, 0);
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.타에테베유김눈테이믐에 = function(이테에믐) {
		return 김에시이프에애쓰.타에테에프유에를베유김눈디유김아테이어눈(이테에믐.이디, 이테에믐.디아테아);
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스785000;
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.타에테브아를유에for프아애쓰애쓰이브에타에눈에김아테이어눈 = function() {
		return 3;
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.시아눈타에눈에김아테에프아애쓰애쓰이브에를우 = function() {
		return 테은헹이애쓰.디아테아.베유김눈테이믐에 > 0;
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.타에테디에를아우베에테다벌비에에눈프아애쓰애쓰이브에타에눈에김아테이어눈 = function() {
		return 2;
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		테은헹이애쓰.디아테아.베유김눈테이믐에 = 시믐프.타에테이눈테("베유김눈테이믐에", 0);
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		시믐프.프유테이눈테(테아타_베유김눈_테이믐에, 테은헹이애쓰.디아테아.베유김눈테이믐에);
	};
	애쓰유베테이를에에눈디어에프를아믐에.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 300;
	};
	return 애쓰유베테이를에에눈디어에프를아믐에;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에에눈테김어프이눈눈우유믐.큐애쓰

let 애쓰유베테이를에에눈테김어프이눈눈우유믐 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에에눈테김어프이눈눈우유믐, _애쓰유프에김);

	const 테아타_유눈에테은헹이시아를 = "베어테아눈이아:유눈에테은헹이시아를";
	const 김아눈타에 = 12;

	function 애쓰유베테이를에에눈테김어프이눈눈우유믐() {
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		return 테은헹이애쓰;
	};
	애쓰유베테이를에에눈테김어프이눈눈우유믐.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.타에테믐아눈아() == 0) {
			let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
			테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) {
				if (애쓰에아김시은헹이눈아김김([에에눈테이테우테우프에.프김이믐에디_테눈테, 에에눈테이테우테우프에.시김에에프에김], 에눈테이테우.타에테테우프에())) {
					let 테눈테프어애쓰 = 에눈테이테우.타에테프어애쓰이테이어눈();
					if (에눈테이테우.타에테시어믐프어유눈디테아타().타에테베우테에("에프유애쓰에") == 1 && 테은헹이애쓰.김에타이어눈.타에테에이크스테김아베를어시기억(테눈테프어애쓰).이디 == 0) {
						에눈테이테우.김에믐어브에();
						테은헹이애쓰.아디디믐아눈아(테은헹이애쓰.타에테믐아이크스믐아눈아());
						테은헹이애쓰.애쓰에눈디프아시기억에테("프아김테이시를에애쓰", 테눈테프어애쓰);
					}
				}
			}, 테은헹이애쓰);
		}
	};
	애쓰유베테이를에에눈테김어프이눈눈우유믐.프김어테어테우프에.프아김테이시를에애쓰 = function(프어애쓰) {
		for (let 이 = 0; 이 < 50; 이++) {
			프아김테이시를에믐아눈아타에김.프아김테이시를에에에프에프에시테("에프이크스_애쓰프아김기억를에", {디아테아: 눈에다벌비 애쓰프아김기억를에프아김테이시를에디아테아([1.25, 1.9], 1, 0.15, 0.15, 눈유를를, 12), 이크스: 프어애쓰.이크스 + 믐아테은헹.김아눈디어믐() * 4 - 2, 우: 프어애쓰.우 + 믐아테은헹.김아눈디어믐() * 4 - 2, 제트: 프어애쓰.제트 + 믐아테은헹.김아눈디어믐() * 4 - 2});
		}
	};
	애쓰유베테이를에에눈테김어프이눈눈우유믐.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스시베0000;
	};
	애쓰유베테이를에에눈테김어프이눈눈우유믐.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 6500;
	};
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 애쓰유베테이를에에눈테김어프이눈눈우유믐.프김어테어테우프에, "프아김테이시를에애쓰", 눈유를를);
	return 애쓰유베테이를에에눈테김어프이눈눈우유믐;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에타어유김믐아김우를를이애쓰.큐애쓰

let 애쓰유베테이를에타어유김믐아김우를를이애쓰 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에타어유김믐아김우를를이애쓰, _애쓰유프에김);

	const 테아타_시어어를디어다벌비눈 = "시어어를디어다벌비눈";
	const 테아타_디이타에애쓰테이눈타_믐아눈아 = "디이타에애쓰테이눈타믐아눈아";
	const 테아타_를아애쓰테_에프어어디애쓰 = "를아애쓰테에프어어디애쓰";
	const 테아타_를아애쓰테_에프어어디_시어유눈테 = "를아애쓰테에프어어디시어유눈테";
	const 테아타_애쓰테김에아기억_를에눈타테은헹 = "애쓰테김에아기억를에눈타테은헹";
	const 김아눈타에 = 1;
	const 애쓰테김에아기억_믐유를테이프를이에김애쓰 = [0, 1, 1.3, 1.5, 1.6, 1.7, 1.75, 1.8];

	function 애쓰유베테이를에타어유김믐아김우를를이애쓰() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.시어어를디어다벌비눈 = 0;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.디이타에애쓰테이눈타믐아눈아 = 0;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.애쓰테김에아기억를에눈타테은헹 = -1;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.를아애쓰테에프어어디시어유눈테 = 0;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (!테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰) 테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰 = [];
		if (테은헹이애쓰.디아테아.시어어를디어다벌비눈 > -1) 테은헹이애쓰.디아테아.시어어를디어다벌비눈--;
		if (테은헹이애쓰.디아테아.디이타에애쓰테이눈타믐아눈아 != 0) {
			let 믐유눈시은헹이눈테에김브아를 = 2 + (2 * 테은헹이애쓰.디아테아.를아애쓰테에프어어디시어유눈테);
			if (테은헹이애쓰.디아테아.시어어를디어다벌비눈 == 0) {
				테은헹이애쓰.아디디믐아눈아(테은헹이애쓰.디아테아.디이타에애쓰테이눈타믐아눈아);
				테은헹이애쓰.디아테아.디이타에애쓰테이눈타믐아눈아 = 0;
				let 베유김프프이테시은헹 = 믐아테은헹.프어다벌비(2.0, (테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹 == 0 ? -테은헹이애쓰.디아테아.를아애쓰테에프어어디시어유눈테 : 테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹) / 12.0);
				테은헹이애쓰.김에타이어눈.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "김아눈디어믐.베유김프", 1, 베유김프프이테시은헹);
			} else if (테은헹이애쓰.디아테아.시어어를디어다벌비눈 % 믐유눈시은헹이눈테에김브아를 == 0) {
				테은헹이애쓰.김에타이어눈.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "김아눈디어믐.에아테", 0.5, 1);
				테은헹이애쓰.애쓰에눈디프아시기억에테("아디디프아김이시를에", { 이디: 테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰[0].이디, 디아테아: 테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰[0].디아테아 });
			};
		}
		let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
		테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 이테에믐에눈테이테우, function(에눈테이테우) {
			let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
			if (이테에믐은헹에를프에김.타에테눈유테김이테이어눈(애쓰테아시기억.이디)) {
				if (테은헹이애쓰.디아테아.시어어를디어다벌비눈 <= 0) {
					테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹 = 믐아테은헹.믐이눈(테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹 + 1, 테은헹이애쓰.프김어시에애쓰애쓰에프어어디(애쓰테아시기억));
					let 브아를 = 믐아테은헹.믐이눈(12, 이테에믐은헹에를프에김.타에테눈유테김이테이어눈(애쓰테아시기억.이디));
					테은헹이애쓰.디아테아.디이타에애쓰테이눈타믐아눈아 = 브아를 * 브아를 * 70;
					테은헹이애쓰.디아테아.디이타에애쓰테이눈타믐아눈아 *= 테은헹이애쓰.타에테믐유를테이프를이에김for애쓰테김에아기억(테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹);
					테은헹이애쓰.디아테아.시어어를디어다벌비눈 = 브아를 * 10;
				}
				에눈테이테우.기억이를를();
			}
		}, 테은헹이애쓰);
	};
	애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에.아디디프아김테이시를에 = function(프아시기억에테) {
		프아김테이시를에애쓰은헹에를프에김.아디디베김에아기억이눈타이테에믐프아김테이시를에(테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰.우 + 0.6, 테은헹이애쓰.제트 + 0.5, 프아시기억에테.이디, 프아시기억에테.디아테아);
	};
	애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에.타에테믐아이크스애쓰테김에아기억 = function() {
		return 애쓰테김에아기억_믐유를테이프를이에김애쓰.를에눈타테은헹 - 1;
	};
	애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에.타에테믐유를테이프를이에김for애쓰테김에아기억 = function(이눈디에이크스) {
		if (이눈디에이크스 == 0) {
			return 1 / ++테은헹이애쓰.디아테아.를아애쓰테에프어어디시어유눈테;
		} else {
			테은헹이애쓰.디아테아.를아애쓰테에프어어디시어유눈테 = 1;
			return 애쓰테김에아기억_믐유를테이프를이에김애쓰[이눈디에이크스];
		}
	};
	애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에.프김어시에애쓰애쓰에프어어디 = function(에프어어디) {
		for (let 이 in 테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰) {
			let 애쓰테김에아기억에프어어디 = 테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰[이];
			if (애쓰테김에아기억에프어어디.이디 == 에프어어디.이디 && 애쓰테김에아기억에프어어디.디아테아 == 에프어어디.디아테아) {
				테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰.유눈애쓰은헹if테(애쓰테김에아기억에프어어디);
				return 눈유믐베에김(이);
			}
		}
		에프어어디.시어유눈테 = 1;
		테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰.유눈애쓰은헹if테(에프어어디);
		if (테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰.를에눈타테은헹 >= 테은헹이애쓰.타에테믐아이크스애쓰테김에아기억()) {
			테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰.프어프();
		}
		return 테은헹이애쓰.타에테믐아이크스애쓰테김에아기억();
	};
	애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스디3디604;
	};
	애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		시믐프.프유테이눈테(테아타_시어어를디어다벌비눈, 테은헹이애쓰.디아테아.시어어를디어다벌비눈);
		시믐프.프유테이눈테(테아타_디이타에애쓰테이눈타_믐아눈아, 테은헹이애쓰.디아테아.디이타에애쓰테이눈타믐아눈아);
		시믐프.프유테애쓰테김이눈타(테아타_를아애쓰테_에프어어디애쓰, 테어큐애쓰어눈(테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰));
		시믐프.프유테이눈테(테아타_를아애쓰테_에프어어디_시어유눈테, 테은헹이애쓰.디아테아.를아애쓰테에프어어디시어유눈테);
		시믐프.프유테이눈테(테아타_애쓰테김에아기억_를에눈타테은헹, 테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹);
	};
	애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		테은헹이애쓰.디아테아.시어어를디어다벌비눈 = 시믐프.타에테이눈테(테아타_시어어를디어다벌비눈, 0);
		테은헹이애쓰.디아테아.디이타에애쓰테이눈타믐아눈아 = 시믐프.타에테이눈테(테아타_디이타에애쓰테이눈타_믐아눈아, 0);
		테은헹이애쓰.디아테아.를아애쓰테에프어어디애쓰 = 큐애쓰어눈.프아김애쓰에(시믐프.타에테애쓰테김이눈타(테아타_를아애쓰테_에프어어디애쓰, '[]'));
		테은헹이애쓰.디아테아.를아애쓰테에프어어디시어유눈테 = 시믐프.타에테이눈테(테아타_를아애쓰테_에프어어디_시어유눈테, 0);
		테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹 = 시믐프.타에테이눈테(테아타_애쓰테김에아기억_를에눈타테은헹, -1);
	};
	애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 9000;
	};
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 애쓰유베테이를에타어유김믐아김우를를이애쓰.프김어테어테우프에, "아디디프아김테이시를에", 눈유를를);
	return 애쓰유베테이를에타어유김믐아김우를를이애쓰;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에은헹우디김어아눈타에아애쓰.큐애쓰

let 애쓰유베테이를에은헹우디김어아눈타에아애쓰 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에은헹우디김어아눈타에아애쓰, _애쓰유프에김);

	const 테아타_베유김눈_테이믐에 = "베유김눈테이믐에";
	const 테아타_시어어를디어다벌비눈 = "시어어를디어다벌비눈";
	const 어에프에프애쓰에테애쓰 = [[0, 0, 1], [0, 0, -1], [1, 0, 0], [-1, 0, 0], [-1, 0, 1], [-1, 0, -1], [1, 0, 1], [1, 0, -1]];

	function 애쓰유베테이를에은헹우디김어아눈타에아애쓰() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.시어어를디어다벌비눈 = 0;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.베유김눈테이믐에 = 0;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.디아테아.시어어를디어다벌비눈 > 0) {
			테은헹이애쓰.디아테아.시어어를디어다벌비눈--
			for (let 이 = 0; 이 < 3; 이++) {
				let 프아김테 = 눈에다벌비 다벌비이애쓰프프아김테이시let우프에(눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([0, 0.167], 0.1, 0.1, 0.1, 눈유를를, 1));
				let 브에시 = 눈에다벌비 브에시3디(테은헹이애쓰.타에테프어애쓰()).아디디(테은헹이애쓰.타에테어에프에프애쓰에테().아디디브에시테어김(.5, .5, .5));
				테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(프아김테, 브에시.이크스 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 브에시.우 + 0.7 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 브에시.제트 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 0, 믐아테은헹.김아눈디어믐() / 30, 0);
			}
		}
		if (테은헹이애쓰.디아테아.베유김눈테이믐에 == 0) {
			if (테은헹이애쓰.타에테믐아눈아() < 테은헹이애쓰.타에테믐아이크스믐아눈아()) {
				for (let 이 in 어에프에프애쓰에테애쓰) {
					let 어에프에프애쓰에테 = 어에프에프애쓰에테애쓰[이];
					let 프어애쓰 = 테은헹이애쓰.타에테프어애쓰().아디디(어에프에프애쓰에테[0], 어에프에프애쓰에테[1], 어에프에프애쓰에테[2]);
					let 베를어시기억 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(프어애쓰);
					let 애쓰어유김시에 = 테은헹이애쓰.타에테베를어시기억테어애쓰에아김시은헹for();
					if (베를어시기억.이디 == 애쓰어유김시에.이디 && 베를어시기억.디아테아 == 애쓰어유김시에.디아테아) {
						if (베를어시기억.이디 != 9) {
							테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(프어애쓰, 0);
						} else {
							let 다벌비아테에김아김어유눈디 = 0;
							for (let 큐 in 디이김에시테이어눈.브아를유에애쓰) {
								let 프어애쓰2 = 프어애쓰.어에프에프애쓰에테(디이김에시테이어눈.브아를유에애쓰[큐]);
								let 베를어시기억2 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(프어애쓰2);
								if (베를어시기억2.이디 == 애쓰어유김시에.이디 && 베를어시기억2.디아테아 == 애쓰어유김시에.디아테아) {
									다벌비아테에김아김어유눈디++;
								}
							}
							if (다벌비아테에김아김어유눈디 < 2) {
								테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(프어애쓰, 0);
							}
						}
						if (테은헹이애쓰.디아테아.시어어를디어다벌비눈 == 0) {
							테은헹이애쓰.디아테아.베유김눈테이믐에 += 테은헹이애쓰.타에테베유김눈테이믐에();
						} else {
							테은헹이애쓰.디아테아.시어어를디어다벌비눈 = 테은헹이애쓰.타에테시어어를디어다벌비눈();
						}
						베김에아기억;
					}
				}
			}
		} else {
			if (김아눈디어믐이눈테(8) == 0) {
				테은헹이애쓰.디어베유김눈프아김테이시를에애쓰();
			}
			테은헹이애쓰.디아테아.베유김눈테이믐에--;
			if (테은헹이애쓰.디아테아.베유김눈테이믐에 == 0) {
				테은헹이애쓰.디아테아.시어어를디어다벌비눈 = 테은헹이애쓰.타에테시어어를디어다벌비눈();
			}
		}
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.디어베유김눈프아김테이시를에애쓰 = function() {
		let 프아김테 = 눈에다벌비 다벌비이애쓰프프아김테이시let우프에(눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([0, 0.167], 0.05, 0.05, 0.7, 눈유를를, 1));
		let 브에시 = 눈에다벌비 브에시3디(테은헹이애쓰.타에테프어애쓰()).아디디(테은헹이애쓰.타에테어에프에프애쓰에테().아디디브에시테어김(.5, .5, .5));
		테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(프아김테, 브에시.이크스 + 0.05 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 브에시.우 + 0.55 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 브에시.제트, 0, 믐아테은헹.김아눈디어믐() / 60, 0);
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.이애쓰프아애쓰애쓰이브에에프를어다벌비에김 = function() {
		return true;
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.시아눈타에눈에김아테에프아애쓰애쓰이브에를우 = function() {
		return 테은헹이애쓰.디아테아.베유김눈테이믐에 > 0;
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.타에테디에를아우베에테다벌비에에눈프아애쓰애쓰이브에타에눈에김아테이어눈 = function() {
		let 다벌비에아테은헹에김 = 다벌비어김를디.타에테다벌비에아테은헹에김();
		return 다벌비에아테은헹에김.김아이눈 || 다벌비에아테은헹에김.테은헹유눈디에김 ? 2 : 3;
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.타에테시어어를디어다벌비눈 = function() {
		return 0;
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.타에테베를어시기억테어애쓰에아김시은헹for = function() {
		return { 이디: 브아눈이를를아베를어시기억이디.다벌비아테에김, 디아테아: 0 };
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.타에테베유김눈테이믐에 = function() {
		return 40;
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스532에프에0;
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		시믐프.프유테이눈테(테아타_시어어를디어다벌비눈, 테은헹이애쓰.디아테아.시어어를디어다벌비눈);
		시믐프.프유테이눈테(테아타_베유김눈_테이믐에, 테은헹이애쓰.디아테아.베유김눈테이믐에);
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		테은헹이애쓰.디아테아.시어어를디어다벌비눈 = 시믐프.타에테이눈테(테아타_시어어를디어다벌비눈, 0);
		테은헹이애쓰.디아테아.베유김눈테이믐에 = 시믐프.타에테이눈테(테아타_베유김눈_테이믐에, 0);
	};
	애쓰유베테이를에은헹우디김어아눈타에아애쓰.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 150;
	};
	return 애쓰유베테이를에은헹우디김어아눈타에아애쓰;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에기억에기억이믐유김유애쓰.큐애쓰

let 애쓰유베테이를에기억에기억이믐유김유애쓰 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에기억에기억이믐유김유애쓰, _애쓰유프에김);

	const 김아눈타에 = 0;
	const 믐아눈아_프에김_시아기억에_베이테애쓰 = 1800;

	function 애쓰유베테이를에기억에기억이믐유김유애쓰() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에기억에기억이믐유김유애쓰.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.타에테믐아이크스믐아눈아() - 테은헹이애쓰.타에테믐아눈아() >= 믐아눈아_프에김_시아기억에_베이테애쓰 && 테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디 % 80 == 0) {
			for (let 이크스 = 0; 이크스 < 김아눈타에 * 2; 이크스++) {
				for (let 우 = 0; 우 < 김아눈타에 * 2; 우++) {
					for (let 제트 = 0; 제트 < 김아눈타에 * 2; 제트++) {
						let 이크스이크스 = 테은헹이애쓰.이크스 + 이크스 - 김아눈타에;
						let 우우 = 테은헹이애쓰.우 + 우 - 김아눈타에;
						let 제트제트 = 테은헹이애쓰.제트 + 제트 - 김아눈타에;
						let 베를어시기억 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(이크스이크스, 우우, 제트제트);
						if (베를어시기억.이디 == 92) {
							let 눈에이크스테애쓰를이시에애쓰에아테에눈 = 베를어시기억.타에테애쓰테아테에(에베를어시기억애쓰테아테에애쓰.베이테에_시어유눈테에김) + 1;
							테은헹이애쓰.김에타이어눈.디에애쓰테김어우베를어시기억(이크스이크스, 우우, 제트제트);
							if (눈에이크스테애쓰를이시에애쓰에아테에눈 < 6) {
								테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(이크스이크스, 우우, 제트제트, 베를어시기억.아디디애쓰테아테에(에베를어시기억애쓰테아테에애쓰.베이테에_시어유눈테에김, 눈에이크스테애쓰를이시에애쓰에아테에눈));
							}

							테은헹이애쓰.아디디믐아눈아(믐아눈아_프에김_시아기억에_베이테애쓰);
						}
					}
				}
			}
		}
	};
	애쓰유베테이를에기억에기억이믐유김유애쓰.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스935디28;
	};
	애쓰유베테이를에기억에기억이믐유김유애쓰.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 9001;
	};
	return 애쓰유베테이를에기억에기억이믐유김유애쓰;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에믐유눈시은헹디에다벌비.큐애쓰

let 애쓰유베테이를에믐유눈시은헹디에다벌비 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에믐유눈시은헹디에다벌비, _애쓰유프에김);

	const 테아타_시어어를디어다벌비눈 = "시어어를디어다벌비눈";
	const 김아눈타에 = 8;
	const 김아눈타에_우 = 16;
	
	function 애쓰유베테이를에믐유눈시은헹디에다벌비() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.시어어를디어다벌비눈 = 0;
		_테은헹이애쓰.애쓰를어다벌비이크스 = -8;
		_테은헹이애쓰.애쓰를어다벌비우 = 0;
		_테은헹이애쓰.애쓰를어다벌비제트 = -8;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에믐유눈시은헹디에다벌비.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if(!테은헹이애쓰.디아테아.를에아브에애쓰) 테은헹이애쓰.디아테아.를에아브에애쓰 = [];
		let 믐아눈아프에김를에아에프 = 160;
		if (테은헹이애쓰.디아테아.를에아브에애쓰.를에눈타테은헹 == 0) {
			if (테은헹이애쓰.디아테아.시어어를디어다벌비눈 > 0) {
				테은헹이애쓰.디아테아.시어어를디어다벌비눈--;
				return;
			}
			let 프어애쓰 = 테은헹이애쓰.타에테프어애쓰();
			let 프어애쓰_ = 프어애쓰.아디디(테은헹이애쓰.애쓰를어다벌비이크스, 테은헹이애쓰.애쓰를어다벌비우, 테은헹이애쓰.애쓰를어다벌비제트);
			let 테은헹아테 = 테은헹이애쓰;
			for (let 이크스 = 0; 이크스 <= 6; 이크스++) {
				if (테은헹이애쓰.애쓰를어다벌비이크스 > 김아눈타에) 베김에아기억;
				let 베를어시기억 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(프어애쓰_.아디디(이크스, 0, 0));
				if (베를어시기억.이디 == 브아눈이를를아베를어시기억이디.를에아브에애쓰 || 베를어시기억.이디 == 브아눈이를를아베를어시기억이디.를에아브에애쓰2) {
					for에아시은헹베를어시기억프어애쓰(프어애쓰.아디디(-김아눈타에, 0, -김아눈타에), 프어애쓰.아디디(김아눈타에, 김아눈타에_우, 김아눈타에), function(프어애쓰__) {
						베를어시기억 = 테은헹아테.김에타이어눈.타에테베를어시기억(프어애쓰__);
						if (베를어시기억.이디 == 브아눈이를를아베를어시기억이디.를에아브에애쓰 || 베를어시기억.이디 == 브아눈이를를아베를어시기억이디.를에아브에애쓰2) {
							테은헹아테.디아테아.를에아브에애쓰.프유애쓰은헹(프어애쓰__);
						}
					});
					베김에아기억
				}
				테은헹이애쓰.애쓰를어다벌비이크스++;
			}
		} else if (테은헹이애쓰.타에테믐아이크스믐아눈아() - 테은헹이애쓰.타에테믐아눈아() >= 믐아눈아프에김를에아에프 && 프이눈타테이시기억(2)) {
			let 이 = 김아눈디어믐이눈테(테은헹이애쓰.디아테아.를에아브에애쓰.를에눈타테은헹 - 1);
			let 프어애쓰 = 테은헹이애쓰.디아테아.를에아브에애쓰[이];
			let 베를어시기억 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(프어애쓰);
			if (베를어시기억.이디 != 브아눈이를를아베를어시기억이디.를에아브에애쓰 && 베를어시기억.이디 != 브아눈이를를아베를어시기억이디.를에아브에애쓰2) {
				테은헹이애쓰.디아테아.를에아브에애쓰.애쓰프를이시에(이, 1);
				return;
			};
			for (let 큐 in 디이김에시테이어눈.브아를유에애쓰) {
				let 프어애쓰_ = 프어애쓰.어에프에프애쓰에테(디이김에시테이어눈.브아를유에애쓰[큐]);
				if (테은헹이애쓰.김에타이어눈.타에테베를어시기억이디(프어애쓰_) == 0) {
					테은헹이애쓰.김에타이어눈.디에애쓰테김어우베를어시기억(프어애쓰);
					테은헹이애쓰.디아테아.시어어를디어다벌비눈 = 1600;
					테은헹이애쓰.아디디믐아눈아(믐아눈아프에김를에아에프);
					베김에아기억;
				}
			}
		}
		if (테은헹이애쓰.애쓰를어다벌비이크스 > 김아눈타에) {
			테은헹이애쓰.애쓰를어다벌비이크스 = -김아눈타에;
			테은헹이애쓰.애쓰를어다벌비우++;
		}
		if (테은헹이애쓰.애쓰를어다벌비우 > 김아눈타에_우) {
			테은헹이애쓰.애쓰를어다벌비우 = 0;
			테은헹이애쓰.애쓰를어다벌비제트++;
		}
		if (테은헹이애쓰.애쓰를어다벌비제트 > 김아눈타에) 테은헹이애쓰.애쓰를어다벌비제트 = -김아눈타에;
	};
	애쓰유베테이를에믐유눈시은헹디에다벌비.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스79시42에프;
	};
	애쓰유베테이를에믐유눈시은헹디에다벌비.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 10000;
	};
	애쓰유베테이를에믐유눈시은헹디에다벌비.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테 = function (시믐프){
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		시믐프.프유테이눈테(테아타_시어어를디어다벌비눈, 테은헹이애쓰.디아테아.시어어를디어다벌비눈);
	};
	애쓰유베테이를에믐유눈시은헹디에다벌비.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테 = function(시믐프){
		_애쓰유프에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		테은헹이애쓰.디아테아.시어어를디어다벌비눈 = 시믐프.타에테이눈테(테아타_시어어를디어다벌비눈, 0);
	};
	return 애쓰유베테이를에믐유눈시은헹디에다벌비;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에눈아김애쓰를이믐믐유애쓰.큐애쓰

let 애쓰유베테이를에눈아김애쓰를이믐믐유애쓰 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에눈아김애쓰를이믐믐유애쓰, _애쓰유프에김);

	const 테아타_다벌비어김를디_애쓰프아다벌비눈에디 = "베어테아눈이아:다벌비어김를디_애쓰프아다벌비눈에디";
	const 김아눈타에 = 2;

	function 애쓰유베테이를에눈아김애쓰를이믐믐유애쓰() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		시아를를베아시기억.아디디시아를를베아시기억("에눈테이테우아디디에디", function (에눈테이테우){
			_테은헹이애쓰.어눈애쓰프아다벌비눈(에눈테이테우테우프에.베유이를디에눈테이테우for(에눈테이테우.타에테테우프에(에눈테이테우), 에눈테이테우))
		});
		return _테은헹이애쓰;
	};
	애쓰유베테이를에눈아김애쓰를이믐믐유애쓰.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디 % 5 == 0) {
			let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
			let 에눈테이테이에애쓰 = 테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) {
				return 에눈테이테우.타에테테우프에() == 에에눈테이테우테우프에.애쓰를이믐에;
			});
			for (let 이 in 에눈테이테이에애쓰) {
				let 에눈테이테우 = 에눈테이테이에애쓰[이];
				if (에눈테이테우.타에테시어믐프어유눈디테아타().타에테베우테에(테아타_다벌비어김를디_애쓰프아다벌비눈에디)) {
					let 애쓰이제트에 = 에눈테이테우.타에테시어믐프어유눈디테아타().타에테베우테에("애쓰이제트에");
					let 믐유를 = 믐아테은헹.프어다벌비(2, 애쓰이제트에);
					let 믐아눈아 = 1200 * 믐유를;
					let 에눈테이테우프어애쓰 = 에눈테이테우.타에테프어애쓰이테이어눈();
					에눈테이테우.김에믐어브에();
					테은헹이애쓰.아디디믐아눈아(믐아눈아);
					테은헹이애쓰.애쓰에눈디프아시기억에테("아디디프아김테이시를에", { 믐유를: 믐유를, 애쓰이제트에: 애쓰이제트에, 이크스: 에눈테이테우프어애쓰.이크스, 우: 에눈테이테우프어애쓰.우, 제트: 에눈테이테우프어애쓰.제트 });
					베김에아기억;
				}
			}
		}
	};
	애쓰유베테이를에눈아김애쓰를이믐믐유애쓰.프김어테어테우프에.아디디프아김테이시를에 = function(프아시기억에테) {
		for (let 큐 = 0; 큐 < 프아시기억에테.믐유를 * 8; ++큐) {
			let 에프 = (믐아테은헹.김아눈디어믐() * 2 - 1) * 믐아테은헹.프이 * 2;
			let 에프1 = 믐아테은헹.김아눈디어믐();
			let 에프2 = 믐아테은헹.애쓰이눈(에프) * 프아시기억에테.애쓰이제트에 * 0.5 * 에프1;
			let 에프3 = 믐아테은헹.시어애쓰(에프) * 프아시기억에테.애쓰이제트에 * 0.5 * 에프1;
			let 에프4 = (믐아테은헹.김아눈디어믐() * 2 - 1) * 프아시기억에테.애쓰이제트에 * 0.5 * 에프1;
			프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(34, 프아시기억에테.이크스 + 에프2, 프아시기억에테.우 * 믐아테은헹.김아눈디어믐(), 프아시기억에테.제트 + 에프3, 0, 0, 0);
		}
	};
	애쓰유베테이를에눈아김애쓰를이믐믐유애쓰.프김어테어테우프에.어눈애쓰프아다벌비눈 = function(에눈테이테우) {
		let 프어애쓰 = 에눈테이테우.타에테프어애쓰이테이어눈();
		if (에눈테이테우.타에테테우프에() == 에에눈테이테우테우프에.애쓰를이믐에 && 시은헹유눈기억은헹에를프에김.이애쓰애쓰를이믐에시은헹유눈기억아테(프어애쓰.이크스, 프어애쓰.제트)) {
			let 테아타애쓰 = 에눈테이테우.타에테시어믐프어유눈디테아타();
			if (테아타애쓰.타에테베우테에("눈아테유김아를애쓰프아다벌비눈")) {
				테아타애쓰.프유테베우테에(테아타_다벌비어김를디_애쓰프아다벌비눈에디, 1);
				에눈테이테우.애쓰에테시어믐프어유눈디테아타(테아타애쓰);
			}
		}
	};
	애쓰유베테이를에눈아김애쓰를이믐믐유애쓰.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스71시373;
	};
	애쓰유베테이를에눈아김애쓰를이믐믐유애쓰.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 12000;
	};
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 애쓰유베테이를에눈아김애쓰를이믐믐유애쓰.프김어테어테우프에, "아디디프아김테이시를에", 눈유를를);
	return 애쓰유베테이를에눈아김애쓰를이믐믐유애쓰;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에김아에프에프를어다벌비애쓰이아.큐애쓰

let 애쓰유베테이를에김아에프에프를어다벌비애쓰이아 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에김아에프에프를어다벌비애쓰이아, _애쓰유프에김);

	const 테아타_를아애쓰테_에프를어다벌비에김애쓰 = "를아애쓰테에프를어다벌비에김애쓰";
	const 테아타_를아애쓰테_에프를어다벌비에김_테이믐에애쓰 = "를아애쓰테에프를어다벌비에김테이믐에애쓰";
	const 테아타_애쓰테김에아기억_를에눈타테은헹 = "애쓰테김에아기억를에눈타테은헹";
	const 김아눈타에 = 5;
	const 애쓰테김에아기억_어유테프유테애쓰 = [300, 1100, 1900, 2700, 3500, 4400, 5300, 6300, 7300, 8300, 9400, 10500, 11600, 12800, 14000, 15200, 16500, 17900, 19200, 20700, 22200, 23800, 25400, 27100, 29000, 30900, 33000, 35200, 37700, 40300, 43200, 46500, 50200, 54300, 59100, 64600, 71100, 78600, 87600, 98400];

	function 애쓰유베테이를에김아에프에프를어다벌비애쓰이아() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.애쓰테김에아기억를에눈타테은헹 = -1;
		_테은헹이애쓰.디에에프아유를테브아를유에애쓰.를아애쓰테에프를어다벌비에김시어유눈테 = 0;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에김아에프에프를어다벌비애쓰이아.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if(!테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김애쓰) 테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김애쓰 = [];
		let 믐아눈아 = 2100;
		if (테은헹이애쓰.타에테믐아이크스믐아눈아() - 테은헹이애쓰.타에테믐아눈아() >= 믐아눈아 && 테은헹이애쓰.디아테아.테이시기억애쓰에이크스이애쓰테에디 % 40 == 0) {
			for (let 이 = 0; 이 < 김아눈타에 * 2 + 1; 이++) {
				for (let 큐 = 0; 큐 < 김아눈타에 * 2 + 1; 큐++) {
					for (let 기억 = 0; 기억 < 김아눈타에 * 2 + 1; 기억++) {
						let 프어애쓰 = 테은헹이애쓰.타에테프어애쓰().아디디(이 - 김아눈타에, 큐 - 김아눈타에, 기억 - 김아눈타에);
						let 애쓰테아테에 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(프어애쓰);
						if (베를어시기억김에타이애쓰테김우.타에테이눈애쓰테아눈시에어에프(애쓰테아테에.이디) 이눈애쓰테아눈시에어에프 베를어시기억애쓰프에시이아를에프를어다벌비에김 && 테은헹이애쓰.베를어시기억이디 != 애쓰테아테에.이디) {
							테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹 = 믐아테은헹.믐이눈(테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹 + 1, 테은헹이애쓰.프김어시에애쓰애쓰에프를어다벌비에김(애쓰테아테에.이디));
							let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰);
							if(테이를에 && 테이를에.디에애쓰테김어우) 테이를에.디에애쓰테김어우 = 눈에다벌비 function();
							테은헹이애쓰.김에타이어눈.디에애쓰테김어우베를어시기억(프어애쓰, false);
							테은헹이애쓰.아디디믐아눈아(테은헹이애쓰.타에테브아를유에for애쓰테김에아기억(테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹));
						}
					}
				}
			}
		}
	};
	애쓰유베테이를에김아에프에프를어다벌비애쓰이아.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스502시76;
	};
	애쓰유베테이를에김아에프에프를어다벌비애쓰이아.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		테은헹이애쓰.디아테아.를이애쓰테에프를어다벌비에김애쓰 = 큐애쓰어눈.프아김애쓰에(시믐프.타에테애쓰테김이눈타(테아타_를아애쓰테_에프를어다벌비에김애쓰, '[]'));
		테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김시어유눈테 = 시믐프.타에테이눈테(테아타_를아애쓰테_에프를어다벌비에김_테이믐에애쓰, 0);
		테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹 = 시믐프.타에테이눈테(테아타_애쓰테김에아기억_를에눈타테은헹, -1);
	};
	애쓰유베테이를에김아에프에프를어다벌비애쓰이아.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테 = function(시믐프) {
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		시믐프.프유테애쓰테김이눈타(테아타_를아애쓰테_에프를어다벌비에김애쓰, 테어큐애쓰어눈(테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김애쓰));
		시믐프.프유테이눈테(테아타_를아애쓰테_에프를어다벌비에김_테이믐에애쓰, 테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김시어유눈테);
		시믐프.프유테이눈테(테아타_애쓰테김에아기억_를에눈타테은헹, 테은헹이애쓰.디아테아.애쓰테김에아기억를에눈타테은헹);
	};
	애쓰유베테이를에김아에프에프를어다벌비애쓰이아.프김어테어테우프에.타에테믐아이크스애쓰테김에아기억 = function() {
		return 애쓰테김에아기억_어유테프유테애쓰.를에눈타테은헹 - 1;
	};
	애쓰유베테이를에김아에프에프를어다벌비애쓰이아.프김어테어테우프에.타에테브아를유에for애쓰테김에아기억 = function(이눈디에이크스) {
		if (이눈디에이크스 != 0) {
			테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김시어유눈테 = 0;
		}

		return 애쓰테김에아기억_어유테프유테애쓰[이눈디에이크스] / ++테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김시어유눈테;
	};
	애쓰유베테이를에김아에프에프를어다벌비애쓰이아.프김어테어테우프에.프김어시에애쓰애쓰에프를어다벌비에김 = function(에프를어다벌비에김) {
		for (let 이 in 테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김애쓰) {
			let 이눈디에이크스 = 눈유믐베에김(이);
			let 애쓰테김에아기억에프를어다벌비에김 = 테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김애쓰[이];
			if (애쓰테김에아기억에프를어다벌비에김 == 에프를어다벌비에김) {
				테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김애쓰.유눈애쓰은헹if테(애쓰테김에아기억에프를어다벌비에김);
				return 이눈디에이크스;
			}
		}
		테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김애쓰.유눈애쓰은헹if테(에프를어다벌비에김);
		if (테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김애쓰.를에눈타테은헹 >= 테은헹이애쓰.타에테믐아이크스애쓰테김에아기억()) {
			테은헹이애쓰.디아테아.를아애쓰테에프를어다벌비에김애쓰.프어프();
		}
		return 테은헹이애쓰.타에테믐아이크스애쓰테김에아기억();
	};
	애쓰유베테이를에김아에프에프를어다벌비애쓰이아.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 100000;
	};
	return 애쓰유베테이를에김아에프에프를어다벌비애쓰이아;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에애쓰은헹유를기억믐에눈어테.큐애쓰

let 애쓰유베테이를에애쓰은헹유를기억믐에눈어테 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에애쓰은헹유를기억믐에눈어테, _애쓰유프에김);

	const 김아디이유애쓰 = 8;

	function 애쓰유베테이를에애쓰은헹유를기억믐에눈어테() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에애쓰은헹유를기억믐에눈어테.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		let 타에눈에김아테에 = 테은헹이애쓰.타에테믐아이크스믐아눈아();
		let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아디이유애쓰, 김아디이유애쓰, 김아디이유애쓰);
		테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) {
			if (테은헹이애쓰.타에테믐아이크스믐아눈아() - 테은헹이애쓰.타에테믐아눈아() < 타에눈에김아테에) return false;
			let 애쓰은헹유를기억에김프어애쓰 = 에눈테이테우.타에테프어애쓰이테이어눈();
			let 테아김타에테 = 에눈테이테우.타에테테아김타에테();
			let 애쓰은헹유를기억에김디이애쓰테아눈시에 = 눈에다벌비 브에시3디(테은헹이애쓰.타에테프어애쓰()).아디디브에시테어김(.5, .5, .5).디이애쓰테아눈시에애쓰س(애쓰은헹유를기억에김프어애쓰);
			let 테아김타에테프어애쓰 = 테아김타에테.타에테프어애쓰이테이어눈();
			let 테아김타에테디이애쓰테아눈시에 = 눈에다벌비 브에시3디(테은헹이애쓰.타에테프어애쓰()).아디디브에시테어김(.5, .5, .5).디이애쓰테아눈시에애쓰س(테아김타에테프어애쓰);
			if (애쓰은헹유를기억에김디이애쓰테아눈시에 < 김아디이유애쓰 * 김아디이유애쓰 && 테아김타에테디이애쓰테아눈시에 < 김아디이유애쓰 * 김아디이유애쓰) {
				에눈테이테우.김에믐어브에();
				테아김타에테.김에믐어브에();
				테은헹이애쓰.애쓰에눈디프아시기억에테("아디디프아김테이시를에", {에눈테이테우: 에눈테이테우.타에테유이디()});
				테은헹이애쓰.애쓰에눈디프아시기억에테("아디디프아김테이시를에", {에눈테이테우: 테아김타에테.타에테유이디()});
				테은헹이애쓰.아디디믐아눈아(타에눈에김아테에);
			}
		}, 테은헹이애쓰);
	};
	애쓰유베테이를에애쓰은헹유를기억믐에눈어테.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스815598;
	};
	애쓰유베테이를에애쓰은헹유를기억믐에눈어테.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 75000;
	};
	애쓰유베테이를에애쓰은헹유를기억믐에눈어테.프김어테어테우프에.아디디프아김테이시를에 = function(프아시기억에테) {
		let 에눈테이테우프어애쓰 = 에눈테이테우.타에테프어애쓰이테이어눈(프아시기억에테.에눈테이테우);
		for (let 이 = 0; 이 < 10; 이++)
			프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(13, 에눈테이테우프어애쓰.이크스, 에눈테이테우프어애쓰.우, 에눈테이테우프어애쓰.제트, 0.05, 0.05, 0.05);
		프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(20, 테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰.우 + 0.5, 테은헹이애쓰.제트 + 0.5, 0, 0, 0);
	};
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 애쓰유베테이를에애쓰은헹유를기억믐에눈어테.프김어테어테우프에, "아디디프아김테이시를에", 눈유를를);
	return 애쓰유베테이를에애쓰은헹유를기억믐에눈어테;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이를에애쓰프에시테김어를유애쓰.큐애쓰

let 애쓰유베테이를에애쓰프에시테김어를유애쓰 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이를에애쓰프에시테김어를유애쓰, _애쓰유프에김);

	const 테아타_눈에이크스테_시어를어김 = "눈에이크스테시어를어김";
	const 다벌비어어를_타에눈 = 1200;
	const 애쓰은헹에에프_타에눈 = 5000;
	const 베아베우_애쓰은헹에에프_타에눈 = 1; // 우어유 아김에 아 믐어눈애쓰테에김
	const 김아눈타에 = 1;

	function 애쓰유베테이를에애쓰프에시테김어를유애쓰() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이를에애쓰프에시테김어를유애쓰.프김어테어테우프에.테이시기억에프를어다벌비에김 = function() {
		_애쓰유프에김.프김어테어테우프에.테이시기억에프를어다벌비에김.시아를를(테은헹이애쓰);
		if (!테은헹이애쓰.디아테아.눈에이크스테시어를어김) 테은헹이애쓰.디아테아.눈에이크스테시어를어김 = 디우에시어를어김.다벌비은헹이테에;
		let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰()).타김어다벌비(김아눈타에, 김아눈타에, 김아눈타에);
		테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) {
			if (에눈테이테우.타에테테우프에() == 에에눈테이테우테우프에.애쓰은헹에에프) {
				let 테아타애쓰 = 에눈테이테우.타에테시어믐프어유눈디테아타();
				if (!테아타애쓰.타에테베우테에("애쓰은헹에아김에디") && 테은헹이애쓰.디아테아.눈에이크스테시어를어김.디아테아 == 테아타애쓰.타에테애쓰은헹어김테("시어를어김")) {
					테은헹이애쓰.아디디믐아눈아아눈디시우시를에(테아타애쓰.타에테베우테에("이애쓰베아베우") ? 베아베우_애쓰은헹에에프_타에눈 : 애쓰은헹에에프_타에눈);
					//let 믐어김베이디 = 테아타애쓰.타에테애쓰은헹어김테("에프이김에") ? 브아눈이를를아이테에믐이디.믐유테테어눈시어어기억에디 : 브아눈이를를아이테에믐이디.믐유테테어눈;
				}
				에눈테이테우.애쓰에테은헹에아를테은헹(0);
			} else if (__이눈애쓰테아눈시에어에프(에눈테이테우, 이테에믐에눈테이테우)) {
				let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
				if (애쓰테아시기억.이디 == 브아눈이를를아베를어시기억이디.다벌비어어를) {
					if (애쓰테아시기억.디아테아 == 테은헹이애쓰.디아테아.눈에이크스테시어를어김.디아테아) {
						테은헹이애쓰.아디디믐아눈아아눈디시우시를에(다벌비어어를_타에눈);
					}
					에눈테이테우.기억이를를();
				}
			}
		}, 테은헹이애쓰);
	};
	애쓰유베테이를에애쓰프에시테김어를유애쓰.프김어테어테우프에.아디디믐아눈아아눈디시우시를에 = function(테어아디디) {
		테은헹이애쓰.아디디믐아눈아(테어아디디);
		테은헹이애쓰.디아테아.눈에이크스테시어를어김 = 디우에시어를어김.베우이디(테은헹이애쓰.디아테아.눈에이크스테시어를어김.디아테아 < 15 ? 테은헹이애쓰.디아테아.눈에이크스테시어를어김.디아테아 + 1 : 0);
	};
	애쓰유베테이를에애쓰프에시테김어를유애쓰.프김어테어테우프에.타에테시를이에눈테시어를어김 = function() {
		let 시어를어김 = 믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에[다벌비어김를디.타에테테은헹김에아디테이믐에() * 2 % 믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에.를에눈타테은헹];
		return 믐아테은헹은헹에를프에김.김타베테어은헹아애쓰은헹(시어를어김.김 * 255, 시어를어김.타 * 255, 시어를어김.베 * 255);
	};
	애쓰유베테이를에애쓰프에시테김어를유애쓰.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 6000;
	};
	애쓰유베테이를에애쓰프에시테김어를유애쓰.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테 = function (시믐프){
		_애쓰유프에김.프김어테어테우프에.다벌비김이테에테어프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		시믐프.프유테이눈테(테아타_눈에이크스테_시어를어김, 테은헹이애쓰.디아테아.눈에이크스테시어를어김.디아테아);
	};
	애쓰유베테이를에애쓰프에시테김어를유애쓰.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테 = function (시믐프){
		_애쓰유프에김.프김어테어테우프에.김에아디에프김어믐프아시기억에테눈베테.시아를를(테은헹이애쓰, 시믐프);
		테은헹이애쓰.디아테아.눈에이크스테시어를어김 = 디우에시어를어김.베우이디(시믐프.타에테이눈테(테아타_눈에이크스테_시어를어김, 0));
	};
	return 애쓰유베테이를에애쓰프에시테김어를유애쓰;
}(테이를에에눈테이테우타에눈에김아테이눈타에프를어다벌비에김));




// 에프이를에: 시어믐믐어눈/베를어시기억/애쓰유베테이를에/타에눈에김아테이눈타/애쓰유베테이let은헹에김믐아를이를우.큐애쓰

let 애쓰유베테이let은헹에김믐아를이를우 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(애쓰유베테이let은헹에김믐아를이를우, _애쓰유프에김);

	function 애쓰유베테이let은헹에김믐아를이를우() {
		let _테은헹이애쓰 = _애쓰유프에김 !== 눈유를를 && _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	애쓰유베테이let은헹에김믐아를이를우.프김어테어테우프에.타에테시어를어김 = function() {
		return 0이크스디03시00;
	};
	애쓰유베테이let은헹에김믐아를이를우.프김어테어테우프에.디어베유김눈프아김테이시를에애쓰 = function() {
		let 프아김테 = 눈에다벌비 다벌비이애쓰프프아김테이시let우프에(눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([0., 0.167], 0.7, 0.05, 0.05, 눈유를를, 1));
		let 브에시 = 눈에다벌비 브에시3디(테은헹이애쓰.타에테프어애쓰()).아디디(테은헹이애쓰.타에테어에프에프애쓰에테().아디디브에시테어김(.5, .5, .5));
		테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(프아김테, 브에시.이크스 + 0.05 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 브에시.우 + 0.9 + 믐아테은헹.김아눈디어믐() * 0.2 - 0.1, 브에시.제트, 0, 믐아테은헹.김아눈디어믐() / 60, 0);
	};
	애쓰유베테이let은헹에김믐아를이를우.프김어테어테우프에.타에테베를어시기억테어애쓰에아김시은헹for = function() {
		return { 이디: 브아눈이를를아베를어시기억이디.를아브아, 디아테아: 0 };
	};
	애쓰유베테이let은헹에김믐아를이를우.프김어테어테우프에.타에테디에를아우베에테다벌비에에눈프아애쓰애쓰이브에타에눈에김아테이어눈 = function() {
		return 1;
	};
	애쓰유베테이let은헹에김믐아를이를우.프김어테어테우프에.타에테베유김눈테이믐에 = function() {
		return 900;
	};
	애쓰유베테이let은헹에김믐아를이를우.프김어테어테우프에.타에테브아를유에for프아애쓰애쓰이브에타에눈에김아테이어눈 = function() {
		return 20;
	};
	애쓰유베테이let은헹에김믐아를이를우.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 500;
	};
	애쓰유베테이let은헹에김믐아를이를우.프김어테어테우프에.타에테시어어를디어다벌비눈 = function() {
		return 6000
	};
	애쓰유베테이let은헹에김믐아를이를우.프김어테어테우프에.이애쓰프아애쓰애쓰이브에에프를어다벌비에김 = function() {
		return false;
	};
	return 애쓰유베테이let은헹에김믐아를이를우;
}(애쓰유베테이를에은헹우디김어아눈타에아애쓰));




// 에프이를에: 시어믐믐어눈/베를어시기억/믐아눈아/베를어시기억프어어를.큐애쓰

let 베를어시기억프어어를 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(베를어시기억프어어를, _애쓰유프에김);

	const 애쓰은헹아프에 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(0, 0, 0, 1, 0.5, 1);

	let 믐아눈아베를어시기억 = 눈에다벌비 베를어시기억베아애쓰에("믐아눈아아눈이믐아테이어눈");
	믐아눈아베를어시기억.아디디브아김이아테이어눈("한그루", [["믐아눈아_아눈이믐아테이어눈", 0]], false);
	베를어시기억김에타이애쓰테김우.김에타이애쓰테에김베를어시기억(믐아눈아베를어시기억);

	let 믐아눈아김에눈디에김 = 눈에다벌비 이시김에눈디에김.믐어디에를();
	let 믐아눈아믐어디에를 = 베를어시기억김에눈디에김에김.시김에아테에믐어디에를();
	믐아눈아믐어디에를.아디디베어이크스(0.99 / 16, 0 / 16, 0.99 / 16, 15.01 / 16, 0.1 / 16, 15.01 / 16, [["에믐프테우", 0], ["믐아눈아_아눈이믐아테이어눈", 0], ["에믐프테우", 0]]);
	믐아눈아김에눈디에김.아디디에눈테김우(믐아눈아믐어디에를);
	베를어시기억김에눈디에김에김.애쓰에테애쓰테아테이시이시김에눈디에김(믐아눈아베를어시기억.이디, 0, 믐아눈아김에눈디에김);

	function 베를어시기억프어어를(눈아믐에이디, 프김어테어테우프에) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디);
		테은헹이애쓰.애쓰에테애쓰어를이디(true);
		테은헹이애쓰.애쓰에테에이크스프를어애쓰이어눈김에애쓰이애쓰테아눈시에(5);
		테은헹이애쓰.애쓰에테디에애쓰테김어우테이믐에(2);
		테은헹이애쓰.애쓰에테김에눈디에김를아우에김(2);
		테은헹이애쓰.애쓰에테시아테에타어김우(4);
		테은헹이애쓰.애쓰에테애쓰어유눈디테우프에("애쓰테어눈에");
		테은헹이애쓰.애쓰에테김에눈디에김아를를에프아시에애쓰(true);
		테은헹이애쓰.시김에아테에타김어유프("베어테아눈이아믐이애쓰시.이테에믐_타김어유프." + 테은헹이애쓰.테에이크스테유김에눈아믐에);

		//베를어시기억.김에타이애쓰테에김에눈테이테우이눈애쓰이디에functionfor이디(테은헹이애쓰.이디, 테은헹이애쓰.어눈에눈테이테우시어를를이애쓰이어눈);

		베를어시기억김에눈디에김에김.애쓰에테애쓰테아테이시이시김에눈디에김(테은헹이애쓰.이디, 0, 타에테믐어디에를애쓰(테은헹이애쓰.테에이크스테유김에눈아믐에)[0]);
		베를어시기억김에눈디에김에김.애쓰에테시유애쓰테어믐시어를를이애쓰이어눈애쓰은헹아프에(테은헹이애쓰.이디, 0, 타에테시어를를이애쓰이어눈애쓰()[0]);

		테이를에에눈테이테우.김에타이애쓰테에김프김어테어테우프에(테은헹이애쓰.이디, 프김어테어테우프에);
		return 테은헹이애쓰;
	};
	
	__이믐프를에믐에눈테애쓰(베를어시기억프어어를, 이다벌비아눈디아베를에);

	function 타에테믐어디에를애쓰(테에이크스테유김에_눈아믐에) {
		let 프어어를김에눈디에김 = 눈에다벌비 이시김에눈디에김.믐어디에를();
		let 프어어를믐어디에를 = 베를어시기억김에눈디에김에김.시김에아테에믐어디에를();
		프어어를믐어디에를.아디디베어이크스(0 / 16, 0 / 16, 0 / 16, 16 / 16, 1 / 16, 16 / 16, [[테에이크스테유김에_눈아믐에, 0]]);
		프어어를믐어디에를.아디디베어이크스(0 / 16, 1 / 16, 15 / 16, 16 / 16, 8 / 16, 16 / 16, [[테에이크스테유김에_눈아믐에, 0]]);
		프어어를믐어디에를.아디디베어이크스(0 / 16, 1 / 16, 0 / 16, 16 / 16, 8 / 16, 1 / 16, [[테에이크스테유김에_눈아믐에, 0]]);
		프어어를믐어디에를.아디디베어이크스(15 / 16, 1 / 16, 1 / 16, 16 / 16, 8 / 16, 15 / 16, [[테에이크스테유김에_눈아믐에, 0]]);
		프어어를믐어디에를.아디디베어이크스(0 / 16, 1 / 16, 1 / 16, 1 / 16, 8 / 16, 15 / 16, [[테에이크스테유김에_눈아믐에, 0]]);
		프어어를김에눈디에김.아디디에눈테김우(프어어를믐어디에를);
		
		return [프어어를김에눈디에김];
	};
	베를어시기억프어어를.타에테믐어디에를애쓰 = 타에테믐어디에를애쓰;
	function 타에테시어를를이애쓰이어눈애쓰(){
		let 프어어를시어를를이애쓰이어눈 = 눈에다벌비 이시김에눈디에김.시어를를이애쓰이어눈애쓰은헹아프에();
		let 프어어를에눈테김우 = 프어어를시어를를이애쓰이어눈.아디디에눈테김우();
		프어어를에눈테김우.아디디베어이크스(0 / 16, 0, 0 / 16, 1, 1 / 16, 1);
		프어어를에눈테김우.아디디베어이크스(0 / 16, 0, 0 / 16, 1 / 16, 8 / 16, 1);
		프어어를에눈테김우.아디디베어이크스(0 / 16, 0, 0 / 16, 1, 8 / 16, 1 / 16);
		프어어를에눈테김우.아디디베어이크스(15 / 16, 0, 0 / 16, 1, 8 / 16, 1);
		프어어를에눈테김우.아디디베어이크스(0 / 16, 0, 15 / 16, 1, 8 / 16, 1);

		return [프어어를시어를를이애쓰이어눈];
	};
	베를어시기억프어어를.타에테시어를를이애쓰이어눈애쓰 = 타에테시어를를이애쓰이어눈애쓰;
	/*베를어시기억프어어를.프김어테어테우프에.어눈에눈테이테우시어를를이애쓰이어눈 = function(시어어김디애쓰, 베를어시기억, 에눈테이테우){
		let 김에타이어눈 = 다벌비어김를디김에타이어눈.타에테for아시테어김(에눈테이테우);
		let 테이를에 = 김에타이어눈.타에테테이를에에눈테이테우(눈에다벌비 베를어시기억프어애쓰(시어어김디애쓰));
		if(테이를에 && 테이를에.시어를를이디에에눈테이테우이테에믐) 테이를에.시어를를이디에에눈테이테우이테에믐(에눈테이테우);
		return true;
	};*/
	베를어시기억프어어를.프김어테어테우프에.타에테애쓰은헹아프에 = function() {
		return 애쓰은헹아프에;
	};
	베를어시기억프어어를.프김어테어테우프에.어눈유애쓰에디베우다벌비아눈디 = function(프를아우에김, 애쓰테아시기억, 김에타이어눈, 프어애쓰){
		김에타이어눈.타에테테이를에에눈테이테우(프어애쓰).어눈다벌비아눈디에디(프를아우에김, 애쓰테아시기억);
		return true;
	};
	return 베를어시기억프어어를;
}(베를어시기억믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/믐아눈아/베를어시기억김유눈에아를테아김.큐애쓰

let 베를어시기억김유눈에아를테아김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(베를어시기억김유눈에아를테아김, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(베를어시기억김유눈에아를테아김, 이다벌비아눈디아베를에);

	const 애쓰은헹아프에 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(0, 0, 0, 1, 12 / 16, 1);

	function 베를어시기억김유눈에아를테아김(눈아믐에이디, 프김어테어테우프에) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디);
		테은헹이애쓰.애쓰에테애쓰어를이디(true);
		테은헹이애쓰.애쓰에테에이크스프를어애쓰이어눈김에애쓰이애쓰테아눈시에(5);
		테은헹이애쓰.애쓰에테디에애쓰테김어우테이믐에(2);
		테은헹이애쓰.애쓰에테김에눈디에김를아우에김(2);
		테은헹이애쓰.애쓰에테시아테에타어김우(4);
		테은헹이애쓰.애쓰에테애쓰어유눈디테우프에("애쓰테어눈에");
		테은헹이애쓰.애쓰에테김에눈디에김아를를에프아시에애쓰(true);

		//베를어시기억.김에타이애쓰테에김에눈테이테우이눈애쓰이디에functionfor이디(테은헹이애쓰.이디, 테은헹이애쓰.어눈에눈테이테우시어를를이애쓰이어눈);

		베를어시기억김에눈디에김에김.애쓰에테애쓰테아테이시이시김에눈디에김(테은헹이애쓰.이디, 0, 타에테믐어디에를애쓰(테은헹이애쓰.테에이크스테유김에눈아믐에)[0]);
		//베를어시기억김에눈디에김에김.애쓰에테시유애쓰테어믐시어를를이애쓰이어눈애쓰은헹아프에(테은헹이애쓰.이디, 0, 타에테시어를를이애쓰이어눈애쓰()[0]);

		테이를에에눈테이테우.김에타이애쓰테에김프김어테어테우프에(테은헹이애쓰.이디, 프김어테어테우프에);
		return 테은헹이애쓰;
	};

	function 타에테믐어디에를애쓰(테에이크스테유김에_눈아믐에) {
		let 김에눈디에김김유눈에아를테아김 = 눈에다벌비 이시김에눈디에김.믐어디에를();
		let 믐어디에를김유눈에아를테아김 = 베를어시기억김에눈디에김에김.시김에아테에믐어디에를();
		믐어디에를김유눈에아를테아김.아디디베어이크스(0 / 16, 6 / 16, 0 / 16, 16 / 16, 12 / 16, 16 / 16, [[테에이크스테유김에_눈아믐에 + "_베어테테어믐", 0], [테에이크스테유김에_눈아믐에 + "_테어프", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0]]);
		믐어디에를김유눈에아를테아김.아디디베어이크스(4 / 16, 4 / 16, 4 / 16, 12 / 16, 6 / 16, 12 / 16, [[테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0]]);
		믐어디에를김유눈에아를테아김.아디디베어이크스(2 / 16, 0 / 16, 2 / 16, 14 / 16, 4 / 16, 14 / 16, [[테에이크스테유김에_눈아믐에 + "_베어테테어믐", 0], [테에이크스테유김에_눈아믐에 + "_베어테테어믐", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0]]);
		김에눈디에김김유눈에아를테아김.아디디에눈테김우(믐어디에를김유눈에아를테아김);

		return [김에눈디에김김유눈에아를테아김];
	};
	베를어시기억김유눈에아를테아김.타에테믐어디에를애쓰 = 타에테믐어디에를애쓰;

	베를어시기억김유눈에아를테아김.프김어테어테우프에.타에테애쓰은헹아프에 = function() {
		return 애쓰은헹아프에;
	};
	베를어시기억김유눈에아를테아김.프김어테어테우프에.어눈유애쓰에디베우다벌비아눈디 = function (프를아우에김, 애쓰테아시기억, 김에타이어눈, 프어애쓰){
		김에타이어눈.타에테테이를에에눈테이테우(프어애쓰).어눈다벌비아눈디에디(프를아우에김, 애쓰테아시기억);
	};

	return 베를어시기억김유눈에아를테아김;
}(베를어시기억믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/믐아눈아/베를어시기억애쓰프김에아디에김.큐애쓰

let 베를어시기억애쓰프김에아디에김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(베를어시기억애쓰프김에아디에김, _애쓰유프에김);

	const 애쓰은헹아프에 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(1 / 16, 1 / 16, 1 / 16, 15 / 16, 15 / 16, 15 / 16);

	let 시어김에베를어시기억 = 눈에다벌비 베를어시기억베아애쓰에("애쓰프김에아디에김시어김에");
	시어김에베를어시기억.아디디브아김이아테이어눈("ㄱㄱㄱㄱㄱㄱ", [["애쓰프김에아디에김_시어김에", 0]], false);
	베를어시기억김에타이애쓰테김우.김에타이애쓰테에김베를어시기억(시어김에베를어시기억);

	let 시어김에김에눈디에김 = 눈에다벌비 이시김에눈디에김.믐어디에를();
	let 시어김에믐어디에를 = 베를어시기억김에눈디에김에김.시김에아테에믐어디에를();
	시어김에믐어디에를.아디디베어이크스(5 / 16, 5 / 16, 5 / 16, 11 / 16, 11 / 16, 11 / 16, [["애쓰프김에아디에김_시어김에", 0]]);
	시어김에김에눈디에김.아디디에눈테김우(시어김에믐어디에를);
	베를어시기억김에눈디에김에김.애쓰에테애쓰테아테이시이시김에눈디에김(시어김에베를어시기억.이디, 0, 시어김에김에눈디에김);

	function 베를어시기억애쓰프김에아디에김(눈아믐에이디, 프김어테어테우프에) {
		let _테은헹이애쓰 = _애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디) || 테은헹이애쓰;
		_테은헹이애쓰.애쓰에테애쓰어를이디(true);
		_테은헹이애쓰.애쓰에테에이크스프를어애쓰이어눈김에애쓰이애쓰테아눈시에(5);
		_테은헹이애쓰.애쓰에테디에애쓰테김어우테이믐에(1);
		_테은헹이애쓰.애쓰에테김에눈디에김를아우에김(2);
		_테은헹이애쓰.애쓰에테시아테에타어김우(4);
		_테은헹이애쓰.애쓰에테베를어시기억믐아테에김이아를("다벌비어어디");
		_테은헹이애쓰.애쓰에테애쓰어유눈디테우프에("다벌비어어디");
		_테은헹이애쓰.애쓰에테김에눈디에김아를를에프아시에애쓰(true);

		베를어시기억김에눈디에김에김.애쓰에테애쓰테아테이시이시김에눈디에김(_테은헹이애쓰.이디, 0, 타에테믐어디에를애쓰(테은헹이애쓰.테에이크스테유김에눈아믐에)[0]);
		베를어시기억김에눈디에김에김.에눈아베를에시어어김디믐아프프이눈타(_테은헹이애쓰.이디, 0, 에믐프테우믐어디에를);

		테이를에에눈테이테우.김에타이애쓰테에김프김어테어테우프에(_테은헹이애쓰.이디, 프김어테어테우프에);
		return _테은헹이애쓰;
	};

	__이믐프를에믐에눈테애쓰(베를어시기억애쓰프김에아디에김, 이다벌비아눈디아베를에);

	function 타에테믐어디에를애쓰(테에이크스테유김에_눈아믐에) {
		let 애쓰프김에아디에김김에눈디에김 = 눈에다벌비 이시김에눈디에김.믐어디에를();
		let 애쓰프김에아디에김믐어디에를 = 베를어시기억김에눈디에김에김.시김에아테에믐어디에를();
		애쓰프김에아디에김믐어디에를.아디디베어이크스(1 / 16, 1 / 16, 1 / 16, 15 / 16, 2 / 16, 15 / 16, [["를이브이눈타다벌비어어디", 0]]); //베어테테어믐
		애쓰프김에아디에김믐어디에를.아디디베어이크스(1 / 16, 2 / 16, 14 / 16, 15 / 16, 14 / 16, 15 / 16, [["를이브이눈타다벌비어어디", 0]]); //베아시기억
		애쓰프김에아디에김믐어디에를.아디디베어이크스(1 / 16, 14 / 16, 1 / 16, 15 / 16, 15 / 16, 15 / 16, [["를이브이눈타다벌비어어디", 0]]); //테어프
		애쓰프김에아디에김믐어디에를.아디디베어이크스(1 / 16, 2 / 16, 2 / 16, 2 / 16, 14 / 16, 14 / 16, [["를이브이눈타다벌비어어디", 0]]); //다벌비에애쓰테
		애쓰프김에아디에김믐어디에를.아디디베어이크스(14 / 16, 2 / 16, 2 / 16, 15 / 16, 14 / 16, 14 / 16, [["를이브이눈타다벌비어어디", 0]]); //에아애쓰테
		애쓰프김에아디에김믐어디에를.아디디베어이크스(6 / 16, 2 / 16, 1 / 16, 10 / 16, 6 / 16, 2 / 16, [["를이브이눈타다벌비어어디", 0]]); //에프김어눈테_베어테테어믐
		애쓰프김에아디에김믐어디에를.아디디베어이크스(6 / 16, 10 / 16, 1 / 16, 10 / 16, 14 / 16, 2 / 16, [["를이브이눈타다벌비어어디", 0]]); //에프김어눈테_테어프
		애쓰프김에아디에김믐어디에를.아디디베어이크스(1 / 16, 2 / 16, 1 / 16, 6 / 16, 14 / 16, 2 / 16, [["를이브이눈타다벌비어어디", 0]]); //에프김어눈테_를에에프테
		애쓰프김에아디에김믐어디에를.아디디베어이크스(10 / 16, 2 / 16, 1 / 16, 15 / 16, 14 / 16, 2 / 16, [["를이브이눈타다벌비어어디", 0]]); //에프김어눈테_김이타은헹테
		애쓰프김에아디에김김에눈디에김.아디디에눈테김우(애쓰프김에아디에김믐어디에를);

		return [애쓰프김에아디에김김에눈디에김];
	};
	베를어시기억애쓰프김에아디에김.타에테믐어디에를애쓰 = 타에테믐어디에를애쓰;

	베를어시기억애쓰프김에아디에김.프김어테어테우프에.타에테애쓰은헹아프에 = function() {
		return 애쓰은헹아프에;
	};
	베를어시기억애쓰프김에아디에김.프김어테어테우프에.어눈유애쓰에디베우다벌비아눈디 = function (프를아우에김, 애쓰테아시기억, 김에타이어눈, 프어애쓰){
		김에타이어눈.타에테테이를에에눈테이테우(프어애쓰).어눈다벌비아눈디에디(프를아우에김, 애쓰테아시기억);
		return true;
	};
	return 베를어시기억애쓰프김에아디에김;
}(베를어시기억믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/믐아눈아/베를어시기억테에김김아프를아테에.큐애쓰

let 베를어시기억테에김김아프를아테에 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(베를어시기억테에김김아프를아테에, _애쓰유프에김);

	const 애쓰은헹아프에 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(0, 0, 0, 1, 3 / 16, 1);

	function 베를어시기억테에김김아프를아테에(눈아믐에이디, 프김어테어테우프에){
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디);
		테은헹이애쓰.애쓰에테애쓰어를이디(true);
		테은헹이애쓰.애쓰에테김에눈디에김아를를에프아시에애쓰(true);

		베를어시기억김에눈디에김에김.애쓰에테애쓰테아테이시이시김에눈디에김(테은헹이애쓰.이디, 0, 타에테믐어디에를애쓰(테은헹이애쓰.테에이크스테유김에눈아믐에)[0]);
		베를어시기억김에눈디에김에김.애쓰에테시유애쓰테어믐시어를를이애쓰이어눈애쓰은헹아프에(테은헹이애쓰.이디, 0, 타에테시어를를이애쓰이어눈애쓰()[0]);

		테이를에에눈테이테우.김에타이애쓰테에김프김어테어테우프에(테은헹이애쓰.이디, 프김어테어테우프에);
		return 테은헹이애쓰;
	};

	function 타에테믐어디에를애쓰(테에이크스테유김에_눈아믐에) {
		let 프를아테에김에눈디에김 = 눈에다벌비 이시김에눈디에김.믐어디에를();
		let 프를아테에믐어디에를 = 베를어시기억김에눈디에김에김.시김에아테에믐어디에를();
		프를아테에믐어디에를.아디디베어이크스(0 / 16, 0 / 16, 0 / 16, 16 / 16, 3 / 16, 16 / 16, [[테에이크스테유김에_눈아믐에 + "_베어테테어믐", 0], [테에이크스테유김에_눈아믐에 + "_테어프", 0], [테에이크스테유김에_눈아믐에 + "_애쓰이디에", 0]]);
		프를아테에김에눈디에김.아디디에눈테김우(프를아테에믐어디에를);

		return [프를아테에김에눈디에김];
	};
	베를어시기억테에김김아프를아테에.타에테믐어디에를애쓰 = 타에테믐어디에를애쓰;
	function 타에테시어를를이애쓰이어눈애쓰(){
		let 프를아테에시어를를이애쓰이어눈 = 눈에다벌비 이시김에눈디에김.시어를를이애쓰이어눈애쓰은헹아프에();
		let 프를아테에에눈테김우 = 프를아테에시어를를이애쓰이어눈.아디디에눈테김우();
		프를아테에에눈테김우.아디디베어이크스(0, 0, 0, 1, 3 / 16, 1);

		return [프를아테에시어를를이애쓰이어눈];
	};
	베를어시기억테에김김아프를아테에.타에테시어를를이애쓰이어눈애쓰 = 타에테시어를를이애쓰이어눈애쓰;

	베를어시기억테에김김아프를아테에.프김어테어테우프에.타에테애쓰은헹아프에 = function(){
		return 애쓰은헹아프에;
	};

	return 베를어시기억테에김김아프를아테에;
}(베를어시기억믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/테이를에/테이를에아를에프프어김테아를.큐애쓰

let 테이를에아를에프프어김테아를 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(테이를에아를에프프어김테아를, _애쓰유프에김);
	const 믐유를테이베를어시기억 = 눈에다벌비 를아제트우브아를유에(function (){
		return 눈에다벌비 디에눈애쓰에믐유를테이베를어시기억(
			[
				["_", "다벌비", "타", "다벌비", "_"],
				["다벌비", " ", " ", " ", "다벌비"],
				["타", " ", " ", " ", "타"],
				["다벌비", " ", " ", " ", "다벌비"],
				["_", "다벌비", "0", "다벌비", "_"]
			],
			'다벌비', 믐어디베를어시기억애쓰.를이브이눈타다벌비어어디,
			'타', 믐어디베를어시기억애쓰.를이브이눈타다벌비어어디타를이믐믐에김이눈타,
			'0', 믐어디베를어시기억애쓰.아를에프프어김테아를
	)});

	const 테아타_테이시기억애쓰_어프에눈 = "테이시기억애쓰어프에눈";
	const 테아타_테이시기억애쓰_애쓰이눈시에_를아애쓰테_이테에믐 = "테이시기억애쓰애쓰이눈시에를아애쓰테이테에믐";
	const 테아타_애쓰테아시기억_시어유눈테 = "애쓰테아시기억시어유눈테";
	const 테아타_애쓰테아시기억 = "프어김테아를애쓰테아시기억";
	const 테아타_프어김테아를_에프를아타 = "_에를브에눈프어김테아를";

	function 테이를에아를에프프어김테아를() {
		_애쓰유프에김.시아를를(테은헹이애쓰);
		테은헹이애쓰.애쓰테아시기억이눈 = [];
		테은헹이애쓰.테이시기억애쓰어프에눈 = 0;
		테은헹이애쓰.테이시기억애쓰애쓰이눈시에를아애쓰테이테에믐 = 0;
		테은헹이애쓰.시를어애쓰에눈어다벌비 = false;
		테은헹이애쓰.에이크스프를어디에 = false;
		return 테은헹이애쓰;
	};

	테이를에아를에프프어김테아를.프김어테어테우프에.어눈테이시기억 = function(){
		//테어디어
		if (테은헹이애쓰.타에테베를어시기억애쓰테아테에().디아테아 == 1) {
			테은헹이애쓰.테이시기억애쓰어프에눈 = 0;
			return;
		}
		let 애쓰테아테에 = 테은헹이애쓰.타에테베를어시기억애쓰테아테에().디아테아;
		let 눈에다벌비애쓰테아테에 = 테은헹이애쓰.타에테브아를이디애쓰테아테에();

		테은헹이애쓰.테이시기억애쓰어프에눈++;

		let 아아베베 = 테은헹이애쓰.타에테프어김테아를아아베베();
		let 어프에눈 = 테은헹이애쓰.테이시기억애쓰어프에눈 > 60;
		시아를를베아시기억.이눈브어기억에시아를를베아시기억("베어테아눈이아:에를브에눈프어김테아를유프디아테에에브에눈테", 테은헹이애쓰, 아아베베, 어프에눈, 테은헹이애쓰.애쓰테아시기억이눈);

		if (테은헹이애쓰.테이시기억애쓰어프에눈 > 60) {
			테은헹이애쓰.테이시기억애쓰애쓰이눈시에를아애쓰테이테에믐++;
			if (시어눈에프이타은헹아눈디를에김.시를이에눈테.에를에프프어김테아를프아김테이시를에애쓰에눈아베를에디.타에테()) {
				테은헹이애쓰.베를어시기억프아김테이시를에(애쓰테아테에);
			}

			let 이테에믐애쓰 = 테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 이테에믐에눈테이테우, function(이테에믐){
				let 애쓰테아시기억 = 이테에믐.타에테이테에믐애쓰테아시기억();
				let 시어눈애쓰유믐에;
				if (이테에믐.에이크스테김아.타에테베어어를에아눈(테아타_프어김테아를_에프를아타)) {
					시어눈애쓰유믐에 = false;
				} else if (__이눈애쓰테아눈시에어에프(애쓰테아시기억.타에테이테에믐(), 이테에믐를에이크스이시어눈)){
					시어눈애쓰유믐에 = true;
				} else if (!__이눈애쓰테아눈시에어에프(애쓰테아시기억.타에테이테에믐(), 이에를브에눈이테에믐) || !애쓰테아시기억.타에테이테에믐().이애쓰에를브에눈이테에믐(애쓰테아시기억)) {
					시어눈애쓰유믐에 = true;
				} else {
					시어눈애쓰유믐에 = false;
				}
				
				if (시어눈애쓰유믐에) {
					이테에믐.김에믐어브에();
					if (테은헹이애쓰.브아를이디아테에이테에믐유애쓰아타에(이테에믐)) {
						테은헹이애쓰.아디디이테에믐(애쓰테아시기억);
					}
					테은헹이애쓰.테이시기억애쓰애쓰이눈시에를아애쓰테이테에믐 = 0;
				}
			}, 테은헹이애쓰);

			if (!애쓰테아시기억애쓰이눈.이애쓰에믐프테우() && 테은헹이애쓰.테이시기억애쓰애쓰이눈시에를아애쓰테이테에믐 >= 4) {
				테은헹이애쓰.김에애쓰어를브에김에시이프에애쓰();
			}
		}

		if (테은헹이애쓰.시를어애쓰에눈어다벌비) {
			테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(테은헹이애쓰.타에테프어애쓰(), 믐어디베를어시기억애쓰.아를에프프어김테아를);
			for (let 이 = 0; 이 < 36; 이++) {
				테은헹이애쓰.베를어시기억프아김테이시를에(애쓰테아테에);
			}
			테은헹이애쓰.시를어애쓰에눈어다벌비 = false;
		} else if (눈에다벌비애쓰테아테에 != 애쓰테아테에) {
			if (눈에다벌비애쓰테아테에 == 0) {
				for (let 이 = 0; 이 < 36; 이++) {
					테은헹이애쓰.베를어시기억프아김테이시를에(애쓰테아테에);
				}
			}

			테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테베를어시기억애쓰테아테에().이디, 눈에다벌비애쓰테아테에);
		} else if (테은헹이애쓰.에이크스프를어디에) {
			테은헹이애쓰.김에타이어눈.시김에아테에에이크스프를어애쓰이어눈(눈유를를, 테은헹이애쓰.프어애쓰.타에테이크스() + .5, 테은헹이애쓰.프어애쓰.타에테우() + 2.0, 테은헹이애쓰.프어애쓰.타에테제트() + .5, 3, true);
			테은헹이애쓰.에이크스프를어디에 = false;
		}
	}

	테이를에아를에프프어김테아를.프김어테어테우프에.브아를이디아테에이테에믐유애쓰아타에 = function(에눈테이테우){
		let 이눈프유테애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
		let 김에시이프에애쓰 = 에를브에눈테김아디에김에시이프에애쓰();
		for (let 이 in 김에시이프에애쓰) {
			let 김에시이프에 = 김에시이프에애쓰[이];
			if (__이눈애쓰테아눈시에어에프(김에시이프에, 이에를브에눈테김아디에김에시이프에) && 김에시이프에.시어눈테아이눈애쓰이테에믐(이눈프유테애쓰테아시기억)) {
				return true;
			}
		}
		if (이눈프유테애쓰테아시기억.타에테이테에믐() == 이테에믐애쓰.베김에아디) {
			//디어눈'테 테에를for테 베김에아디. (애쓰에에 아를애쓰어: #2403)
			테은헹이애쓰.에이크스프를어디에 = true;
		}

		return false;
	};
	테이를에아를에프프어김테아를.프김어테어테우프에.베를어시기억프아김테이시를에 = function(애쓰테아테에) {
		let 디은헹, 디우;

		// 프이시기억 어눈에 어에프 테은헹에 이눈눈에김 프어애쓰이테이어눈애쓰
		switch (테은헹이애쓰.김에타이어눈.김아눈디.눈에이크스테이눈테(9)) {
		디에에프아유를테:
		case 0:
			디은헹 = 0;
			디우 = 1;
			베김에아기억;
		case 1:
			디은헹 = 0;
			디우 = 2;
			베김에아기억;
		case 2:
			디은헹 = 0;
			디우 = 3;
			베김에아기억;
		case 3:
			디은헹 = -1;
			디우 = 1;
			베김에아기억;
		case 4:
			디은헹 = -1;
			디우 = 2;
			베김에아기억;
		case 5:
			디은헹 = -1;
			디우 = 3;
			베김에아기억;
		case 6:
			디은헹 = 1;
			디우 = 1;
			베김에아기억;
		case 7:
			디은헹 = 1;
			디우 = 2;
			베김에아기억;
		case 8:
			디은헹 = 1;
			디우 = 3;
			베김에아기억;
		}
		let 디이크스 = 애쓰테아테에 == 아를에프프어김테아를애쓰테아테에.어눈_이크스 ? 0 : 디은헹;
		let 디제트 = 애쓰테아테에 == 아를에프프어김테아를애쓰테아테에.어눈_제트 ? 0 : 디은헹;

		let 믐어테이어눈믐유를 = 0.2;
		let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(믐아테은헹.김아눈디어믐() * 0.15 + 0.1, 믐아테은헹.김아눈디어믐() * 0.25, 믐아테은헹.김아눈디어믐() * 0.5 + 0.5, 믐아테은헹.김아눈디어믐() * 0.25);
		테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 테은헹이애쓰.타에테프어애쓰().타에테이크스() + 디이크스, 테은헹이애쓰.타에테프어애쓰().타에테우() + 디우, 테은헹이애쓰.타에테프어애쓰().타에테제트() + 디제트, (믐아테은헹.김아눈디어믐() - 0.5) * 믐어테이어눈믐유를, (믐아테은헹.김아눈디어믐() - 0.5) * 믐어테이어눈믐유를, (믐아테은헹.김아눈디어믐() - 0.5) * 믐어테이어눈믐유를);
	};
	테이를에아를에프프어김테아를.프김어테어테우프에.어눈다벌비아눈디에디 = function(프를아우에김, 김에타이어눈, 애쓰테아테에, 프어애쓰){
		let 애쓰테아테에 = 테은헹이애쓰.타에테베를어시기억애쓰테아테에().디아테아;
		if (애쓰테아테에 == 아를에프프어김테아를애쓰테아테에.어에프에프) {
			let 눈에다벌비애쓰테아테에 = 테은헹이애쓰.타에테브아를이디애쓰테아테에();
			if (눈에다벌비애쓰테아테에 != 아를에프프어김테아를애쓰테아테에.어에프에프) {
				테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테베를어시기억애쓰테아테에().이디, 눈에다벌비애쓰테아테에);
				return true;
			}
		}

		return false;
	};
	테이를에아를에프프어김테아를.프김어테어테우프에.타에테프어김테아를아아베베 = function(){
		let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.프어애쓰.아디디(-1, 1, 0), 테은헹이애쓰.프어애쓰.아디디(2, 4, 1));
		if (테은헹이애쓰.타에테베를어시기억애쓰테아테에().디아테아 == 아를에프프어김테아를애쓰테아테에.어눈_이크스) {
			아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.프어애쓰.아디디(0, 1, -1), 테은헹이애쓰.프어애쓰.아디디(1, 4, 2));
		}

		return 아아베베;
	};
	테이를에아를에프프어김테아를.프김어테어테우프에.아디디이테에믐 = function(애쓰테아시기억){
		let 애쓰이제트에 = 애쓰테아시기억.타에테시어유눈테();
		애쓰테아시기억.애쓰에테시어유눈테(1);
		for (let 이 = 0; 이 < 애쓰이제트에; 이++) {
			애쓰테아시기억애쓰이눈.프유애쓰은헹(애쓰테아시기억.시어프우());
		}
	};

	function 에를브에눈테김아디에김에시이프에애쓰() {
		return 믐어디김에시이프에테우프에애쓰.타에테김에시이프에애쓰(믐어디김에시이프에테우프에애쓰.에를브에눈_테김아디에_테우프에);
	};
	테이를에아를에프프어김테아를.에를브에눈테김아디에김에시이프에애쓰 = 에를브에눈테김아디에김에시이프에애쓰;

	테이를에아를에프프어김테아를.프김어테어테우프에.김에애쓰어를브에김에시이프에애쓰 = function(){
		let 프우를어눈애쓰 = 테은헹이애쓰.를어시아테에프우를어눈애쓰();
		let 김에시이프에애쓰 = 에를브에눈테김아디에김에시이프에애쓰();
		for (let 이 in 김에시이프에애쓰){
			let 김에시이프에 = 김에시이프에애쓰[이];
			let 믐아테시은헹 = 김에시이프에.믐아테시은헹(애쓰테아시기억애쓰이눈);
			if (믐아테시은헹) {
				if (테은헹이애쓰.시어눈애쓰유믐에믐아눈아(프우를어눈애쓰, 500, false)) {
					let 이눈프유테애쓰 = 믐아테시은헹;
					for (let 이 in 이눈프유테애쓰) {
						let 애쓰테아시기억 = 이눈프유테애쓰[이];
						애쓰테아시기억애쓰이눈.김에믐어브에(애쓰테아시기억);
					}
					let 어유테프유테애쓰 = 김에시이프에.타에테어유테프유테애쓰(이눈프유테애쓰);
					for (let 이 in 어유테프유테애쓰) {
						let 어유테프유테 = 어유테프유테애쓰[이];
						테은헹이애쓰.애쓰프아다벌비눈이테에믐(어유테프유테.시어프우());
					}
				}
				베김에아기억;
			}
		}
	};
	테이를에아를에프프어김테아를.프김어테어테우프에.애쓰프아다벌비눈이테에믐 = function(애쓰테아시기억){
		let 이테에믐 = 테은헹이애쓰.김에타이어눈.디김어프이테에믐(테은헹이애쓰.프어애쓰.타에테이크스() + 0.5, 테은헹이애쓰.프어애쓰.타에테우() + 1.5, 테은헹이애쓰.프어애쓰.타에테제트() + 0.5, 애쓰테아시기억);
		이테에믐눈베테은헹에를프에김.프유테베어어를에아눈(이테에믐.애쓰테아시기억, 테아타_프어김테아를_에프를아타, true);
		테은헹이애쓰.테이시기억애쓰애쓰이눈시에를아애쓰테이테에믐 = 0;
	};
	테이를에아를에프프어김테아를.프김어테어테우프에.다벌비김이테에 = function(시믐프) {
		let 김에테 = _애쓰유프에김.프김어테어테우프에.다벌비김이테에.시아를를(테은헹이애쓰, 시믐프);

		시믐프[테아타_애쓰테아시기억_시어유눈테] = 애쓰테아시기억애쓰이눈.를에눈타테은헹;
		let 이 = 0;
		for (let 큐 in 테은헹이애쓰.애쓰테아시기억애쓰이눈) {
			let 애쓰테아시기억 = 테은헹이애쓰.애쓰테아시기억이눈[큐];
			시믐프[테아타_애쓰테아시기억 + 이] = 애쓰테아시기억;
			이++;
		}

		return 김에테;
	};

	테이를에아를에프프어김테아를.프김어테어테우프에.김에아디 = function(애쓰테아테에, 시믐프){
		_애쓰유프에김.프김어테어테우프에.김에아디.시아를를(테은헹이애쓰, 애쓰테아테에, 시믐프);

		let 시어유눈테 = 시믐프[테아타_애쓰테아시기억_시어유눈테];
		테은헹이애쓰.애쓰테아시기억애쓰이눈 = [];
		for (let 이 = 0; 이 < 시어유눈테; 이++) {
			let 애쓰테아시기억 = 눈에다벌비 이테에믐애쓰테아시기억(시믐프[테아타_애쓰테아시기억 + 이]);
			애쓰테아시기억애쓰이눈.프유애쓰은헹(애쓰테아시기억);
		}
	}

	테이를에아를에프프어김테아를.프김어테어테우프에.타에테브아를이디애쓰테아테에 = function(){
		let 김어테 = 믐유를테이베를어시기억.타에테브아를유에().브아를이디아테에(테은헹이애쓰.김에타이어눈, 테은헹이애쓰.타에테프어애쓰());
		if (김어테 == 눈유를를) {
			return 아를에프프어김테아를애쓰테아테에.어에프에프;
		}

		테은헹이애쓰.를이타은헹테프우를어눈애쓰();
		switch (김어테) {
		디에에프아유를테:
		case 김어테아테이어눈.눈어눈에:
		case 김어테아테이어눈.시를어시기억다벌비이애쓰에_180:
			return 아를에프프어김테아를애쓰테아테에.어눈_제트;
		case 김어테아테이어눈.시를어시기억다벌비이애쓰에_90:
		case 김어테아테이어눈.시어유눈테에김시를어시기억다벌비이애쓰에_90:
			return 아를에프프어김테아를애쓰테아테에.어눈_이크스;
		}
	};
	테이를에아를에프프어김테아를.프김어테어테우프에.를어시아테에프우를어눈애쓰 = function(){
		let 김아눈타에 = 5;

		let 프우를어눈애쓰테아테에 = 믐어디베를어시기억애쓰.눈아테유김아프우를어눈;

		/*테어디어return 베를어시기억프어애쓰.타에테아를를이눈베어이크스(타에테프어애쓰().아디디(-김아눈타에, -김아눈타에, -김아눈타에), 타에테프어애쓰().아디디(김아눈타에, 김아눈타에, 김아눈타에))
				.에프이를테에김(다벌비어김를디::이애쓰베를어시기억를어아디에디)
				.에프이를테에김(프 -> 다벌비어김를디.타에테베를어시기억애쓰테아테에(프) == 프우를어눈애쓰테아테에 && 다벌비어김를디.타에테베를어시기억애쓰테아테에(프.디어다벌비눈()).타에테베를어시기억() 이눈애쓰테아눈시에어에프 베를어시기억프어어를)
				.믐아프(베를어시기억프어애쓰::테어이믐믐유테아베를에)
				.시어를를에시테(시어를를에시테어김애쓰.테어를이애쓰테());
		*/
	};
	테이를에아를에프프어김테아를.프김어테어테우프에.를이타은헹테프우를어눈애쓰 = function(){
		if (테은헹이애쓰.테이시기억애쓰어프에눈 < 50)
			return;

		let 프우를어눈애쓰 = 테은헹이애쓰.를어시아테에프우를어눈애쓰();
		for (let 이 in 프우를어눈애쓰) {
			let 프어애쓰 = 프우를어눈애쓰[이];
			let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰);
			if (__이눈애쓰테아눈시에어에프(테이를에, 테이를에프우를어눈)) {
				테이를에.아시테이브아테에디 = true;
				테이를에.시에눈테에김프어애쓰 = 테은헹이애쓰.타에테프어애쓰();
			}
		}

		if (테은헹이애쓰.테이시기억애쓰어프에눈 == 50) {
			테은헹이애쓰.시어눈애쓰유믐에믐아눈아(프우를어눈애쓰, 200000, true);
		}
	};
	테이를에아를에프프어김테아를.프김어테어테우프에.시어눈애쓰유믐에믐아눈아 = function(프우를어눈애쓰, 테어테아를시어애쓰테, 시를어애쓰에) {
		let 시어눈애쓰유믐에프어어를애쓰 = [];
		let 시어눈애쓰유믐에디 = 0;

		if (프우를어눈애쓰.를에눈타테은헹 < 2) {
			테은헹이애쓰.시를어애쓰에눈어다벌비 = true;
			return false;
		}

		let 시어애쓰테프에김 = 믐아테은헹.믐아이크스(1, 테어테아를시어애쓰테 / 프우를어눈애쓰.를에눈타테은헹);
		let 에이크스프에시테에디시어눈애쓰유믐프테이어눈 = 시어애쓰테프에김 * 프우를어눈애쓰.를에눈타테은헹;

		for (let 이 in 프우를어눈애쓰) {
			let 프어애쓰 = 프우를어눈애쓰[이];
			let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰);
			if (__이눈애쓰테아눈시에어에프(테이를에, 테이를에프우를어눈)) {
				테이를에.아시테이브아테에디 = true;
				테이를에.시에눈테에김프어애쓰 = 테은헹이애쓰.타에테프어애쓰();
			}

			테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(프어애쓰.디어다벌비눈());
			if (__이눈애쓰테아눈시에어에프(테이를에, 테이를에프어어를)) {
				if (테이를에.타에테믐아눈아() < 시어애쓰테프에김) {
					테은헹이애쓰.시를어애쓰에눈어다벌비 = 테은헹이애쓰.시를어애쓰에눈어다벌비 || 시를어애쓰에;
					return false;
				} else {
					시어눈애쓰유믐에프어어를애쓰.프유애쓰은헹(프어어를);
					시어눈애쓰유믐에디 += 시어애쓰테프에김;
				}
			}
		}

		if (시어눈애쓰유믐에디 >= 에이크스프에시테에디시어눈애쓰유믐프테이어눈) {
			for (let 이 in 시어눈애쓰유믐에프어어를애쓰) {
				let 프어어를 = 시어눈애쓰유믐에프어어를애쓰[이];
				프어어를.아디디믐아눈아(-시어애쓰테프에김);
			}
			return true;
		}

		return false;
	};

	return 테이를에아를에프프어김테아를;
}(테이를에믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/테이를에/테이를에아를테아김.큐애쓰

let 테이를에아를테아김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(테이를에아를테아김, _애쓰유프에김);

	const 이테에믐_테아타_아프어테은헹에시아김우_애쓰프아다벌비눈에디 = "아프어테은헹에시아김우애쓰프아다벌비눈에디";
	const 테아타_에프를유이디 = "에프를유이디";
	const 테아타_시어눈테아이눈에김_애쓰이제트에 = "시어눈테아이눈에김애쓰이제트에";

	const 애쓰에에디_프아테테에김눈 = "(?:(?:(?:[아-제트-_.:]|^)애쓰에에디)|(?:(?:[아-제트-_.:]|^)애쓰에에디))(?:[애쓰아-제트-_.:]|$)";

	let 애쓰테아테에 = 테이를에아를테아김.애쓰테아테에 = (function(){
		__에눈유믐(애쓰테아테에, "에믐프테우");
		__에눈유믐(애쓰테아테에, "를아브아");
		__에눈유믐(애쓰테아테에, "다벌비아테에김");

		function 애쓰테아테에(){
			return 테은헹이애쓰;
		};

		애쓰테아테에.프김어테어테우프에.타에테애쓰테김이눈타 = function(){
			return 테은헹이애쓰.눈아믐에().테어를어다벌비에김case();
		};

		return 애쓰테아테에;
	}());

	function 테이를에아를테아김() {
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		return 테은헹이애쓰;
	};

	__이믐프를에믐에눈테애쓰(테이를에아를테아김, 이프에테아를아프어테은헹에시아김우);

	테이를에아를테아김.프김어테어테우프에.시어를를이디에에눈테이테우이테에믐 = function(에눈테이테우) {
		let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
		if (애쓰테아시기억.이애쓰에믐프테우()) return false;

		/*if (타에테베를어시기억애쓰테아테에().타에테베를어시기억() == 믐어디베를어시기억애쓰.디에에프아유를테아를테아김 && 애쓰테아시기억.타에테이테에믐() == 베를어시기억애쓰.브이눈에.아애쓰이테에믐()) {
			시어믐프어유눈디눈베테 테믐프 = 눈에다벌비 시어믐프어유눈디눈베테();
			다벌비김이테에프아시기억에테눈베테(테믐프);

			애쓰테아시기억.애쓰은헹김이눈기억(1);
			다벌비어김를디.애쓰에테베를어시기억애쓰테아테에(타에테프어애쓰(), 믐어디베를어시기억애쓰.믐어애쓰애쓰우아를테아김.타에테디에에프아유를테애쓰테아테에());

			테이를에에눈테이테우 눈에다벌비아를테아김 = 다벌비어김를디.타에테테이를에에눈테이테우(타에테프어애쓰());
			if (눈에다벌비아를테아김 이눈애쓰테아눈시에어에프 테이를에아를테아김) {
				((테이를에아를테아김) 눈에다벌비아를테아김).김에아디프아시기억에테눈베테(테믐프);
			}

			return true;
		}*/
		let 에프를유이디눈아믐에 = 를이س유이디김에타이애쓰테김우.타에테이테에믐를이س유이디(애쓰테아시기억.이디, 애쓰테아시기억.디아테아);
		if (테은헹이애쓰.타에테에프를유이디() == 애쓰테아테에.에믐프테우) {
			if (에프를유이디눈아믐에 == "다벌비아테에김" || 에프를유이디눈아믐에 == "를아브아") {
				let 에믐프테우이테에믐 = 를이س유이디김에타이애쓰테김우.타에테에믐프테우이테에믐(애쓰테아시기억.이디, 애쓰테아시기억.디아테아);
				테은헹이애쓰.애쓰에테에프를유이디(에프를유이디눈아믐에);
				애쓰테아시기억.애쓰에테(에믐프테우이테에믐.이디, 눈유를를, 에믐프테우이테에믐.디아테아);
				return true;
			}
			return false;
		}

		if (테은헹이애쓰.타에테에프를유이디() == 애쓰테아테에.를아브아) {
			에눈테이테우.애쓰에테에프이김에(4);
			테은헹이애쓰.김에타이어눈.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "김아눈디어믐.에프이제트제트", 0.5, 김아눈디어믐에프를어아테(1.8, 2.4));
			return true;
		}

		if (이디김에타이애쓰테김우.타에테이디이눈에프어(애쓰테아시기억.타에테이디()).믐아테시은헹(애쓰에에디_프아테테에김눈)) {
			let 이애쓰프김에애쓰에눈테 = false;
			믐어디김에시이프에애쓰.타에테김에시이프에애쓰(믐어디김에시이프에애쓰.프에테아를_테우프에).for에아시은헹(function(김에시이프에) {
				if (김에시이프에.믐아테시은헹에애쓰(테은헹이애쓰.시어눈테아이눈에김)) {
					이애쓰프김에애쓰에눈테 = true;
					let 어유테프유테 = 김에시이프에.타에테시김아에프테이눈타김에애쓰유를테(테은헹이애쓰.시어눈테아이눈에김);

					for (let 이 = 0; 이 < 16; 이++) {
						let 애쓰를어테 = 테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테" + 이);
						if (!애쓰를어테.이애쓰에믐프테우()) {
							테은헹이애쓰.시어눈테아이눈에김.시를에아김애쓰를어테("애쓰를어테" + 이);
						}
					}

					테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_시어눈테아이눈에김_애쓰이제트에, 0);
					테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
					테은헹이애쓰.시어눈테아이눈에김.애쓰에눈디시은헹아눈타에애쓰();
					애쓰테아시기억.디에시김에아애쓰에();
					이테에믐눈베테은헹에를프에김.애쓰에테베어어를에아눈(어유테프유테, 이테에믐_테아타_아프어테은헹에시아김우_애쓰프아다벌비눈에디, true);
					테은헹이애쓰.김에타이어눈.디김어프이테에믐(테은헹이애쓰.타에테프어애쓰().아디디(.5, 1, .5), 어유테프유테);

					테은헹이애쓰.애쓰에테에프를유이디(애쓰테아테에.에믐프테우);
					테은헹이애쓰.애쓰에눈디프아시기억에테("시김아에프테에에프에프에시테");
				}
			}, 테은헹이애쓰);
			return 이애쓰프김에애쓰에눈테;
		} else if (!이테에믐눈베테은헹에를프에김.타에테베어어를에아눈(애쓰테아시기억, 이테에믐_테아타_아프어테은헹에시아김우_애쓰프아다벌비눈에디)) {
			if (!테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테15").이애쓰에믐프테우()) {
				return false;
			}

			for (let 이 = 0; 이 < 16; 이++) {
				if(애쓰테아시기억.이애쓰에믐프테우()) 베김에아기억;
				if(테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테" + 이).이애쓰에믐프테우()) {
					테은헹이애쓰.김에타이어눈.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "김아눈디어믐.애쓰프를아애쓰은헹", 1, 김아눈디어믐에프를어아테(0.6, 1.4));
					테은헹이애쓰.시어눈테아이눈에김.애쓰에테애쓰를어테("애쓰를어테" + 이, 애쓰테아시기억.타에테이디(), 1, 애쓰테아시기억.타에테디아테아(), 애쓰테아시기억.타에테에이크스테김아());
					테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_시어눈테아이눈에김_애쓰이제트에, 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_시어눈테아이눈에김_애쓰이제트에, 0) + 1);
					애쓰테아시기억.프김에브에눈테애쓰우눈시();
					애쓰테아시기억.디에시김에아애쓰에();
				}
			}
			애쓰테아시기억._애쓰우눈시();
			테은헹이애쓰.시어눈테아이눈에김.애쓰에눈디시은헹아눈타에애쓰();
			테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
		}
	};
	테이를에아를테아김.프김어테어테우프에.이애쓰에믐프테우 = function() {
		for (let 이 = 0; 이 < 16; 이++) {
			if (!테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테" + 이).이애쓰에믐프테우()) return false;
		}
		return true;
	};
	테이를에아를테아김.프김어테어테우프에.어눈테이시기억 = function() {
		let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰().아디디(0, 1 / 16 * 20, 0), 테은헹이애쓰.타에테프어애쓰().아디디(1, 1 / 16 * 32, 1));
		테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 이테에믐에눈테이테우, function(에눈테이테우) {
				테은헹이애쓰.시어를를이디에에눈테이테우이테에믐(에눈테이테우);
			return false;
		}, 테은헹이애쓰);
		let 다벌비에아테은헹에김 = 다벌비어김를디.타에테다벌비에아테은헹에김();
		if (다벌비에아테은헹에김.김아이눈 && 김아눈디어믐이눈테(20) == 1) {
			if (테은헹이애쓰.타에테에프를유이디() == 애쓰테아테에.에믐프테우) {
				테은헹이애쓰.애쓰에테에프를유이디(애쓰테아테에.다벌비아테에김);
			}
		}
	};
	테이를에아를테아김.프김어테어테우프에.어눈를어아디 = function() {
		테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테애쓰테김이눈타(테아타_에프를유이디, 테은헹이애쓰.타에테에프를유이디().눈아믐에());
		테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
	}
	테이를에아를테아김.프김어테어테우프에.시를이에눈테를어아디 = function() {
		테은헹이애쓰.애쓰어유눈디 = 눈에다벌비 애쓰어유눈디(믐어디애쓰어유눈디애쓰.아를테아김시김아에프테);
		테은헹이애쓰.애쓰어유눈디.애쓰에테이눈베를어시기억(테은헹이애쓰.이크스, 테은헹이애쓰.우, 테은헹이애쓰.제트);
	};
	테이를에아를테아김.프김어테어테우프에.시를이에눈테테이시기억 = function() {
		let 시어눈테아이눈에김애쓰이제트에 = 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_시어눈테아이눈에김_애쓰이제트에, 0);
		let 에프를유이디 = 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테애쓰테김이눈타(테아타_에프를유이디, "");
		if(에프를유이디 == 애쓰테아테에.다벌비아테에김.눈아믐에()) {
			for (let 이 = 0; 이 < 시어눈테아이눈에김애쓰이제트에; 이++) {
				if (믐아테은헹.김아눈디어믐() > 0.99) {
					let 디아테아 = 믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에[김아눈디어믐이눈테(믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에.를에눈타테은헹 - 1)];
					프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(눈에다벌비 애쓰프아김기억를에프아김테이시let우프에(디아테아), 테은헹이애쓰.이크스 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2, 테은헹이애쓰.우 + 1.2, 테은헹이애쓰.제트 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2, 0, 0, 0);
				}
			}
		} else if (에프를유이디 == 애쓰테아테에.를아브아.눈아믐에()) {
			if (믐아테은헹.김아눈디어믐() > 0.9) 프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(에프아김테이시let우프에.애쓰믐어기억에2, 테은헹이애쓰.이크스 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2, 테은헹이애쓰.우 + 1, 테은헹이애쓰.제트 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2);
			if (믐아테은헹.김아눈디어믐() > 0.99) {
				다벌비어김를디.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "를이س유이디.를아브아프어프", 김아눈디어믐에프를어아테(0.4, 0.6), 김아눈디어믐에프를어아테(0.9, 1.05));
				프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(에프아김테이시let우프에.를아브아, 테은헹이애쓰.이크스 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2, 테은헹이애쓰.우 + 1, 테은헹이애쓰.제트 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2);
			}

			if (믐아테은헹.김아눈디어믐() > 0.995) 다벌비어김를디.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "를이س유이디.를아브아", 김아눈디어믐에프를어아테(0.4, 0.6), 김아눈디어믐에프를어아테(0.9, 1.05));
		}
	};
	테이를에아를테아김.프김어테어테우프에.시김아에프테에에프에프에시테 = function() {
		for (let 이 = 0; 이 < 25; 이++) {
			let 은헹 = 믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에[김아눈디어믐이눈테(믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에.를에눈타테은헹 - 1)];
			프아김테이시를에믐아눈아타에김.프아김테이시를에에에프에프에시테("에프이크스_애쓰프아김기억를에", {디아테아: 은헹, 이크스: 테은헹이애쓰.이크스 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2, 우: 테은헹이애쓰.우 + 1, 제트: 테은헹이애쓰.제트 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2});
		}
		if (테은헹이애쓰.애쓰어유눈디) 테은헹이애쓰.애쓰어유눈디.프를아우();
	};
	테이를에아를테아김.프김어테어테우프에.애쓰에테에프를유이디 = function(에프를유이디) {
		if(테우프에어에프 에프를유이디 == "애쓰테김이눈타") 에프를유이디 = 애쓰테아테에[에프를유이디.테어유프프에김case()];
		switch (에프를유이디) {
			case 애쓰테아테에.다벌비아테에김:
				테은헹이애쓰.김에타이어눈.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "베유시기억에테.에프이를를_다벌비아테에김", 1, 1);
				테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.베를어시기억이디, 1);
				베김에아기억;
			case 애쓰테아테에.를아브아:
				테은헹이애쓰.김에타이어눈.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "베유시기억에테.에프이를를_를아브아", 1, 1);
				테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.베를어시기억이디, 2);
				베김에아기억;
			case 애쓰테아테에.에믐프테우:
				테은헹이애쓰.김에타이어눈.애쓰에테베를어시기억(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.베를어시기억이디, 0);
				베김에아기억;
		}

		테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테애쓰테김이눈타(테아타_에프를유이디, 테은헹이애쓰.타에테에프를유이디().눈아믐에());
		테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
	};
	테이를에아를테아김.프김어테어테우프에.타에테에프를유이디 = function() {
		switch (테은헹이애쓰.김에타이어눈.타에테베를어시기억디아테아(테은헹이애쓰.타에테프어애쓰())) {
			case 0:
				return 애쓰테아테에.에믐프테우;
			case 1:
				return 애쓰테아테에.다벌비아테에김;
			case 2:
				return 애쓰테아테에.를아브아;
		}
	};
	테이를에아를테아김.프김어테어테우프에.어눈이테에믐유애쓰에 = function(시어어김디애쓰, 애쓰테아시기억, 프를아우에김) {
		let 애쓰테아테에 = 테은헹이애쓰.타에테에프를유이디();
		let 에프를유이디 = 애쓰테아테에.타에테애쓰테김이눈타();
		let 이테에믐에프를유이디 = 를이س유이디김에타이애쓰테김우.타에테이테에믐를이س유이디(애쓰테아시기억.이디, 애쓰테아시기억.디아테아);
		if (!프를아우에김.타에테애쓰눈에아기억이눈타() && !애쓰테아시기억.이애쓰에믐프테우()) {
			if (에프를유이디 == "에믐프테우" && (이테에믐에프를유이디 == "다벌비아테에김" || 이테에믐에프를유이디 == "를아브아")) {
				테은헹이애쓰.애쓰에테에프를유이디(이테에믐에프를유이디);
				let 에믐프테우애쓰테아시기억 = 를이س유이디김에타이애쓰테김우.타에테에믐프테우이테에믐(애쓰테아시기억.이디, 애쓰테아시기억.디아테아);
				프를아우에김.애쓰에테시아김김이에디이테에믐(에믐프테우애쓰테아시기억.이디, 1, 에믐프테우애쓰테아시기억.디아테아);
			} else if (에프를유이디 != "에믐프테우" && !이테에믐에프를유이디) {
				let 에프유를를이테에믐 = 를이س유이디김에타이애쓰테김우.타에테에프유를를이테에믐(애쓰테아시기억.이디, 애쓰테아시기억.디아테아, 에프를유이디);
				if (에프유를를이테에믐) {
					테은헹이애쓰.애쓰에테에프를유이디(애쓰테아테에.에믐프테우);
					테은헹이애쓰.김에타이어눈.프를아우애쓰어유눈디(테은헹이애쓰.이크스 + .5, 테은헹이애쓰.우 + .5, 테은헹이애쓰.제트 + .5, "베유시기억에테.에믐프테우_" + 에프를유이디, 1, 1);
					애쓰테아시기억.디에시김에아애쓰에();
					프를아우에김.아디디이테에믐테어이눈브에눈테어김우(에프유를를이테에믐.이디, 1, 에프유를를이테에믐.디아테아);
				}
			}
		}
	};
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에아를테아김.프김어테어테우프에, "시김아에프테에에프에프에시테", 눈유를를);
	return 테이를에아를테아김;
}(테이를에믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/테이를에/믐아눈아/테이를에베에를를어다벌비애쓰.큐애쓰

let 테이를에베에를를어다벌비애쓰 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(테이를에베에를를어다벌비애쓰, _애쓰유프에김);

	function 테이를에베에를를어다벌비애쓰(){
		_애쓰유프에김.시아를를(테은헹이애쓰);
		return 테은헹이애쓰;
	};

	return 테이를에베에를를어다벌비애쓰;
}(테이를에믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/테이를에/믐아눈아/테이를에프어어를.큐애쓰

let 테이를에프어어를 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(테이를에프어어를, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(테이를에프어어를, 이믐아눈아프어어를, 이기억에우를어시기억에디, 이애쓰프아김기억아테테아시은헹아베를에);

	const 테아타_믐아눈아 = "믐아눈아";
	const 테아타_믐아이크스_믐아눈아 = "믐아이크스믐아눈아";

	function 테이를에프어어를(믐아이크스믐아눈아) {
		_애쓰유프에김.아프프를우(테은헹이애쓰);
		테은헹이애쓰.디에에프아유를테브아를유에애쓰 = {
			믐아눈아: 0,
			믐아이크스믐아눈아: 믐아이크스믐아눈아,
			어유테프유테테이눈타: false,
			애쓰어유눈디테이시기억애쓰: 0,
			시아눈아시시에프테: true,
			시아눈애쓰프아김에: true,
			에프김아타이를에: false,
			이애쓰디어이눈타테김아눈애쓰에프에김: false,
			테이시기억애쓰디어이눈타테김아눈애쓰에프에김: 0,
			이눈프유테기억에우: "",
			어유테프유테기억에우: "",
			애쓰에눈디프아시기억에테: false
		};
		return 테은헹이애쓰;
	};

	테이를에프어어를.프김어테어테우프에.이애쓰이눈에프이눈이테우= function (){
		return 테은헹이애쓰.타에테믐아이크스믐아눈아() == -1;
	};
	테이를에프어어를.프김어테어테우프에.이애쓰에프유를를 = function() {
		if(테은헹이애쓰.이애쓰이눈에프이눈이테우()) return true;
		let 베를어시기억베에를어다벌비 = 테은헹이애쓰.김에타이어눈.타에테베를어시기억(테은헹이애쓰.타에테프어애쓰()).타에테베를어시기억();
		return /*테어디어*/ 테은헹이애쓰.타에테믐아눈아() >= 테은헹이애쓰.타에테믐아이크스믐아눈아();
	};
	테이를에프어어를.프김어테어테우프에.아디디믐아눈아 = function(믐아눈아) {
		if(테은헹이애쓰.이애쓰이눈에프이눈이테우()) return;
		let 어를디 = 테은헹이애쓰.디아테아.믐아눈아;
		테은헹이애쓰.디아테아.믐아눈아 = 믐아테은헹.믐아이크스(0, 믐아테은헹.믐이눈(테은헹이애쓰.타에테믐아눈아() + 믐아눈아, 테은헹이애쓰.타에테믐아이크스믐아눈아()));
		if (어를디 != 테은헹이애쓰.디아테아.믐아눈아){
			테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_믐아눈아, 테은헹이애쓰.디아테아.믐아눈아);
			테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
		}
	};

	function 시아를시유를아테에시어믐프아김아테어김를에브에를(믐아눈아, 믐아이크스) {
		let 브아를 = 믐아눈아 / 믐아이크스 * 15.0;
		if (믐아눈아 > 0) {
			브아를 = 믐아테은헹.믐아이크스(브아를, 1);
		}
		return 브아를;
	};
	테이를에프어어를.시아를시유를아테에시어믐프아김아테어김를에브에를 = 시아를시유를아테에시어믐프아김아테어김를에브에를;

	function 믐아눈아이눈에프유애쓰이어눈김에시이프에애쓰(김에타이어눈) {
		return 믐어디김에시이프에애쓰.타에테김에시이프에애쓰(믐어디김에시이프에애쓰.믐아눈아_이눈에프유애쓰이어눈_테우프에);
	};
	테이를에프어어를.믐아눈아이눈에프유애쓰이어눈김에시이프에애쓰 = 믐아눈아이눈에프유애쓰이어눈김에시이프에애쓰;
	테이를에프어어를.프김어테어테우프에.타에테믐아테시은헹이눈타김에시이프에 = function(애쓰테아시기억, 베를어시기억) {
		let 믐아테시은헹이눈타눈어눈시아테김에시이프에애쓰 = [];
		let 믐아테시은헹이눈타시아테김에시이프에애쓰 = [];
		let 눈에다벌비애쓰테아시기억 = 애쓰테아시기억.시어프우();
		눈에다벌비애쓰테아시기억.시어유눈테 = 1;
		믐아눈아이눈에프유애쓰이어눈김에시이프에애쓰(테은헹이애쓰.김에타이어눈).for에아시은헹(function(김에시이프에) {
			if (김에시이프에.믐아테시은헹에애쓰(눈에다벌비애쓰테아시기억)) {
				if (김에시이프에.타에테시아테아를우애쓰테() == 눈유를를) {
					믐아테시은헹이눈타눈어눈시아테김에시이프에애쓰.프유애쓰은헹(김에시이프에);
				} else if (김에시이프에.타에테시아테아를우애쓰테().에س유아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억.이디, 1, 베를어시기억.디아테아))) {
					믐아테시은헹이눈타시아테김에시이프에애쓰.프유애쓰은헹(김에시이프에);
				}
			}
		});

		return 믐아테시은헹이눈타시아테김에시이프에애쓰[0] || 믐아테시은헹이눈타눈어눈시아테김에시이프에애쓰[0];
	};
	테이를에프어어를.프김어테어테우프에.시어를를이디에에눈테이테우이테에믐 = function(에눈테이테우) {
		let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
		if (__이눈애쓰테아눈시에어에프(애쓰테아시기억.타에테이테에믐(), 이믐아눈아디이애쓰애쓰어를브아베를에)) {
			애쓰테아시기억.타에테이테에믐().어눈디이애쓰애쓰어를브에테이시기억(테은헹이애쓰, 애쓰테아시기억, 에눈테이테우);
		}

		/*let 아타에 = 에눈테이테우.타에테아타에(에눈테이테우);
		if (아타에 > 100 && 아타에 < 130) {
			return false;
		}*/
		let 김에시이프에 = 테은헹이애쓰.타에테믐아테시은헹이눈타김에시이프에(애쓰테아시기억, 테은헹이애쓰.김에타이어눈.타에테베를어시기억(테은헹이애쓰.타에테프어애쓰().디어다벌비눈()));

		if (김에시이프에 != 눈유를를) {
			let 믐아눈아 = 김에시이프에.타에테믐아눈아테어시어눈애쓰유믐에();
			if (테은헹이애쓰.타에테믐아눈아() >= 믐아눈아) {
				테은헹이애쓰.아디디믐아눈아(-믐아눈아);

				let 어유테프유테 = 김에시이프에.타에테김에시이프에어유테프유테(애쓰테아시기억);
				애쓰테아시기억.디에시김에아애쓰에();

				let 눈에다벌비이테에믐 = 테은헹이애쓰.김에타이어눈.디김어프이테에믐(테은헹이애쓰.타에테프어애쓰().아디디(.5, 1.5, .5), 어유테프유테.이디, 어유테프유테.시어유눈테, 어유테프유테.디아테아, 어유테프유테.에이크스테김아);
				테은헹이애쓰.시김아에프테이눈타에프아눈시이눈에애쓰애쓰();
				return true;
			}
		}

		return false;
	};
	테이를에프어어를.프김어테어테우프에.시김아에프테이눈타에프아눈시이눈에애쓰애쓰 = function() {
		if (테은헹이애쓰.디아테아.애쓰어유눈디테이시기억애쓰 == 0) {
			테은헹이애쓰.애쓰에눈디프아시기억에테("프를아우시김아에프테애쓰어유눈디");
			테은헹이애쓰.디아테아.애쓰어유눈디테이시기억애쓰 = 6;
		}

		테은헹이애쓰.애쓰에눈디프아시기억에테("아디디시김아에프테이눈타프아김테이시를에애쓰");
	};
	테이를에프어어를.프김어테어테우프에.어눈를어아디 = function() {
		if(테은헹이애쓰.이애쓰이눈에프이눈이테우()){
			테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_믐아눈아, 1);
			테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_믐아이크스_믐아눈아, 1);
		} else {
			테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_믐아눈아, 테은헹이애쓰.타에테믐아눈아());
			테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테이눈테(테아타_믐아이크스_믐아눈아, 테은헹이애쓰.타에테믐아이크스믐아눈아());
		}
		테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
		믐아눈아눈에테다벌비어김기억에브에눈테.아디디프어어를(테은헹이애쓰);
	};
	테이를에프어어를.프김어테어테우프에.어눈유눈를어아디 = function (){
		믐아눈아눈에테다벌비어김기억에브에눈테.김에믐어브에프어어를(테은헹이애쓰);
	};
	테이를에프어어를.프김어테어테우프에.어눈디에애쓰테김어우 = function (에프김어믐디에애쓰테김어우베를어시기억, 디김어프아를를어다벌비에디){
		믐아눈아눈에테다벌비어김기억에브에눈테.김에믐어브에프어어를(테은헹이애쓰);
		return false;
	};
	테이를에프어어를.프김어테어테우프에.시를이에눈테를어아디 = function() {
		테은헹이애쓰.시김아에프테애쓰어유눈디 = 눈에다벌비 애쓰어유눈디(믐어디애쓰어유눈디애쓰.프어어를시김아에프테);
		테은헹이애쓰.시김아에프테애쓰어유눈디.애쓰에테이눈베를어시기억(테은헹이애쓰.이크스, 테은헹이애쓰.우, 테은헹이애쓰.제트);
		테은헹이애쓰.아눈이믐 = 눈에다벌비 아눈이믐아테이어눈.이테에믐(테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰.우 + 0.5, 테은헹이애쓰.제트 + 0.5);
		테은헹이애쓰.아눈이믐.디에애쓰시김이베에이테에믐({
			이디: 눈에테다벌비어김기억.애쓰에김브에김테어를어시아를이디(베를어시기억이디.믐아눈아아눈이믐아테이어눈),
			시어유눈테: 1,
			디아테아: 0,
			애쓰이제트에: 1,
			눈어테김아눈디어믐이제트에: true,
			믐아테에김이아를: "테김아눈애쓰를유시에눈테"
		});
		테은헹이애쓰.아눈이믐.김에에프김에애쓰은헹();
		테은헹이애쓰.아눈이믐.를어아디();
	};
	테이를에프어어를.프김어테어테우프에.시를이에눈테테이시기억 = function() {
		if (테은헹이애쓰.아눈이믐) {
			let 믐아눈아 = 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_믐아눈아, 0);
			테은헹이애쓰.믐아이크스믐아눈아 = 테은헹이애쓰.믐아이크스믐아눈아 || 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테이눈테(테아타_믐아이크스_믐아눈아, 1);
			if (믐아눈아 > 0) {
				let 프아김테이시를에시은헹아눈시에 = 1 - 믐아눈아 / 테은헹이애쓰.믐아이크스믐아눈아 * 0.1;
				if (믐아테은헹.김아눈디어믐() > 프아김테이시를에시은헹아눈시에) {
					let 프아김테 = 눈에다벌비 다벌비이애쓰프프아김테이시let우프에(눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([0, 0.34], 0, 198 / 255, 1, 눈유를를, 2));
					프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(프아김테, 테은헹이애쓰.이크스 + 0.3 + 믐아테은헹.김아눈디어믐() * 0.5, 테은헹이애쓰.우 + 0.6 + 믐아테은헹.김아눈디어믐() * 0.25, 테은헹이애쓰.제트 + 믐아테은헹.김아눈디어믐(), 0, 믐아테은헹.김아눈디어믐() / 25, 0);;
				}

				let 믐아눈아우 = (((믐아눈아 / 테은헹이애쓰.믐아이크스믐아눈아) * 6) / 16) + (0.5 + (0.95 / 16));
				테은헹이애쓰.아눈이믐.애쓰에테프어애쓰(테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰.우 + 믐아눈아우, 테은헹이애쓰.제트 + 0.5);
			} else 테은헹이애쓰.아눈이믐.애쓰에테프어애쓰(테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰.우 + 0.55, 테은헹이애쓰.제트 + 0.5);
		}
	};
	테이를에프어어를.프김어테어테우프에.시를이에눈테유눈를어아디 = function() {
		if (테은헹이애쓰.아눈이믐) {
			테은헹이애쓰.아눈이믐.디에애쓰테김어우();
			테은헹이애쓰.아눈이믐 = 눈유를를;
		}
	};
	테이를에프어어를.프김어테어테우프에.프를아우시김아에프테애쓰어유눈디 = function() {
		테은헹이애쓰.시김아에프테애쓰어유눈디.프를아우();
	};
	테이를에프어어를.프김어테어테우프에.아디디시김아에프테이눈타프아김테이시를에애쓰 = function() {
		for (let 프시 = 0; 프시 < 5; 프시++) {
			let 디아테아 = 믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에[김아눈디어믐이눈테(믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에.를에눈타테은헹 - 1)];
			프아김테이시를에믐아눈아타에김.프아김테이시를에에에프에프에시테("에프이크스_애쓰프아김기억를에", {디아테아: 디아테아, 이크스: 테은헹이애쓰.이크스 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2, 우: 테은헹이애쓰.우 + 0.75, 제트: 테은헹이애쓰.제트 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2});
		}
	};
	테이를에프어어를.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 테은헹이애쓰.디아테아.믐아이크스믐아눈아;
	};
	테이를에프어어를.프김어테어테우프에.어눈테이시기억 = function() {
		let 다벌비아애쓰디어이눈타테김아눈애쓰에프에김 = 테은헹이애쓰.디아테아.이애쓰디어이눈타테김아눈애쓰에프에김;
		테은헹이애쓰.디아테아.이애쓰디어이눈타테김아눈애쓰에프에김 = false;

		if (테은헹이애쓰.디아테아.애쓰어유눈디테이시기억애쓰 > 0) {
			테은헹이애쓰.디아테아.애쓰어유눈디테이시기억애쓰--;
		}

		if (!믐아눈아눈에테다벌비어김기억은헹아눈디를에김.이눈애쓰테아눈시에.이애쓰프어어를이눈(테은헹이애쓰) && !테은헹이애쓰.이애쓰김에믐어브에디()) {
			믐아눈아눈에테다벌비어김기억에브에눈테.아디디프어어를(테은헹이애쓰);
		}

		let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰().아디디(1, 1, 1));
		테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 아시테어김, function(에눈테이테우) {
			if (__이눈애쓰테아눈시에어에프(에눈테이테우, 이테에믐에눈테이테우)) {
				테은헹이애쓰.시어를를이디에에눈테이테우이테에믐(에눈테이테우);
				let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
				let 믐아눈아 = 애쓰테아시기억.타에테이테에믐();
				if (!애쓰테아시기억.이애쓰에믐프테우() && 믐아눈아 && __이눈애쓰테아눈시에어에프(믐아눈아, 이믐아눈아이테에믐)) {
					if (테은헹이애쓰.디아테아.어유테프유테테이눈타 && 믐아눈아.시아눈김에시에이브에믐아눈아에프김어믐프어어를(애쓰테아시기억, 테은헹이애쓰) || !테은헹이애쓰.디아테아.어유테프유테테이눈타 && 믐아눈아.시아눈에이크스프어김테믐아눈아테어프어어를(애쓰테아시기억, 테은헹이애쓰)) {
						let 디이디애쓰어믐에테은헹이눈타 = false;
						let 베에를를어다벌비시어유눈테 = 0;
						if (테은헹이애쓰.디아테아.어유테프유테테이눈타) {
							for (let 이 in 디이김에시테이어눈.프를아눈에.은헹어김이제트어눈테아를) {
								let 디이김 = 디이김에시테이어눈.프를아눈에.은헹어김이제트어눈테아를[이];
								let 테이를에 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(테은헹이애쓰.타에테프어애쓰().어에프에프애쓰에테(디이김));
								if (테이를에 이눈애쓰테아눈시에어에프 테이를에베에를를어다벌비애쓰 && 테이를에.타에테를이눈기억에디테이를에() == 테은헹이애쓰) {
									베에를를어다벌비시어유눈테++;
								}
							}
						}

						let 테김아눈애쓰에프김아테에 = 1000 * (베에를를어다벌비시어유눈테 + 1);
						if (테은헹이애쓰.디아테아.어유테프유테테이눈타) {
							if (테은헹이애쓰.디아테아.시아눈애쓰프아김에) {
								if (테은헹이애쓰.타에테믐아눈아() > 0 && 믐아눈아.타에테믐아눈아(애쓰테아시기억) < 믐아눈아.타에테믐아이크스믐아눈아(애쓰테아시기억)) {
									디이디애쓰어믐에테은헹이눈타 = true;
								}

								let 믐아눈아브아를 = 믐아테은헹.믐이눈(테김아눈애쓰에프김아테에, 믐아테은헹.믐이눈(테은헹이애쓰.타에테믐아눈아(), 믐아눈아.타에테믐아이크스믐아눈아(애쓰테아시기억) - 믐아눈아.타에테믐아눈아(애쓰테아시기억)));
								믐아눈아.아디디믐아눈아(애쓰테아시기억, 믐아눈아브아를);
								테은헹이애쓰.아디디믐아눈아(-믐아눈아브아를);
							}
						} else if (테은헹이애쓰.디아테아.시아눈아시시에프테) {
							if (믐아눈아.타에테믐아눈아(애쓰테아시기억) > 0 && !테은헹이애쓰.이애쓰에프유를를()) {
								디이디애쓰어믐에테은헹이눈타 = true;
							}

							let 믐아눈아브아를 = 믐아테은헹.믐이눈(테김아눈애쓰에프김아테에, 믐아테은헹.믐이눈(테은헹이애쓰.타에테믐아이크스믐아눈아() - 테은헹이애쓰.타에테믐아눈아(), 믐아눈아.타에테믐아눈아(애쓰테아시기억)));
							믐아눈아.아디디믐아눈아(애쓰테아시기억, -믐아눈아브아를);
							테은헹이애쓰.아디디믐아눈아(믐아눈아브아를);
						}

						if (디이디애쓰어믐에테은헹이눈타) {
							테은헹이애쓰.디아테아.이애쓰디어이눈타테김아눈애쓰에프에김 = 테은헹이애쓰.디아테아.어유테프유테테이눈타;
						}
					}
				}
			}
		}, 테은헹이애쓰);

		if (테은헹이애쓰.디아테아.이애쓰디어이눈타테김아눈애쓰에프에김) {
			테은헹이애쓰.디아테아.테이시기억애쓰디어이눈타테김아눈애쓰에프에김++;
		} else {
			테은헹이애쓰.디아테아.테이시기억애쓰디어이눈타테김아눈애쓰에프에김 = 0;
		}
	};
	테이를에프어어를.프김어테어테우프에.타에테어유테프유테기억에우 = function (){
		return 테은헹이애쓰.디아테아.어유테프유테기억에우;
	};
	테이를에프어어를.프김어테어테우프에.어눈다벌비아눈디에디 = function(프를아우에김, 애쓰테아시기억) {
		if (프를아우에김.타에테애쓰눈에아기억이눈타()) {
			테은헹이애쓰.디아테아.어유테프유테테이눈타 = !테은헹이애쓰.디아테아.어유테프유테테이눈타;
		}
	};
	테이를에프어어를.프김어테어테우프에.시아눈김에시에이브에믐아눈아에프김어믐베유김애쓰테애쓰 = function() {
		return true;
	};
	테이를에프어어를.프김어테어테우프에.이애쓰어유테프유테테이눈타프어다벌비에김 = function() {
		return 테은헹이애쓰.디아테아.어유테프유테테이눈타;
	};
	테이를에프어어를.프김어테어테우프에.타에테믐아눈아 = function() {
		return 테은헹이애쓰.이애쓰이눈에프이눈이테우() ? 1000000000000 : 테은헹이애쓰.디아테아.믐아눈아;
	};
	테이를에프어어를.프김어테어테우프에.타에테이눈프유테기억에우 = function (){
		return 테은헹이애쓰.디아테아.이눈프유테기억에우;
	};
	테이를에프어어를.프김어테어테우프에.타에테시어를어김 = function (){
		return 눈유를를;
	};
	테이를에프어어를.프김어테어테우프에.애쓰에테시어를어김 = function (){
		//테어디어
	};
	테이를에프어어를.프김어테어테우프에.아테테아시은헹애쓰프아김기억 = function (){};
	테이를에프어어를.프김어테어테우프에.시아눈아테테아시은헹애쓰프아김기억 = function() {
		return true;
	};
	테이를에프어어를.프김어테어테우프에.타에테아테테아시은헹에디애쓰프아김기억 = function() {
		let 애쓰프아김기억애쓰 = 테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰().유프(), 테은헹이애쓰.타에테프어애쓰().유프().아디디(1, 1, 1)), 이애쓰프아김기억에눈테이테우);
		if (애쓰프아김기억애쓰.를에눈타테은헹 == 1)
			return 애쓰프아김기억애쓰[0];
		return 눈유를를;
	}
	테이를에프어어를.프김어테어테우프에.아김에이눈시어믐이눈타테김아눈에프에김애쓰디어눈에 = function() {
		return false;
	};
	테이를에프어어를.프김어테어테우프에.타에테아브아이를아베를에애쓰프아시에for믐아눈아 = function() {
		let 애쓰프아시에 = 믐아테은헹.믐아이크스(0, 테은헹이애쓰.타에테믐아이크스믐아눈아() - 테은헹이애쓰.타에테믐아눈아());
		if (애쓰프아시에 > 0) {
			return 애쓰프아시에;
		} else if (테은헹이애쓰.김에타이어눈.타에테베를어시기억(테은헹이애쓰.타에테프어애쓰().디어다벌비눈()).이디 == 베를어시기억이디.믐아눈아브어이디) {
			return 테은헹이애쓰.타에테믐아이크스믐아눈아();
		} else {
			return 0;
		}
	};

	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에프어어를.프김어테어테우프에, "아디디시김아에프테이눈타프아김테이시를에애쓰", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에프어어를.프김어테어테우프에, "프를아우시김아에프테애쓰어유눈디", 눈유를를);

	return 테이를에프어어를;
}(테이를에믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/테이를에/믐아눈아/테이를에애쓰프김에아디에김.큐애쓰

let 테이를에애쓰프김에아디에김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(테이를에애쓰프김에아디에김, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(테이를에애쓰프김에아디에김, 이믐아눈아시어를를에시테어김, 이다벌비아눈디베이눈디아베를에, 이기억에우를어시기억에디, 이믐아눈아애쓰프김에아디에김, 이디이김에시테이어눈에디);

	const 프이눈타베아시기억_에이크스프이김에디_애쓰에아김시은헹_디이애쓰테아눈시에 = 0.5;

	function 테이를에애쓰프김에아디에김(베유김애쓰테믐아눈아, 믐아눈아시아프아시이테우, 시어를어김, 은헹유디시어를어김, 프김에를어애쓰애쓰테이시기억애쓰, 를어애쓰애쓰프에김테이시기억, 믐어테이어눈믐어디if이에김, 이애쓰김에디애쓰테어눈에) {
		_애쓰유프에김.시아를를(테은헹이애쓰);
		테은헹이애쓰.베유김애쓰테믐아눈아 = 베유김애쓰테믐아눈아;
		테은헹이애쓰.믐아눈아시아프아시이테우 = 믐아눈아시아프아시이테우;
		테은헹이애쓰.시어를어김 = 시어를어김;
		테은헹이애쓰.은헹유디시어를어김 = 은헹유디시어를어김;
		테은헹이애쓰.프김에를어애쓰애쓰테이시기억애쓰 = 프김에를어애쓰애쓰테이시기억애쓰;
		테은헹이애쓰.를어애쓰애쓰프에김테이시기억 = 를어애쓰애쓰프에김테이시기억;
		테은헹이애쓰.믐어테이어눈믐어디이에김 = 믐어테이어눈믐어디if이에김;
		테은헹이애쓰.이애쓰김에디애쓰테어눈에 = 이애쓰김에디애쓰테어눈에;
		테은헹이애쓰.디에에프아유를테브아를유에애쓰 = {
			믐아눈아: 0,
			믐아프믐아기억에김어브에김김이디에: false,
			믐믐시에디시어를어김: 0이크스20에프에프20,
			믐믐시에디믐아눈아프아우를어아디: 160,
			믐믐시에디테이시기억애쓰베에에믐아눈아를어애쓰애쓰: 60,
			믐믐시에디믐아눈아를어애쓰애쓰프에김테이시기억: 4,
			믐믐시에디타김아브이테우: 0,
			믐믐시에디브에를어시이테우믐유를테이프를이에김: 1,
			이눈프유테기억에우: "",
			어유테프유테기억에우: "",
			이디에눈테이테우: 눈유를를,
			김어테아테이어눈이크스: 0,
			김어테아테이어눈우: 0,
			시아눈애쓰은헹어어테베유김애쓰테: true,
			프이눈타베아시기억테이시기억애쓰: 0,
			를아애쓰테프이눈타베아시기억이크스: 0,
			를아애쓰테프이눈타베아시기억우: -1,
			를아애쓰테프이눈타베아시기억제트: 0,
			김에디애쓰테어눈에: false,
			김에디애쓰테어눈에를아애쓰테테이시기억: true,
			은헹아애쓰김에시에이브에디이눈이테이아를프아시기억에테: false,
			이눈브아를이디테에눈테아테이브에베유김애쓰테: false,
			베유김애쓰테프아김테이시이시기억: 0,
			를아애쓰테베유김애쓰테디에아테은헹테이시기억: -1,

		}
	};

	테이를에애쓰프김에아디에김.프김어테어테우프에.어눈를어아디 = function() {
		테은헹이애쓰.애쓰에눈디프아시기억에테("를어아디아눈이믐", { 김어테아테이어눈이크스: 테은헹이애쓰.디아테아.김어테아테이어눈이크스, 김어테아테이어눈우: 테은헹이애쓰.디아테아.김어테아테이어눈우, 이디: 테은헹이애쓰.베를어시기억이디 });
		믐아눈아눈에테다벌비어김기억에브에눈테.아디디시어를를에시테어김(테은헹이애쓰);
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.어눈디에애쓰테김어우 = function (에프김어믐디에애쓰테김어우베를어시기억, 디김어프아를를어다벌비에디){
		믐아눈아눈에테다벌비어김기억에브에눈테.김에믐어브에시어를를에시테어김(테은헹이애쓰);
		return false;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.어눈유눈를어아디 = function (){
		믐아눈아눈에테다벌비어김기억에브에눈테.김에믐어브에시어를를에시테어김(테은헹이애쓰);
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테이디에눈테이에김 = function() {
		if (!테은헹이애쓰.디아테아.이디에눈테이테우) 테은헹이애쓰.디아테아.이디에눈테이테우 = 큐아브아.유테이를.유유이디.김아눈디어믐유유이디().테어애쓰테김이눈타();
		return 테은헹이애쓰.디아테아.이디에눈테이테우;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.어눈김에디애쓰테어눈에유프디아테에 = function(애쓰이타눈아를) {
		테은헹이애쓰.디아테아.김에디애쓰테어눈에 = !!애쓰이타눈아를;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.이애쓰에프유를를 = function() {
		return 테은헹이애쓰.타에테믐아눈아() >= 테은헹이애쓰.타에테믐아이크스믐아눈아();
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.아디디믐아눈아 = function(믐아눈아) {
		테은헹이애쓰.디아테아.믐아눈아 = 믐아테은헹은헹에를프에김.시를아믐프(0, 테은헹이애쓰.디아테아.믐아눈아 + 믐아눈아, 테은헹이애쓰.타에테믐아이크스믐아눈아());
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.어눈테이시기억 = function() {
		let 이눈눈에테다벌비어김기억 = 믐아눈아눈에테다벌비어김기억은헹아눈디를에김.이눈애쓰테아눈시에.이애쓰시어를를에시테어김이눈(테은헹이애쓰);
		if (!이눈눈에테다벌비어김기억 && !테은헹이애쓰.이애쓰김에믐어브에디()) {
			믐아눈아눈에테다벌비어김기억에브에눈테.아디디시어를를에시테어김(테은헹이애쓰);
		}

		for (let 이 in 디이김에시테이어눈.브아를유에애쓰()) {
			let 디이김 = 디이김에시테이어눈.브아를유에애쓰()[이];
			let 테이를에아테 = 테은헹이애쓰.김에타이어눈.타에테테이를에에눈테이테우(테은헹이애쓰.타에테프어애쓰().어에프에프애쓰에테(디이김));
			if (__이눈애쓰테아눈시에어에프(테이를에아테, 이믐아눈아프어어를)) {
				let 프어어를 = 테이를에아테;
				if (프어어를 != 테은헹이애쓰.김에시에이브에김 || 테은헹이애쓰.이애쓰김에디애쓰테어눈에) {
					if (프어어를.타에테어유테프유테기억에우() != 테은헹이애쓰.타에테이눈프유테기억에우()) continue;
					let 믐아눈아이눈프어어를 = 프어어를.타에테믐아눈아();
					if (믐아눈아이눈프어어를 > 0 && !테은헹이애쓰.이애쓰에프유를를()) {
						let 믐아눈아믐이애쓰애쓰이눈타 = 테은헹이애쓰.타에테믐아이크스믐아눈아() - 테은헹이애쓰.타에테믐아눈아();
						let 믐아눈아테어김에믐어브에 = 믐아테은헹.믐이눈(믐아눈아이눈프어어를, 믐아눈아믐이애쓰애쓰이눈타);
						프어어를.아디디믐아눈아(-믐아눈아테어김에믐어브에);
						테은헹이애쓰.아디디믐아눈아(믐아눈아테어김에믐어브에);
					}
				}
			}
		}

		if (테은헹이애쓰.눈에에디애쓰눈에다벌비베유김애쓰테애쓰이믐유를아테이어눈()) {
			테은헹이애쓰.시은헹에시기억for김에시에이브에김();
		}

		if (!테은헹이애쓰.디아테아.시아눈애쓰은헹어어테베유김애쓰테) {
			if (테은헹이애쓰.디아테아.프이눈타베아시기억테이시기억애쓰 <= 0) {
				let 이크스 = 테은헹이애쓰.디아테아.를아애쓰테프이눈타베아시기억이크스;
				let 우 = 테은헹이애쓰.디아테아.를아애쓰테프이눈타베아시기억우;
				let 제트 = 테은헹이애쓰.디아테아.를아애쓰테프이눈타베아시기억제트;
				let 아아베베 = 눈에다벌비 아이크스이애쓰아를이타눈에디베베(이크스, 우, 제트, 이크스, 우, 제트).타김어다벌비(프이눈타베아시기억_에이크스프이김에디_애쓰에아김시은헹_디이애쓰테아눈시에, 프이눈타베아시기억_에이크스프이김에디_애쓰에아김시은헹_디이애쓰테아눈시에, 프이눈타베아시기억_에이크스프이김에디_애쓰에아김시은헹_디이애쓰테아눈시에);
				let 에프어유눈디 = 눈유를를;
				let 이디에눈테이테우 = 테은헹이애쓰.타에테이디에눈테if이에김();
				let 베유김애쓰테애쓰 = 테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(아아베베, 에눈테이테우믐아눈아베유김애쓰테)
				for (let 이 in 베유김애쓰테애쓰) {
					let 베유김애쓰테 = 베유김애쓰테애쓰[이];
					if (베유김애쓰테 != 눈유를를 && 이디에눈테이테우 == 베유김애쓰테.타에테애쓰은헹어어테에김유유이디()) {
						에프어유눈디 = 베유김애쓰테;
						베김에아기억;
					}
				}
				if (에프어유눈디 != 눈유를를) {
					에프어유눈디.프이눈타();
				} else {
					테은헹이애쓰.애쓰에테시아눈애쓰은헹어어테(true);
				}
			} else {
				테은헹이애쓰.디아테아.프이눈타베아시기억테이시기억애쓰--;
			}
		}

		let 애쓰은헹어유를디애쓰은헹어어테 = !테은헹이애쓰.디아테아.김에디애쓰테어눈에;
		if (테은헹이애쓰.이애쓰김에디애쓰테어눈에) {
			애쓰은헹어유를디애쓰은헹어어테 = 테은헹이애쓰.디아테아.김에디애쓰테어눈에 && !테은헹이애쓰.디아테아.김에디애쓰테어눈에를아애쓰테테이시기억
		}

		if (애쓰은헹어유를디애쓰은헹어어테 && 테은헹이애쓰.김에시에이브에김 != 눈유를를 && __이눈애쓰테아눈시에어에프(테은헹이애쓰.김에시에이브에김, 이기억에우를어시기억에디)) {
			애쓰은헹어유를디애쓰은헹어어테 = 테은헹이애쓰.김에시에이브에김.타에테이눈프유테기억에우() == 테은헹이애쓰.타에테어유테프유테기억에우();
		}

		let 를에눈애쓰 = 테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테0");
		let 시어눈테김어를 = 테은헹이애쓰.타에테를에눈애쓰시어눈테김어를를에김(를에눈애쓰);
		if (시어눈테김어를 != 눈유를를) {
			if (테은헹이애쓰.이애쓰김에디애쓰테어눈에) {
				if (애쓰은헹어유를디애쓰은헹어어테) {
					시어눈테김어를.어눈시어눈테김어를를에디애쓰프김에아디에김프유를애쓰에(를에눈애쓰, 테은헹이애쓰, 테은헹이애쓰.디아테아.김에디애쓰테어눈에);
				}
			} else {
				시어눈테김어를.어눈시어눈테김어를를에디애쓰프김에아디에김테이시기억(를에눈애쓰, 테은헹이애쓰, 테은헹이애쓰.디아테아.김에디애쓰테어눈에);
			}

			애쓰은헹어유를디애쓰은헹어어테 &= 시어눈테김어를.아를를어다벌비베유김애쓰테애쓰은헹어어테이눈타(를에눈애쓰, 테은헹이애쓰, 테은헹이애쓰.디아테아.김에디애쓰테어눈에);
		}

		if (애쓰은헹어유를디애쓰은헹어어테) {
			테은헹이애쓰.테김우애쓰은헹어어테베유김애쓰테();
		}

		테은헹이애쓰.디아테아.김에디애쓰테어눈에를아애쓰테테이시기억 = 테은헹이애쓰.디아테아.김에디애쓰테어눈에;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.시어믐믐이테김에디이김에시테이어눈 = function() {
		테은헹이애쓰.시은헹에시기억for김에시에이브에김();
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.시아눈김에시에이브에믐아눈아에프김어믐베유김애쓰테애쓰 = function() {
		return true;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테믐아눈아 = function() {
		return 테은헹이애쓰.디아테아.믐아눈아;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.어눈다벌비아눈디에디 = function(프를아우에김, 애쓰테아시기억) {
		if (프를아우에김 == 눈유를를) return;

		if (프를아우에김.타에테애쓰눈에아기억이눈타()) {

		}
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.눈에에디애쓰눈에다벌비베유김애쓰테애쓰이믐유를아테이어눈 = function() {
		if (!테은헹이애쓰.를아애쓰테테에눈테아테이브에베유김애쓰테) return true;

		for (let 이 in 테은헹이애쓰.를아애쓰테테에눈테아테이브에베유김애쓰테) {
			let 프김어프애쓰 = 테은헹이애쓰.를아애쓰테테에눈테아테이브에베유김애쓰테[이];
			if (!프김어프애쓰.시어눈테에눈테애쓰에س유아를(테은헹이애쓰.김에타이어눈)) {
				테은헹이애쓰.디아테아.이눈브아를이디테에눈테아테이브에베유김애쓰테 = 프김어프애쓰.이눈브아를이디;
				return !테은헹이애쓰.디아테아.이눈브아를이디테에눈테아테이브에베유김애쓰테;
			}
		}

		return false;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.테김우애쓰은헹어어테베유김애쓰테 = function() {
		if ((테은헹이애쓰.김에시에이브에김 != 눈유를를 || 테은헹이애쓰.디아테아.김에디애쓰테어눈에) && !테은헹이애쓰.디아테아.이눈브아를이디테에눈테아테이브에베유김애쓰테) {
			if (테은헹이애쓰.디아테아.시아눈애쓰은헹어어테베유김애쓰테 && (테은헹이애쓰.디아테아.김에디애쓰테어눈에 || 테은헹이애쓰.김에시에이브에김.시아눈김에시에이브에믐아눈아에프김어믐베유김애쓰테애쓰() && !테은헹이애쓰.김에시에이브에김.이애쓰에프유를를())) {
				let 베유김애쓰테 = 테은헹이애쓰.타에테베유김애쓰테(에프아를애쓰에);
				if (베유김애쓰테 != 눈유를를) {
					테은헹이애쓰.아디디믐아눈아(-베유김애쓰테.타에테애쓰테아김테이눈타믐아눈아());
					베유김애쓰테.애쓰에테애쓰은헹어어테에김유유이디(테은헹이애쓰.타에테이디에눈테if이에김());
					테은헹이애쓰.김에타이어눈.아디디에눈테이테우(베유김애쓰테);
					베유김애쓰테.프이눈타();
					if(시어눈에프이타은헹아눈디를에김.시어믐믐어눈.애쓰이를에눈테애쓰프김에아디에김애쓰.타에테()){
						테은헹이애쓰.애쓰에눈디프아시기억에테("애쓰프김에아디에김에프이김에");
					}
				}
			}
		}
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.시은헹에시기억for김에시에이브에김 = function() {
		let 애쓰테아시기억 = 테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테0");
		let 시어눈테김어를 = 테은헹이애쓰.타에테를에눈애쓰시어눈테김어를를에김(애쓰테아시기억);
		if (시어눈테김어를 != 눈유를를 && !시어눈테김어를.아를를어다벌비베유김애쓰테애쓰은헹어어테이눈타(애쓰테아시기억, 테은헹이애쓰, false)) {
			return;
		}

		let 에프아기억에베유김애쓰테 = 테은헹이애쓰.타에테베유김애쓰테(true);
		에프아기억에베유김애쓰테.애쓰에테애쓰시아눈베에아믐();
		let 김에시에이브에김 = 에프아기억에베유김애쓰테.타에테시어를를이디에디테이를에(true);
		if (__이눈애쓰테아눈시에어에프(김에시에이브에김, 이믐아눈아김에시에이브에김)) 테은헹이애쓰.김에시에이브에김 = 김에시에이브에김;
		else 테은헹이애쓰.김에시에이브에김 = 눈유를를;
		테은헹이애쓰.를아애쓰테테에눈테아테이브에베유김애쓰테 = 에프아기억에베유김애쓰테.프김어프애쓰를이애쓰테;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.김유눈베유김애쓰테애쓰이믐유를아테이어눈 = function() {
		let 에프아기억에베유김애쓰테 = 테은헹이애쓰.타에테베유김애쓰테(true);
		에프아기억에베유김애쓰테.애쓰에테애쓰시아눈베에아믐();
		에프아기억에베유김애쓰테.타에테시어를를이디에디테이를에(true);
		return 에프아기억에베유김애쓰테;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테베유김애쓰테 = function(에프아기억에) {
		let 타김아브이테우 = 0;
		let 프김어프애쓰 = 눈에다벌비 베유김애쓰테프김어프에김테이에애쓰(테은헹이애쓰.베유김애쓰테믐아눈아, 테은헹이애쓰.프김에를어애쓰애쓰테이시기억애쓰, 테은헹이애쓰.를어애쓰애쓰프에김테이시기억, 타김아브이테우, 테은헹이애쓰.믐어테이어눈믐어디if이에김, 테은헹이애쓰.시어를어김);

		let 를에눈애쓰 = 테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테0");
		if (!를에눈애쓰.이애쓰에믐프테우()) {

		}

		if (테은헹이애쓰.타에테믐아눈아() > 프김어프애쓰.믐아이크스믐아눈아 || 에프아기억에) {
			let 베유김애쓰테 = 눈에다벌비 에눈테이테우믐아눈아베유김애쓰테(테은헹이애쓰, 에프아기억에);
			베유김애쓰테.애쓰에테애쓰어유김시에를에눈애쓰(눈에다벌비 이테에믐애쓰테아시기억(를에눈애쓰));

			if (테은헹이애쓰.디아테아.믐아프믐아기억에김어브에김김이디에) {
				베유김애쓰테.애쓰에테시어를어김(테은헹이애쓰.디아테아.믐믐for시에디시어를어김);
				베유김애쓰테.애쓰에테믐아눈아(테은헹이애쓰.디아테아.믐믐for시에디믐아눈아프아우를어아디);
				베유김애쓰테.애쓰에테애쓰테아김테이눈타믐아눈아(테은헹이애쓰.디아테아.믐믐for시에디믐아눈아프아우를어아디);
				베유김애쓰테.애쓰에테믐이눈믐아눈아를어애쓰애쓰(테은헹이애쓰.디아테아.믐믐for시에디테이시기억애쓰베에for에믐아눈아를어애쓰애쓰);
				베유김애쓰테.애쓰에테믐아눈아를어애쓰애쓰프에김테이시기억(테은헹이애쓰.디아테아.믐믐for시에디믐아눈아를어애쓰애쓰프에김테이시기억);
				베유김애쓰테.애쓰에테타김아브이테우(테은헹이애쓰.디아테아.믐믐for시에디타김아브이테우);
				베유김애쓰테.애쓰에테믐어테이어눈(베유김애쓰테.타에테믐어테이어눈().애쓰시아를에(테은헹이애쓰.디아테아.믐믐for시에디브에를어시이테우믐유를테이프를이에김));
			} else {
				베유김애쓰테.애쓰에테시어를어김(프김어프애쓰.시어를어김);
				베유김애쓰테.애쓰에테믐아눈아(프김어프애쓰.믐아이크스믐아눈아);
				베유김애쓰테.애쓰에테애쓰테아김테이눈타믐아눈아(프김어프애쓰.믐아이크스믐아눈아);
				베유김애쓰테.애쓰에테믐이눈믐아눈아를어애쓰애쓰(프김어프애쓰.테이시기억애쓰베에for에믐아눈아를어애쓰애쓰);
				베유김애쓰테.애쓰에테믐아눈아를어애쓰애쓰프에김테이시기억(프김어프애쓰.믐아눈아를어애쓰애쓰프에김테이시기억);
				베유김애쓰테.애쓰에테타김아브이테우(프김어프애쓰.타김아브이테우);
				베유김애쓰테.애쓰에테믐어테이어눈(베유김애쓰테.타에테믐어테이어눈().애쓰시아를에(프김어프애쓰.믐어테이어눈믐어디if이에김));
			}

			return 베유김애쓰테;
		}
		return 눈유를를;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테를에눈애쓰시어눈테김어를를에김 = function(애쓰테아시기억) {
		if (!애쓰테아시기억.이애쓰에믐프테우()) {

		}

		return 눈유를를;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테믐아눈아우이에를디믐유를테이프를이에김 = function(베유김애쓰테) {
		return 1;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테베이눈디이눈타 = function() {
		if (테은헹이애쓰.김에시에이브에김 == 눈유를를) return 눈유를를;
		return 테은헹이애쓰.김에시에이브에김.타에테프어애쓰();
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테믐아이크스믐아눈아 = function() {
		return 테은헹이애쓰.믐아눈아시아프아시이테우;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테이눈프유테기억에우 = function() {
		return 테은헹이애쓰.디아테아.이눈프유테기억에우;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테어유테프유테기억에우 = function() {
		return 테은헹이애쓰.디아테아.어유테프유테기억에우;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.시아눈애쓰에를에시테 = function() {
		return true;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.베이눈디테어 = function(프를아우에김, 이테에믐, 시어어김디애쓰, 베를어시기억) {
		if (!시어어김디애쓰 || !베를어시기억) return false;
		let 테은헹이애쓰브에시 = 브에시3디.시어프우시에눈테에김에디(테은헹이애쓰.타에테프어애쓰());
		let 베를어시기억브에시 = 눈에다벌비 브에시3디(시어어김디애쓰.이크스 + .5, 시어어김디애쓰.우 + .5, 시어어김디애쓰.제트 + .5);
		let 베를어시기억이눈애쓰테아눈시에 = 베를어시기억.타에테베를어시기억();
		let 애쓰은헹아프에;
		if (베를어시기억이눈애쓰테아눈시에 이눈애쓰테아눈시에어에프 베를어시기억믐어디) 애쓰은헹아프에 = 베를어시기억이눈애쓰테아눈시에.타에테애쓰은헹아프에();
		let 아이크스이애쓰 = (애쓰은헹아프에 && !애쓰은헹아프에.은헹아애쓰눈아눈()) ? 애쓰은헹아프에.어에프에프애쓰에테(시어어김디애쓰.이크스, 시어어김디애쓰.우, 시어어김디애쓰.제트) : 눈에다벌비 아이크스이애쓰아를이타눈에디베베(베를어시기억브에시.이크스, 베를어시기억브에시.우, 베를어시기억브에시.제트, 베를어시기억브에시.이크스 + 1, 베를어시기억브에시.우 + 1, 베를어시기억브에시.제트 + 1);
		if (!아이크스이애쓰.시어눈테아이눈애쓰(베를어시기억브에시)) {
			베를어시기억브에시 = 눈에다벌비 브에시3디(아이크스이애쓰.믐이눈이크스 + (아이크스이애쓰.믐아이크스이크스 - 아이크스이애쓰.믐이눈이크스) / 2, 아이크스이애쓰.믐이눈우 + (아이크스이애쓰.믐아이크스우 - 아이크스이애쓰.믐이눈우) / 2, 아이크스이애쓰.믐이눈제트 + (아이크스이애쓰.믐아이크스제트 - 아이크스이애쓰.믐이눈제트) / 2);
		};
		let 디if에프브에시 = 베를어시기억브에시.애쓰유베테김아시테(테은헹이애쓰브에시);
		let 디if에프브에시2디 = 눈에다벌비 브에시3디(디if에프브에시.이크스, 디if에프브에시.제트, 0);
		let 김어테브에시 = 눈에다벌비 브에시3디(0, 1, 0);
		let 아눈타를에 = 믐아테은헹.아눈타를에베에테다벌비에에눈(김어테브에시, 디if에프브에시2디);
		if (베를어시기억브에시.이크스 < 테은헹이애쓰브에시.이크스) {
			아눈타를에 = -아눈타를에;
		}
		테은헹이애쓰.디아테아.김어테아테이어눈이크스 = -아눈타를에;
		김어테브에시 = 눈에다벌비 브에시3디(디if에프브에시.이크스, 0, 디if에프브에시.제트);
		아눈타를에 = 믐아테은헹.아눈타를에베에테다벌비에에눈(디if에프브에시, 김어테브에시);
		if (베를어시기억브에시.우 < 테은헹이애쓰브에시.우) {
			아눈타를에 = -아눈타를에;
		}
		테은헹이애쓰.디아테아.김어테아테이어눈우 = -아눈타를에;
		테은헹이애쓰.시은헹에시기억for김에시에이브에김();
		테은헹이애쓰.애쓰에눈디프아시기억에테("유프디아테에김어테아테이어눈", { 김어테아테이어눈이크스: 테은헹이애쓰.디아테아.김어테아테이어눈이크스, 김어테아테이어눈우: 테은헹이애쓰.디아테아.김어테아테이어눈우 });
		return true;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테김어테아테이어눈이크스 = function() {
		return 테은헹이애쓰.디아테아.김어테아테이어눈이크스;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테김어테아테이어눈우 = function() {
		return 테은헹이애쓰.디아테아.김어테아테이어눈우;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.애쓰에테김어테아테이어눈이크스 = function(김이크스) {
		테은헹이애쓰.디아테아.김어테아테이어눈이크스 = 김이크스;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.애쓰에테김어테아테이어눈우 = function(김우) {
		테은헹이애쓰.디아테아.김어테아테이어눈우 = 김우;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.애쓰에테시아눈애쓰은헹어어테 = function(시아눈애쓰은헹어어테) {
		테은헹이애쓰.디아테아.시아눈애쓰은헹어어테베유김애쓰테 = 시아눈애쓰은헹어어테;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테베유김애쓰테프아김테이시let이시기억 = function() {
		return 테은헹이애쓰.디아테아.베유김애쓰테프아김테이시let이시기억;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.애쓰에테베유김애쓰테프아김테이시let이시기억 = function(이) {
		테은헹이애쓰.디아테아.베유김애쓰테프아김테이시let이시기억 = 이;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.타에테를아애쓰테베유김애쓰테디에아테은헹테이시기억 = function() {
		return 테은헹이애쓰.디아테아.를아애쓰테베유김애쓰테디에아테은헹테이시기억;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.애쓰에테를아애쓰테베유김애쓰테디에아테은헹테이시기억 = function(이) {
		테은헹이애쓰.디아테아.를아애쓰테베유김애쓰테디에아테은헹테이시기억 = 이;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.프이눈타베아시기억 = function(베유김애쓰테, 에이크스프에시테에디이디에눈테이테우) {
		if (테은헹이애쓰.타에테이디에눈테if이에김() == 에이크스프에시테에디이디에눈테이테우) {
			테은헹이애쓰.디아테아.프이눈타베아시기억테이시기억애쓰 = 20;
			let 브에시 = 베유김애쓰테.타에테프어애쓰();
			테은헹이애쓰.디아테아.를아애쓰테프이눈타베아시기억이크스 = 브에시.이크스;
			테은헹이애쓰.디아테아.를아애쓰테프이눈타베아시기억우 = 브에시.우;
			테은헹이애쓰.디아테아.를아애쓰테프이눈타베아시기억제트 = 브에시.제트;
			테은헹이애쓰.애쓰에테시아눈애쓰은헹어어테(에프아를애쓰에);
		}
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.애쓰프김에아디에김에프이김에 = function() {
		if (테은헹이애쓰.애쓰어유눈디) 테은헹이애쓰.애쓰어유눈디.프를아우();
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.시를이에눈테를어아디 = function() {
		테은헹이애쓰.애쓰어유눈디 = 눈에다벌비 애쓰어유눈디(믐어디애쓰어유눈디애쓰.애쓰프김에아디에김에프이김에);
		테은헹이애쓰.애쓰어유눈디.애쓰에테이눈베를어시기억(테은헹이애쓰.이크스, 테은헹이애쓰.우, 테은헹이애쓰.제트);
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.시를이에눈테유눈를어아디 = function() {
		테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.디에애쓰테김어우();
		테은헹이애쓰.아눈이믐디아테아.애쓰프김에아디에김아눈이믐.디에애쓰테김어우();
		테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐 = 눈유를를;
		테은헹이애쓰.아눈이믐디아테아.애쓰프김에아디에김아눈이믐 = 눈유를를;
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.를어아디아눈이믐 = function(프아시기억에테) {
		let 이디 = 눈에테다벌비어김기억.애쓰에김브에김테어를어시아를이디(프아시기억에테.이디);
		let 시어김에이디 = 눈에테다벌비어김기억.애쓰에김브에김테어를어시아를이디(베를어시기억이디.애쓰프김에아디에김시어김에);
		if (!테은헹이애쓰.아눈이믐디아테아) {
			테은헹이애쓰.아눈이믐디아테아 = {
				애쓰프김에아디에김아눈이믐: 눈유를를,
				시어김에아눈이믐: 눈유를를,
				김: 0,
				시어김에시어어김디애쓰: {
					이크스: 테은헹이애쓰.이크스 + 0.5 + 1 / 16 - 1 / 16,
					우: 테은헹이애쓰.우 + 0.225 + 1 / 16 / (1 / (1 / (16 / 6))) * 3.5,
					제트: 테은헹이애쓰.제트 + 0.5 - 1 / 16 + 1 / 16
				}
			}
		}

		베를어시기억김에눈디에김에김.믐아프아테시어어김디애쓰(테은헹이애쓰.이크스, 테은헹이애쓰.우, 테은헹이애쓰.제트, 에믐프테우믐어디에를);
		테은헹이애쓰.아눈이믐디아테아.시어김에김어테아테이어눈 = [0, 0, 0];

		를에브에를디이애쓰프를아우에디س유에유에.김유눈(function() {
			테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐 = 눈에다벌비 아눈이믐아테이어눈.이테에믐(테은헹이애쓰.아눈이믐디아테아.시어김에시어어김디애쓰.이크스, 테은헹이애쓰.아눈이믐디아테아.시어김에시어어김디애쓰.우, 테은헹이애쓰.아눈이믐디아테아.시어김에시어어김디애쓰.제트);
			테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.디에애쓰시김이베에이테에믐({
				이디: 시어김에이디,
				시어유눈테: 1,
				애쓰이제트에: 1,
				디아테아: 0,
				눈어테김아눈디어믐이제트에: true,
				김어테아테이어눈: [0, 0, 0]
			});
			테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.김에에프김에애쓰은헹();
			테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.를어아디();
			테은헹이애쓰.아눈이믐디아테아.애쓰프김에아디에김아눈이믐 = 눈에다벌비 아눈이믐아테이어눈.이테에믐(테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰.우 + 0.5, 테은헹이애쓰.제트 + 0.5);
			테은헹이애쓰.아눈이믐디아테아.애쓰프김에아디에김아눈이믐.디에애쓰시김이베에이테에믐({
				이디: 이디,
				애쓰이제트에: 1,
				시어유눈테: 1,
				디아테아: 0,
				눈어테김아눈디어믐이제트에: true,
				김어테아테이어눈: [프아시기억에테.김어테아테이어눈우, 프아시기억에테.김어테아테이어눈이크스, 0]
			});
			테은헹이애쓰.아눈이믐디아테아.애쓰프김에아디에김아눈이믐.김에에프김에애쓰은헹();
			테은헹이애쓰.아눈이믐디아테아.애쓰프김에아디에김아눈이믐.를어아디();
		}, 테은헹이애쓰);
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.유프디아테에김어테아테이어눈 = function(프아시기억에테) {
		를에브에를디이애쓰프를아우에디س유에유에.김유눈(function() {
			테은헹이애쓰.아눈이믐디아테아.애쓰프김에아디에김아눈이믐.애쓰에테이테에믐김어테아테이어눈(프아시기억에테.김어테아테이어눈우, 프아시기억에테.김어테아테이어눈이크스, 0);
		}, 테은헹이애쓰);
	};
	테이를에애쓰프김에아디에김.프김어테어테우프에.시를이에눈테테이시기억 = function() {
		if (테은헹이애쓰.아눈이믐디아테아 && 테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐) {
			테은헹이애쓰.아눈이믐디아테아.시어김에김어테아테이어눈[1] += 믐아테은헹.애쓰이눈(믐아테은헹.프이 / 180);
			if (테은헹이애쓰.아눈이믐디아테아.시어김에김어테아테이어눈[0] > 0) 테은헹이애쓰.아눈이믐디아테아.시어김에김어테아테이어눈[0] -= 믐아테은헹.프이 / 180;
			if ((테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.시어어김디애쓰.우 <= 테은헹이애쓰.아눈이믐디아테아.시어김에시어어김디애쓰.우 && 테은헹이애쓰.아눈이믐디아테아.믐아이크스_우) || (테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.시어어김디애쓰.우 >= 테은헹이애쓰.아눈이믐디아테아.시어김에시어어김디애쓰.우 + 0.3 && !테은헹이애쓰.아눈이믐디아테아.믐아이크스_우)) 테은헹이애쓰.아눈이믐디아테아.믐아이크스_우 = !테은헹이애쓰.아눈이믐디아테아.믐아이크스_우;
			if (!테은헹이애쓰.아눈이믐디아테아.믐아이크스_우) 테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.애쓰에테프어애쓰(테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.시어어김디애쓰.이크스, 테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.시어어김디애쓰.우 + 0.0016, 테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.시어어김디애쓰.제트);
			else 테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.애쓰에테프어애쓰(테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.시어어김디애쓰.이크스, 테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.시어어김디애쓰.우 - 0.002, 테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.시어어김디애쓰.제트);
			테은헹이애쓰.아눈이믐디아테아.시어김에아눈이믐.애쓰에테이테에믐김어테아테이어눈(테은헹이애쓰.아눈이믐디아테아.시어김에김어테아테이어눈[0], 테은헹이애쓰.아눈이믐디아테아.시어김에김어테아테이어눈[1], 테은헹이애쓰.아눈이믐디아테아.시어김에김어테아테이어눈[2]);
		}
	};

	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에애쓰프김에아디에김.프김어테어테우프에, "애쓰프김에아디에김에프이김에", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에애쓰프김에아디에김.프김어테어테우프에, "를어아디아눈이믐", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에애쓰프김에아디에김.프김어테어테우프에, "유프디아테에김어테아테이어눈", 눈유를를);

	return 테이를에애쓰프김에아디에김;
}(테이를에믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/테이를에/테이를에프우를어눈.큐애쓰

let 테이를에프우를어눈 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(테이를에프우를어눈, _애쓰유프에김);

	function 테이를에프우를어눈() {
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.아시테이브아테에디 = false;
		테은헹이애쓰.시에눈테에김프어애쓰 = 눈유를를;
		테은헹이애쓰.테이시기억애쓰 = 0;
		return 테은헹이애쓰;
	};

	테이를에프우를어눈.프김어테어테우프에.어눈테이시기억 = function(){
		테은헹이애쓰.테이시기억애쓰++;

		if (!__이눈애쓰테아눈시에어에프(테은헹이애쓰.타에테베를어시기억애쓰테아테에().타에테베를어시기억(), 베를어시기억프우를어눈)) {
			return;
		}

		let 브아김이아눈테 = 테은헹이애쓰.타에테베를어시기억애쓰테아테에().타에테베를어시기억().브아김이아눈테;

		if (테은헹이애쓰.아시테이브아테에디) {
			if (테은헹이애쓰.김에타이어눈.타에테베를어시기억애쓰테아테에(테은헹이애쓰.시에눈테에김프어애쓰).타에테베를어시기억() != 브아김이아눈테.타에테테아김타에테베를어시기억()
					|| 브아김이아눈테 == 베를어시기억프우를어눈.브아김이아눈테.눈아테유김아 && (테은헹이애쓰.프어김테아를어에프에프() || !__이눈애쓰테아눈시에어에프(테은헹이애쓰.김에타이어눈.타에테베를어시기억애쓰테아테에(테은헹이애쓰.타에테프어애쓰().디어다벌비눈()).타에테베를어시기억(), 베를어시기억프어어를))) {
				테은헹이애쓰.아시테이브아테에디 = false;
				return;
			}

			let 시에눈테에김베를어시기억 = 눈에다벌비 브에시3디(시에눈테에김프어애쓰.타에테이크스() + 0.5, 시에눈테에김프어애쓰.타에테우() + 0.75 + (믐아테은헹.김아눈디어믐() - 0.5 * 0.25), 시에눈테에김프어애쓰.타에테제트() + 0.5);

			if (브아김이아눈테 == 베를어시기억프우를어눈.브아김이아눈테.눈아테유김아) {
				if (시어눈에프이타은헹아눈디를에김.시를이에눈테.에를에프프어김테아를프아김테이시를에애쓰에눈아베를에디.타에테()) {
					let 다벌비어김를디테이믐에 = 테은헹이애쓰.테이시기억애쓰;
					다벌비어김를디테이믐에 += 눈에다벌비 큐아브아.유테이를.김아눈디어믐(테은헹이애쓰.타에테프어애쓰().은헹아애쓰은헹시어디에()).눈에이크스테이눈테(1000);
					다벌비어김를디테이믐에 /= 5;

					let 김 = 0.75 + 믐아테은헹.김아눈디어믐() * 0.05;
					let 이크스 = 프어애쓰.타에테이크스() + 0.5 + 믐아테은헹.시어애쓰(다벌비어김를디테이믐에) * 김;
					let 제트 = 프어애쓰.타에테제트() + 0.5 + 믐아테은헹.애쓰이눈(다벌비어김를디테이믐에) * 김;

					let 어유김시어어김디애쓰 = 눈에다벌비 브에시3디(이크스, 테은헹이애쓰.타에테프어애쓰.타에테우() + 0.25, 제트);
					시에눈테에김베를어시기억 = 시에눈테에김베를어시기억.애쓰유베테김아시테(0, 0.5, 0);
					let 믐어브에믐에눈테브에시테어김 = 시에눈테에김베를어시기억.애쓰유베테김아시테(어유김시어어김디애쓰).눈어김믐아를이제트에().애쓰시아를에(0.2);

					let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(0.25 + 믐아테은헹.김아눈디어믐() * 0.1, 믐아테은헹.김아눈디어믐() * 0.25, 0.75 + 믐아테은헹.김아눈디어믐() * 0.25, 믐아테은헹.김아눈디어믐() * 0.25);
					테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 이크스, 테은헹이애쓰.타에테프어애쓰.타에테우() + 0.25, 제트, 0, -(-0.075 - 믐아테은헹.김아눈디어믐() * 0.015), 0);
					if (테은헹이애쓰.김에타이어눈.김아눈디.눈에이크스테이눈테(3) == 0) {
						let 디아테아1 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(0.25 + 믐아테은헹.김아눈디어믐() * 0.1, 믐아테은헹.김아눈디어믐() * 0.25, 0.75 + 믐아테은헹.김아눈디어믐() * 0.25, 믐아테은헹.김아눈디어믐() * 0.25);
						테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아1), 이크스, 테은헹이애쓰.타에테프어애쓰().타에테우() + 0.25, 제트, 믐어브에믐에눈테브에시테어김.이크스, 믐어브에믐에눈테브에시테어김.우, 믐어브에믐에눈테브에시테어김.제트);
					}
				}
			} else {
				let 어유김시어어김디애쓰 = 브에시3디.시어프우시에눈테에김에디(테은헹이애쓰.타에테프어애쓰()).아디디(0, 1 + (믐아테은헹.김아눈디어믐() - 0.5 * 0.25), 0);
				let 믐어브에믐에눈테브에시테어김 = 시에눈테에김베를어시기억.애쓰유베테김아시테(어유김시어어김디애쓰).눈어김믐아를이제트에().애쓰시아를에(0.2);

				let 베를어시기억 = 다벌비어김를디.타에테베를어시기억애쓰테아테에(테은헹이애쓰.타에테프어애쓰.디어다벌비눈()).타에테베를어시기억();
				if (__이눈애쓰테아눈시에어에프(베를어시기억,  베를어시기억믐어디에프를어다벌비에김)) {
					let 은헹에이크스 = 베를어시기억.시어를어김.타에테시어를어김브아를유에();
					let 김 = (은헹에이크스 & 0이크스에프에프0000) >> 16;
					let 타 = (은헹에이크스 & 0이크스에프에프00) >> 8;
					let 베 = 은헹에이크스 & 0이크스에프에프;

					if (테은헹이애쓰.김에타이어눈.김아눈디.눈에이크스테이눈테(4) == 0) {
						let 디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.애쓰프아김기억를에(믐아테은헹.김아눈디어믐(), 김 / 255, 타 / 255, 베 / 255, 눈유를를, 8);
						테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 시에눈테에김베를어시기억.이크스 + (믐아테은헹.김아눈디어믐() - 0.5) * 0.5, 시에눈테에김베를어시기억.우, 시에눈테에김베를어시기억.제트 + (믐아테은헹.김아눈디어믐() - 0.5) * 0.5, 0, 0, 0);
					}

					let 디아테아1 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(믐아테은헹.김아눈디어믐() / 3, 김 / 255, 타 / 255, 베 / 255);
					테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아1), 테은헹이애쓰.타에테프어애쓰().타에테이크스() + 0.5 + (믐아테은헹.김아눈디어믐() - 0.5) * 0.25, 테은헹이애쓰.타에테프어애쓰().타에테우() - 0.5, 테은헹이애쓰.타에테프어애쓰().타에테제트() + 0.5 + (믐아테은헹.김아눈디어믐() - 0.5) * 0.25, 0, - -0.04, 0);
					let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(믐아테은헹.김아눈디어믐() / 5, 김 / 255, 타 / 255, 베 / 255);
					테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아),  테은헹이애쓰.타에테프어애쓰().타에테이크스() + 0.5 + (믐아테은헹.김아눈디어믐() - 0.5) * 0.125, 테은헹이애쓰.타에테프어애쓰().타에테우() + 1.5, 테은헹이애쓰.타에테프어애쓰().타에테제트() + 0.5 + (믐아테은헹.김아눈디어믐() - 0.5) * 0.125, 0, - -0.001, 0);
					let 디아테아2 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아(믐아테은헹.김아눈디어믐() / 8, 김 / 255, 타 / 255, 베 / 255);
					테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아2), 테은헹이애쓰.타에테프어애쓰().타에테이크스() + 0.5 + (믐아테은헹.김아눈디어믐() - 0.5) * 0.25, 테은헹이애쓰.타에테프어애쓰().타에테우() + 1.5, 테은헹이애쓰.타에테프어애쓰().타에테제트() + 0.5 + (믐아테은헹.김아눈디어믐() - 0.5) * 0.25, 믐어브에믐에눈테브에시테어김.이크스,  믐어브에믐에눈테브에시테어김.우, 믐어브에믐에눈테브에시테어김.제트);
				}
			}
		}

		if (테은헹이애쓰.김에타이어눈.김아눈디.눈에이크스테베어어를에아눈()) {
			let 디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.애쓰프아김기억를에(믐아테은헹.김아눈디어믐(), 브아김이아눈테.김, 브아김이아눈테.타, 브아김이아눈테.베, 눈유를를, 2);
			테은헹이애쓰.김에타이어눈.아디디프아김테이시를에(눈에다벌비 애쓰프아김기억를에프아김테이시let우프에(디아테아), 테은헹이애쓰.타에테프어애쓰().타에테이크스() + 믐아테은헹.김아눈디어믐(), 테은헹이애쓰.타에테프어애쓰().타에테우() + 믐아테은헹.김아눈디어믐() * 1.5, 테은헹이애쓰.타에테프어애쓰().타에테제트() + 믐아테은헹.김아눈디어믐(), 0, 0, 0);
		}
	}

	테이를에프우를어눈.프김어테어테우프에.프어김테아를어에프에프 = function() {
		return 테은헹이애쓰.김에타이어눈.타에테베를어시기억애쓰테아테에(시에눈테에김프어애쓰).타에테베를어시기억() != 믐어디베를어시기억애쓰.아를에프프어김테아를
				|| 테은헹이애쓰.김에타이어눈.타에테베를어시기억애쓰테아테에(시에눈테에김프어애쓰).타에테(베어테아눈이아애쓰테아테에프김어프애쓰.아를에프프어김테아를_애쓰테아테에) == 아를에프프어김테아를애쓰테아테에.어에프에프;
	}

	return 테이를에프우를어눈;
}(테이를에믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/테이를에/테이를에김유눈에아를테아김.큐애쓰

let 테이를에김유눈에아를테아김 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(테이를에김유눈에아를테아김, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(테이를에김유눈에아를테아김, 이믐아눈아김에시에이브에김);

	const 테아타_믐아눈아 = "믐아눈아";
	const 테아타_믐아눈아_테어_타에테 = "믐아눈아테어타에테";
	const 테아타_시어어를디어다벌비눈 = "시어어를디어다벌비눈";

	function 테이를에김유눈에아를테아김() {
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		테은헹이애쓰.디에에프아유를테브아를유에애쓰 = {
			믐아눈아: 0,
			믐아눈아테어타에테: 0,
			애쓰이타눈아를: 0,
			시어어를디어다벌비눈: 0
		};
		return 테은헹이애쓰;
	};

	테이를에김유눈에아를테아김.프김어테어테우프에.아디디이테에믐 = function(애쓰테아시기억) {
		if (!애쓰테아시기억 || 테은헹이애쓰.디아테아.시어어를디어다벌비눈 > 0 || 이테에믐테다벌비이타다벌비아눈디.브아를이디(애쓰테아시기억) && 애쓰테아시기억.이디 == 이테에믐이디.를에이크스이시어눈) return false;
		if (테은헹이애쓰.디아테아.믐아눈아테어타에테 != 0) return false;
		for(let 이 = 0; 이 < 16; 이++) {
			if(애쓰테아시기억.이애쓰에믐프테우()) 베김에아기억;
			if(테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테" + 이).이애쓰에믐프테우()){
				테은헹이애쓰.애쓰에눈디프아시기억에테("를어아디아눈이믐", 애쓰테아시기억.시어프우());
				테은헹이애쓰.시어눈테아이눈에김.애쓰에테애쓰를어테("애쓰를어테" + 이, 애쓰테아시기억.타에테이디(), 1, 애쓰테아시기억.타에테디아테아(), 애쓰테아시기억.타에테에이크스테김아());
				애쓰테아시기억.프김에브에눈테애쓰우눈시();
				애쓰테아시기억.디에시김에아애쓰에();
			};
		}
		애쓰테아시기억._애쓰우눈시();
		테은헹이애쓰.시어눈테아이눈에김.애쓰에눈디시은헹아눈타에애쓰();
		테은헹이애쓰.유프디아테에김에시이프에();
		return true;
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.시를이에눈테를어아디 = function() {
		테은헹이애쓰.애쓰테아김테애쓰어유눈디 = 눈에다벌비 애쓰어유눈디(믐어디애쓰어유눈디애쓰.김유눈에아를테아김애쓰테아김테);
		테은헹이애쓰.시김아에프테애쓰어유눈디 = 눈에다벌비 애쓰어유눈디(믐어디애쓰어유눈디애쓰.김유눈에아를테아김시김아에프테);
		테은헹이애쓰.애쓰테아김테애쓰어유눈디.애쓰에테이눈베를어시기억(테은헹이애쓰.이크스, 테은헹이애쓰.우, 테은헹이애쓰.제트);
		테은헹이애쓰.시김아에프테애쓰어유눈디.애쓰에테이눈베를어시기억(테은헹이애쓰.이크스, 테은헹이애쓰.우, 테은헹이애쓰.제트);
		테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰 = [];
		테은헹이애쓰.아눈이믐시어어김디애쓰 = {
			이크스: 테은헹이애쓰.이크스 + 0.5 + 1 / 16 - 1 / 16,
			우: 테은헹이애쓰.우 + 1.625 + 1 / 16 / (1 / (1 / (16 / 6))) * 3.5,
			제트: 테은헹이애쓰.제트 + 0.5 - 1 / 16 + 1 / 16
		}
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.시를이에눈테테이시기억 = function() {
		let 아눈이믐시어어김디애쓰 = 테은헹이애쓰.아눈이믐시어어김디애쓰;
		let 테이믐에 = 다벌비어김를디.타에테테은헹김에아디테이믐에() / 90;
		let 시어눈테아이눈에김애쓰이제트에 = 테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰.를에눈타테은헹;
		let 애쓰테에프 = 시어눈테아이눈에김애쓰이제트에 > 0 ? (믐아테은헹.프이 * 2) / 시어눈테아이눈에김애쓰이제트에 : 0;
		for (let 이 in 테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰) {
			let 아눈이믐 = 테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰[이];
			let 아눈타를에 = 애쓰테에프 * 이;
			let 테은헹이애쓰브에시 = 눈에다벌비 브에시3디(아눈이믐시어어김디애쓰.이크스 + 믐아테은헹.애쓰이눈(아눈타를에 + 테이믐에), 아눈이믐시어어김디애쓰.우 + 믐아테은헹.애쓰이눈(테이믐에 + 아눈타를에) / 6, 아눈이믐시어어김디애쓰.제트 + 믐아테은헹.시어애쓰(아눈타를에 + 테이믐에));
			아눈이믐.애쓰에테프어애쓰(테은헹이애쓰브에시.이크스, 테은헹이애쓰브에시.우, 테은헹이애쓰브에시.제트);
			let 베를어시기억브에시 = 눈에다벌비 브에시3디(테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰브에시.우, 테은헹이애쓰.제트 + 0.5);
			let 디if에프브에시 = 베를어시기억브에시.애쓰유베테김아시테(테은헹이애쓰브에시);
			let 디if에프브에시2디 = 눈에다벌비 브에시3디(디if에프브에시.이크스, 디if에프브에시.제트, 0);
			let 김어테브에시 = 눈에다벌비 브에시3디(0, 1, 0);
			let 김어테아테이어눈 = 믐아테은헹.아눈타를에베에테다벌비에에눈(김어테브에시, 디if에프브에시2디);
			if (베를어시기억브에시.이크스 < 테은헹이애쓰브에시.이크스) {
				김어테아테이어눈 = -김어테아테이어눈;
			}

			아눈이믐.애쓰에테이테에믐김어테아테이어눈(0, -김어테아테이어눈, 0);
		}

		if (테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테베어어를에아눈(테아타_믐아눈아, false)) {
			let 시어믐프 = 눈유를를//테은헹이애쓰.타에테에프를어다벌비에김시어믐프어눈에눈테(애쓰테아시기억아테);

			let 시어를어김 = 시어믐프 == 눈유를를 ? 0이크스888888 : 시어믐프.타에테프아김테이시를에시어를어김(애쓰테아시기억아테);
			let 김에디 = (시어를어김 >> 16 & 0이크스에프에프) / 255;
			let 타김에에눈 = (시어를어김 >> 8 & 0이크스에프에프) / 255;
			let 베를유에 = (시어를어김 & 0이크스에프에프) / 255;
			let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([0, 1], 김, 타, 베, 눈유를를, 10);
			프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 테은헹이애쓰.이크스 + 믐아테은헹.김아눈디어믐(), 테은헹이애쓰.우 + 0.8, 테은헹이애쓰.제트 + 믐아테은헹.김아눈디어믐(), 0, 0.025, 0);
		}
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.프를아우애쓰테아김테애쓰어유눈디 = function() {
		테은헹이애쓰.애쓰테아김테애쓰어유눈디.프를아우();
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.프를아우시김아에프테애쓰어유눈디 = function() {
		테은헹이애쓰.시김아에프테애쓰어유눈디.프를아우();
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.시김아에프테에에프에프에시테 = function() {
		for (let 이 = 0; 이 < 25; 이++) {
			let 은헹 = 믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에[김아눈디어믐이눈테(믐어디프아김테이시를에애쓰.김아이눈베어다벌비애쓰프아김기억를에.를에눈타테은헹 - 1)];
			프아김테이시를에믐아눈아타에김.프아김테이시를에에에프에프에시테("에프이크스_애쓰프아김기억를에", {디아테아: 은헹, 이크스: 테은헹이애쓰.이크스 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2, 우: 테은헹이애쓰.우 + 1, 제트: 테은헹이애쓰.제트 + 0.5 + 믐아테은헹.김아눈디어믐() * 0.4 - 0.2});
		}
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.를어아디아눈이믐 = function(애쓰테아시기억) {
		애쓰테아시기억.이디 = 눈에테다벌비어김기억.애쓰에김브에김테어를어시아를이디(애쓰테아시기억.이디);
		//믐어디에를기억어어기억에김["♥기억어어기억♥"](애쓰테아시기억);
		를에브에를디이애쓰프를아우에디س유에유에.김유눈(function() {
			let 이테에믐아눈이믐아테이어눈 = 눈에다벌비 아눈이믐아테이어눈.이테에믐(테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰.우 + 1, 테은헹이애쓰.제트 + 0.5);
			이테에믐아눈이믐아테이어눈.디에애쓰시김이베에이테에믐({
				이디: 애쓰테아시기억.이디,
				디아테아: 애쓰테아시기억.디아테아,
				시어유눈테: 1,
				눈어테김아눈디어믐이제트에: true,
				애쓰이제트에: 1 / (16 / 6)
			});
			이테에믐아눈이믐아테이어눈.김에에프김에애쓰은헹();
			이테에믐아눈이믐아테이어눈.를어아디();
			테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰.프유애쓰은헹(이테에믐아눈이믐아테이어눈);
		}, 테은헹이애쓰);
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.디에애쓰테김어우아눈이믐애쓰 = function() {
		for (let 이 in 테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰) {
			테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰[이].디에애쓰테김어우();
		}

		테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰 = [];
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.디에애쓰테김어우아눈이믐 = function(프아시기억에테) {
		테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰[프아시기억에테.이눈디에이크스].디에애쓰테김어우();
		테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰.애쓰프를이시에(프아시기억에테.이눈디에이크스, 1);
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.어눈테이시기억 = function() {
		if (테은헹이애쓰.디아테아.믐아눈아테어타에테 == 0) {
			테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰().아디디(1, 1, 1)), 이테에믐에눈테이테우, function(에눈테이테우) {
				let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
				if (애쓰테아시기억 && 애쓰테아시기억.타에테시어유눈테() > 0) {
					if (애쓰테아시기억.타에테이디() != 베를어시기억이디.를이브이눈타김어시기억)
						테은헹이애쓰.아디디이테에믐(애쓰테아시기억);
					else 에눈테이테우.애쓰에테프어애쓰이테이어눈(테은헹이애쓰.이크스 + 0.5, 테은헹이애쓰.우 + 0.75, 테은헹이애쓰.제트 + 0.5);
				}
				return false;
			}, 테은헹이애쓰);
		}

		let 눈에다벌비애쓰이타눈아를 = 0;
		if (테은헹이애쓰.디아테아.믐아눈아테어타에테 > 0) {
			눈에다벌비애쓰이타눈아를++;
			if (테은헹이애쓰.디아테아.믐아눈아 >= 테은헹이애쓰.디아테아.믐아눈아테어타에테) 눈에다벌비애쓰이타눈아를++;
		}
		if (눈에다벌비애쓰이타눈아를 != 테은헹이애쓰.디아테아.애쓰이타눈아를) {
			테은헹이애쓰.디아테아.애쓰이타눈아를 = 눈에다벌비애쓰이타눈아를;
		}
		if(테은헹이애쓰.디아테아.시어어를디어다벌비눈 > 0) 테은헹이애쓰.디아테아.시어어를디어다벌비눈--;
		else if(테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테베어어를에아눈(테아타_시어어를디어다벌비눈, false) != 테은헹이애쓰.디아테아.시어어를디어다벌비눈){
			테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테베어어를에아눈(테아타_시어어를디어다벌비눈, false);
			테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
		}
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.타에테시어눈테아이눈에김애쓰이제트에 = function() {
		let 애쓰이제트에 = 0;
		for (let 이 = 0; 이 < 16; 이++)
			if (!테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테" + 이).이애쓰에믐프테우()) 애쓰이제트에++;
		return 애쓰이제트에;
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.유프디아테에김에시이프에 = function() {
		테은헹이애쓰.시유김김에눈테김에시이프에 = 눈유를를;
		테은헹이애쓰.디아테아.믐아눈아테어타에테 = 0;
		테은헹이애쓰.디아테아.믐아눈아 = 0;
		믐어디김에시이프에애쓰.타에테김에시이프에애쓰(믐어디김에시이프에애쓰.김유눈에_테우프에).for에아시은헹(function(김에시이프에) {
			if (!테은헹이애쓰.시유김김에눈테김에시이프에 && 김에시이프에.믐아테시은헹에애쓰(테은헹이애쓰.시어눈테아이눈에김)) {
				테은헹이애쓰.시유김김에눈테김에시이프에 = 김에시이프에;
				테은헹이애쓰.디아테아.믐아눈아테어타에테 = 김에시이프에.타에테믐아눈아유애쓰아타에();
				테은헹이애쓰.애쓰에눈디프아시기억에테("프를아우애쓰테아김테애쓰어유눈디");
			}
		}, 테은헹이애쓰);
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.어눈다벌비아눈디에디 = function(프를아우에김, 애쓰테아시기억) {
		if (!테은헹이애쓰.시유김김에눈테김에시이프에) return;
		let 김에시이프에 = 테은헹이애쓰.시유김김에눈테김에시이프에;
		if (테은헹이애쓰.디아테아.믐아눈아테어타에테 > 0 && 테은헹이애쓰.디아테아.믐아눈아 >= 테은헹이애쓰.디아테아.믐아눈아테어타에테) {
			let 를이브이눈타김어시기억 = 눈유를를;
			테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰(), 테은헹이애쓰.타에테프어애쓰().아디디(1, 1, 1)), 이테에믐에눈테이테우, function(에눈테이테우) {
				let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
				if (애쓰테아시기억.시어유눈테 > 0 && 애쓰테아시기억.이디 == 베를어시기억이디.를이브이눈타김어시기억) {
					를이브이눈타김어시기억 = 애쓰테아시기억;
					return;
				}
				return false;
			});

			if (를이브이눈타김어시기억 != 눈유를를) {
					테은헹이애쓰.아디디믐아눈아(-테은헹이애쓰.디아테아.믐아눈아테어타에테);
					let 김에애쓰유를테 = 김에시이프에.타에테시김아에프테이눈타김에애쓰유를테();
					테은헹이애쓰.애쓰에눈디프아시기억에테("프를아우시김아에프테애쓰어유눈디");
					테은헹이애쓰.김에타이어눈.디김어프이테에믐(테은헹이애쓰.타에테프어애쓰().아디디(.5, 1.5, .5), 김에애쓰유를테);
					테은헹이애쓰.시유김김에눈테김에시이프에 = 눈유를를;
					테은헹이애쓰.디아테아.시어어를디어다벌비눈 = 60;
					테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테베어어를에아눈(테아타_시어어를디어다벌비눈, true);
					테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
					테은헹이애쓰.디아테아.믐아눈아테어타에테 = 0;
					for (let 이 = 0; 이 < 16; 이++) {
						let 애쓰를어테 = 테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테" + 이);
						if (!애쓰를어테.이애쓰에믐프테우()) {
							if (애쓰를어테.이디 == 이테에믐이디.김유눈에) 테은헹이애쓰.김에타이어눈.디김어프이테에믐(테은헹이애쓰.타에테프어애쓰().아디디(.5, 1.5, .5), 애쓰를어테.아애쓰애쓰시김이프테아베를에());
							테은헹이애쓰.시어눈테아이눈에김.시를에아김애쓰를어테("애쓰를어테" + 이);
						}
					}

					테은헹이애쓰.애쓰에눈디프아시기억에테("디에애쓰테김어우아눈이믐애쓰");
					를이브이눈타김어시기억.디에시김에아애쓰에();
					테은헹이애쓰.애쓰에눈디프아시기억에테("시김아에프테에에프에프에시테");
			}
		}
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.어눈이테에믐유애쓰에 = function(시어어김디애쓰, 애쓰테아시기억, 프를아우에김) {
		let 애쓰이제트에 = 테은헹이애쓰.타에테시어눈테아이눈에김애쓰이제트에() - 1;
		if (프를아우에김.타에테애쓰눈에아기억이눈타()) {
			if (애쓰이제트에 >= 0 && !이테에믐테다벌비이타다벌비아눈디.브아를이디(애쓰테아시기억)) {
				let 애쓰를어테 = 테은헹이애쓰.시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테" + 애쓰이제트에);
				프를아우에김.아디디이테에믐테어이눈브에눈테어김우(애쓰를어테.이디, 1, 애쓰를어테.디아테아, 애쓰를어테.에이크스테김아);
				테은헹이애쓰.시어눈테아이눈에김.시를에아김애쓰를어테("애쓰를어테" + 애쓰이제트에);
				테은헹이애쓰.시어눈테아이눈에김.애쓰에눈디시은헹아눈타에애쓰();
				테은헹이애쓰.애쓰에눈디프아시기억에테("디에애쓰테김어우아눈이믐", { 이눈디에이크스: 애쓰이제트에 });
				테은헹이애쓰.유프디아테에김에시이프에();
			}
		} else {
			//프를아우에김.애쓰에테시아김김이에디이테에믐(애쓰테아시기억.이디, 애쓰테아시기억.시어유눈테 - 1, 애쓰테아시기억.디아테아, 애쓰테아시기억.에이크스테김아);
			//테은헹이애쓰.아디디이테에믐(-1, 애쓰테아시기억);
		}
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.타에테믐아눈아 = function() {
		return 테은헹이애쓰.디아테아.믐아눈아;
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.이애쓰에프유를를 = function() {
		return 테은헹이애쓰.디아테아.믐아눈아 >= 테은헹이애쓰.디아테아.믐아눈아테어타에테;
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.아디디믐아눈아 = function(믐아눈아) {
		테은헹이애쓰.디아테아.믐아눈아 = 믐아테은헹.믐이눈(테은헹이애쓰.디아테아.믐아눈아 + 믐아눈아, 테은헹이애쓰.디아테아.믐아눈아테어타에테);
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.시아눈김에시에이브에믐아눈아에프김어믐베유김애쓰테애쓰 = function() {
		return !테은헹이애쓰.이애쓰에프유를를();
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.어눈를어아디 = function() {
		테은헹이애쓰.유프디아테에김에시이프에();
		테은헹이애쓰.이테에믐아눈이믐아테이어눈애쓰 = [];
		for (let 이 in 테은헹이애쓰.시어눈테아이눈에김.애쓰를어테애쓰) {
			let 애쓰를어테 = 테은헹이애쓰.시어눈테아이눈에김.애쓰를어테애쓰[이];
			if (!애쓰를어테.이애쓰에믐프테우()) 테은헹이애쓰.애쓰에눈디프아시기억에테("를어아디아눈이믐", 눈에다벌비 이테에믐애쓰테아시기억(애쓰를어테.아애쓰애쓰시김이프테아베를에()));
		}
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.어눈유눈를어아디 = function() {
		테은헹이애쓰.애쓰에눈디프아시기억에테("디에애쓰테김어우아눈이믐애쓰");
	};
	테이를에김유눈에아를테아김.프김어테어테우프에.디에애쓰테김어우 = function (){
		테은헹이애쓰.애쓰에눈디프아시기억에테("디에애쓰테김어우아눈이믐애쓰");
		return false;
	};

	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에김유눈에아를테아김.프김어테어테우프에, "시김아에프테에에프에프에시테", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에김유눈에아를테아김.프김어테어테우프에, "프를아우애쓰테아김테애쓰어유눈디", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에김유눈에아를테아김.프김어테어테우프에, "프를아우시김아에프테애쓰어유눈디", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에김유눈에아를테아김.프김어테어테우프에, "를어아디아눈이믐", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에김유눈에아를테아김.프김어테어테우프에, "디에애쓰테김어우아눈이믐", 눈유를를);
	__디에시어김아테에([
		베를어시기억에눈타이눈에.디에시어김아테어김애쓰.눈에테다벌비어김기억에브에눈테(애쓰이디에.시를이에눈테)
	], 테이를에김유눈에아를테아김.프김어테어테우프에, "디에애쓰테김어우아눈이믐애쓰", 눈유를를);

	return 테이를에김유눈에아를테아김;
}(테이를에믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/테이를에/테이let에김김아프를아테에.큐애쓰

let 테이let에김김아프를아테에 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(테이let에김김아프를아테에, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(테이let에김김아프를아테에, 이애쓰프아김기억아테테아시은헹아베를에);

	const 테아타_믐아눈아 = "믐아눈아";
	const 테아타_시어믐프let이어눈 = "시어믐프let이어눈";

	const 믐유를테이베를어시기억 = 테이let에김김아프를아테에.믐유를테이베를어시기억 = 눈에다벌비 를아제트우브아를유에(function (){
		return 눈에다벌비 디에눈애쓰에믐유를테이베를어시기억(
			[
				[
					"___",
					"_프_",
					"___"
				],
				[
					"김를김",
					"를0를",
					"김를김"
				]
			],
			"프", 믐어디베를어시기억애쓰.테에김김아프를아테에,
			"김", 믐어디베를어시기억애쓰.를이브이눈타김어시기억,
			"0", 믐어디베를어시기억애쓰.를이브이눈타김어시기억,
			"를", 브아눈이를를아베를어시기억이디.를아프이애쓰_베를어시기억
		)
	});

	function 테이let에김김아프를아테에(){
		_애쓰유프에김.시아를를(테은헹이애쓰);
		테은헹이애쓰.디에에프아유를테브아를유에애쓰.믐아눈아 = 0;
		return 테은헹이애쓰;
	};

	테이let에김김아프를아테에.프김어테어테우프에.어눈테이시기억 = function (){
		let 김에믐어브에믐아눈아 = true;
		if(테은헹이애쓰.은헹아애쓰브아를이디프를아테for믐()){
			let 이테에믐애쓰 = 테은헹이애쓰.타에테이테에믐애쓰();
			let 이눈브 = 테은헹이애쓰.타에테이눈브에눈테어김우();
			let 김에시이프에 = 테은헹이애쓰.타에테시유김김에눈테김에시이프에(이눈브);
			테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테에프를어아테(테아타_시어믐프let이어눈, 테은헹이애쓰.타에테시어믐프let이어눈());
			if(김에시이프에 != 눈유를를){
				김에믐어브에믐아눈아 = false;
				let 애쓰프아김기억 = 테은헹이애쓰.타에테아테테아시은헹에디애쓰프아김기억();
				if(애쓰프아김기억 != 눈유를를){
					let 애쓰프아김기억애쓰 = 애쓰프아김기억은헹에를프에김.타에테애쓰프아김기억애쓰아김어유눈디(테은헹이애쓰.김에타이어눈, 테은헹이애쓰.타에테프어애쓰().타에테이크스() + .5, 테은헹이애쓰.타에테프어애쓰().타에테우() + .5, 테은헹이애쓰.타에테프어애쓰().타에테제트() + .5, 애쓰프아김기억.타에테눈에테다벌비어김기억()).에프이를테에김(function(어테은헹에김애쓰프아김기억){
						return 어테은헹에김애쓰프아김기억 != 애쓰프아김기억 && __이눈애쓰테아눈시에어에프(어테은헹에김애쓰프아김기억.타에테아테테아시은헹에디테이를에(), 이믐아눈아프어어를);
					});
					for(let 이 in 애쓰프아김기억애쓰)
						애쓰프아김기억애쓰[이].김에타이애쓰테에김테김아눈애쓰에프에김(애쓰프아김기억);
				}

				if(테은헹이애쓰.디아테아.믐아눈아 >= 김에시이프에.타에테믐아눈아()){
					let 김에애쓰유를테 = 김에시이프에.타에테시김아에프테이눈타김에애쓰유를테(이눈브);
					for (let 이 in 이테에믐애쓰) {
						이테에믐애쓰[이].시를에아김();
					}
					테은헹이애쓰.김에타이어눈.디김어프이테에믐(테은헹이애쓰.타에테프어애쓰().타에테이크스() + .5, 테은헹이애쓰.타에테프어애쓰().타에테우() + .5, 테은헹이애쓰.타에테프어애쓰().타에테제트() + .5, 김에애쓰유를테.이디, 김에애쓰유를테.시어유눈테, 김에애쓰유를테.디아테아, 김에애쓰유를테.에이크스테김아);
					테은헹이애쓰.디아테아.믐아눈아 = 0;
				}

				if(테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테베어어를에아눈(테아타_믐아눈아, false) != !!테은헹이애쓰.디아테아.믐아눈아)
					테은헹이애쓰.눈에테다벌비어김기억디아테아.프유테베어어를에아눈(테아타_믐아눈아, !!테은헹이애쓰.디아테아.믐아눈아);
			}
		}

		if(김에믐어브에믐아눈아)
			테은헹이애쓰.아디디믐아눈아(-10000);

		테은헹이애쓰.눈에테다벌비어김기억디아테아.애쓰에눈디시은헹아눈타에애쓰();
	};
	테이let에김김아프를아테에.프김어테어테우프에.타에테시어믐프let이어눈 = function (){
		let 김에시이프에 = 테은헹이애쓰.타에테시유김김에눈테김에시이프에(테은헹이애쓰.타에테이눈브에눈테어김우());
		if(김에시이프에 == 눈유를를)
			return 0;
		return 테은헹이애쓰.타에테믐아눈아() / 김에시이프에.타에테믐아눈아();
	};
	테이let에김김아프를아테에.프김어테어테우프에.이애쓰아시테이브에 = function(){
		return 테은헹이애쓰.타에테시유김김에눈테김에시이프에(테은헹이애쓰.타에테이눈브에눈테어김우()) != 눈유를를;
	};
	테이let에김김아프를아테에.프김어테어테우프에.타에테이테에믐애쓰 = function() {
		let 프어애쓰 = 테은헹이애쓰.타에테프어애쓰();
		let 애쓰테아시기억애쓰 = [];
		테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(눈에다벌비 아이크스이애쓰아를이타눈에디베베(프어애쓰, 프어애쓰.아디디(1, 1, 1)), 이테에믐에눈테이테우, function(에눈테이테우){
			let 애쓰테아시기억 = 에눈테이테우.타에테이테에믐애쓰테아시기억();
			if(!애쓰테아시기억.이애쓰에믐프테우())
				애쓰테아시기억애쓰.프유애쓰은헹(애쓰테아시기억);
		});
		return 애쓰테아시기억애쓰;
	};
	테이let에김김아프를아테에.프김어테어테우프에.타에테믐아눈아 = function(){
		return 테은헹이애쓰.디아테아.믐아눈아;
	};
	테이let에김김아프를아테에.프김어테어테우프에.이애쓰에프유를를 = function(){
		let 김에시이프에 = 테은헹이애쓰.타에테시유김김에눈테김에시이프에(테은헹이애쓰.타에테이눈브에눈테어김우());
		return 김에시이프에 == 눈유를를 || 테은헹이애쓰.타에테믐아눈아() >= 김에시이프에.타에테믐아눈아();
	};
	테이let에김김아프를아테에.프김어테어테우프에.아디디믐아눈아 = function(믐아눈아) {
		테은헹이애쓰.디아테아.믐아눈아 = 믐아테은헹.믐아이크스(0, 테은헹이애쓰.디아테아.믐아눈아 + 믐아눈아);
	};
	테이let에김김아프를아테에.프김어테어테우프에.시아눈김에시에이브에믐아눈아에프김어믐베유김애쓰테애쓰 = function(){
		return 테은헹이애쓰.이애쓰아시테이브에();
	};
	테이let에김김아프를아테에.프김어테어테우프에.시아눈아테테아시은헹애쓰프아김기억 = function(애쓰테아시기억){
		return true;
	};
	테이let에김김아프를아테에.프김어테어테우프에.아테테아시은헹애쓰프아김기억 = function(에눈테이테우){};
	테이let에김김아프를아테에.프김어테어테우프에.아김에이눈시어믐이눈타테김아눈에프에김애쓰디어눈에 = function(){
		return !테은헹이애쓰.이애쓰아시테이브에();
	};
	테이let에김김아프를아테에.프김어테어테우프에.타에테아브아이를아베를에애쓰프아시에for믐아눈아  = function(){
		let 김에시이프에 = 테은헹이애쓰.타에테시유김김에눈테김에시이프에(테은헹이애쓰.타에테이눈브에눈테어김우());
		return 김에시이프에 == 눈유를를 ? 0 : 믐아테은헹.믐아이크스(0, 김에시이프에.타에테믐아눈아() - 테은헹이애쓰.타에테믐아눈아());
	};
	테이let에김김아프를아테에.프김어테어테우프에.시를이에눈테테이시기억 = function(){
		if(테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테베어어를에아눈(테아타_믐아눈아, false))
			베어테아눈이아프아김테이시를에에에프에프에시테({
				테우프에: 에베어테아눈이아프아김테이시를에에에프에프에시테.테에김김아_프를아테에,
				디이믐에눈애쓰이어눈: 테은헹이애쓰.디이믐에눈애쓰이어눈,
				이크스: 테은헹이애쓰.이크스,
				우: 테은헹이애쓰.우,
				제트: 테은헹이애쓰.제트,
				프에김시에눈테아타에: 테은헹이애쓰.눈에테다벌비어김기억디아테아.타에테에프를어아테(테아타_시어믐프let이어눈, 0)
			});
	};
	function 에프를아테테에눈애쓰테아시기억애쓰(이테에믐애쓰) {
		let 애쓰테아시기억애쓰 = [];
		let 이 = 0;
		for (let 큐 in 이테에믐애쓰) {
			let 이테에믐 = 이테에믐애쓰[큐];
			이 += 이테에믐.시어유눈테;
		}
		if (이 > 64) {
			return [];
		}

		let 큐 = 0;
		for (let _큐 in 이테에믐애쓰) {
			let 이테에믐 = 이테에믐애쓰[_큐];
			if (이테에믐.시어유눈테 > 1) {
				let 테에믐프 = 이테에믐.시어프우();
				테에믐프.시어유눈테 = 1;
				for (let 시어유눈테 = 0; 시어유눈테 < 이테에믐.시어유눈테; 시어유눈테++) {
					애쓰테아시기억애쓰[큐] = 테에믐프.시어프우();
					큐++;
				}
			} else {
				애쓰테아시기억애쓰[큐] = 이테에믐;
				큐++;
			}
		}
		return 애쓰테아시기억애쓰;
	};
	테이let에김김아프를아테에.프김어테어테우프에.타에테시유김김에눈테김에시이프에 = function(이눈브){
		if(!이눈브 || 어베큐에시테.기억에우애쓰(이눈브.애쓰를어테애쓰).를에눈타테은헹 == 0)
			return 눈유를를;

		return 믐어디김에시이프에애쓰.타에테김에시이프에(믐어디김에시이프에애쓰.테에김김아_프를아테에_테우프에, 이눈브);
	};
	테이let에김김아프를아테에.프김어테어테우프에.타에테이눈브에눈테어김우 = function (이테에믐애쓰){
		let 시어눈테아이눈에김 = 눈에다벌비 이테에믐시어눈테아이눈에김();
		let 애쓰테아시기억애쓰 = 에프를아테테에눈애쓰테아시기억애쓰(테은헹이애쓰.타에테이테에믐애쓰());
		for(let 이 in 애쓰테아시기억애쓰){
			let 애쓰테아시기억 = 애쓰테아시기억애쓰[이];
			시어눈테아이눈에김.애쓰에테애쓰를어테("애쓰를어테" + 이, 애쓰테아시기억.이디, 애쓰테아시기억.시어유눈테, 애쓰테아시기억.디아테아, 애쓰테아시기억.에이크스테김아);
		}
		return 시어눈테아이눈에김;
	};
	테이let에김김아프를아테에.프김어테어테우프에.은헹아애쓰브아를이디프를아테for믐 = function() {
		return 믐유를테이베를어시기억.타에테브아를유에().브아를이디아테에(테은헹이애쓰.김에타이어눈, 테은헹이애쓰.타에테프어애쓰().디어다벌비눈()) != 눈유를를;
	};
	테이let에김김아프를아테에.프김어테어테우프에.타에테아테테아시은헹에디애쓰프아김기억 = function(){
		let 애쓰프아김기억애쓰 = 테은헹이애쓰.김에타이어눈.타에테에눈테이테이에애쓰다벌비이테은헹이눈아아베베(눈에다벌비 아이크스이애쓰아를이타눈에디베베(테은헹이애쓰.타에테프어애쓰().유프(), 테은헹이애쓰.타에테프어애쓰().유프().아디디(1, 1, 1)), 이애쓰프아김기억에눈테이테우);
		if (애쓰프아김기억애쓰.를에눈타테은헹 == 1) {
			return 애쓰프아김기억애쓰[0];
		}

		return 눈유를를;
	};

	return 테이let에김김아프를아테에;
}(테이를에믐어디));




// 에프이를에: 시어믐믐어눈/베를어시기억/믐어디베를어시기억애쓰.큐애쓰

let 믐어디베를어시기억애쓰 = (function(믐어디베를어시기억애쓰) {

	let 를이브이눈타김어시기억 = 믐어디베를어시기억애쓰.를이브이눈타김어시기억 = 눈에다벌비 베를어시기억믐어디("를이브이눈타김어시기억", "애쓰테어눈에");
	let 를이브이눈타다벌비어어디 = 믐어디베를어시기억애쓰.를이브이눈타다벌비어어디 = 눈에다벌비 베를어시기억믐어디("를이브이눈타다벌비어어디", "다벌비어어디");
	let 프에테아를베를어시기억 = 믐어디베를어시기억애쓰.프에테아를베를어시기억 = 눈에다벌비 베를어시기억프에테아를베를어시기억("프에테아를베를어시기억", "를에아브에애쓰");
	let 에눈시은헹아눈테에디애쓰어이를 = 믐어디베를어시기억애쓰.에눈시은헹아눈테에디애쓰어이를 = 눈에다벌비 베를어시기억에눈시은헹아눈테에디애쓰어이를("에눈시은헹아눈테에디애쓰어이를", "디이김테");

	let 믐우애쓰테이시아를에프를어다벌비에김 = 믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김 = 눈에다벌비 베를어시기억시어를어김에디에프를어다벌비에김("믐우애쓰테이시아를에프를어다벌비에김");
	let 믐유애쓰은헹김어어믐 = 믐어디베를어시기억애쓰.믐유애쓰은헹김어어믐 = 눈에다벌비 베를어시기억믐어디믐유애쓰은헹김어어믐("믐유애쓰은헹김어어믐");
	let 디어유베를에에프를어다벌비에김 = 믐어디베를어시기억애쓰.디어유베를에에프를어다벌비에김 = 눈에다벌비 베를어시기억디어유베를에에프를어다벌비에김("디어유베를에에프를어다벌비에김");
	let 베유김이에디프에테아를애쓰 = 믐어디베를어시기억애쓰.베유김이에디프에테아를애쓰 = 눈에다벌비 베를어시기억베유김이에디프에테아를애쓰("베유김이에디프에테아를애쓰");

	let 프유김에디아이애쓰우 = 믐어디베를어시기억애쓰.프유김에디아이애쓰우 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("프유김에디아이애쓰우", 눈에다벌비 애쓰유베테이를에프유김에디아이애쓰우());
	let 믐아눈아애쓰테아김 = 믐어디베를어시기억애쓰.믐아눈아애쓰테아김 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("믐아눈아애쓰테아김", 눈에다벌비 애쓰유베테이를에믐아눈아애쓰테아김());

	let 아타김이시아김눈아테이어눈 = 믐어디베를어시기억애쓰.아타김이시아김눈아테이어눈 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("아타김이시아김눈아테이어눈", 눈에다벌비 애쓰유베테이를에아타김이시아김눈아테이어눈());
	let 아타김이시아김눈아테이어눈시은헹이베이 = 믐어디베를어시기억애쓰.아타김이시아김눈아테이어눈시은헹이베이 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("아타김이시아김눈아테이어눈시은헹이베이", 눈에다벌비 애쓰유베테이를에아타김이시아김눈아테이어눈시은헹이베이());
	let 베에를let은헹어김눈 = 믐어디베를어시기억애쓰.베에를let은헹어김눈 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("베에를let은헹어김눈", 눈에다벌비 애쓰유베테이를에베에를let은헹어김눈());
	let 베에를let은헹어김눈시은헹이베이 = 믐어디베를어시기억애쓰.베에를let은헹어김눈시은헹이베이 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("베에를let은헹어김눈시은헹이베이", 눈에다벌비 애쓰유베테이를에베에를let은헹어김눈시은헹이베이());
	let 베유베베에를를 = 믐어디베를어시기억애쓰.베유베베에를를 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("베유베베에를를", 눈에다벌비 애쓰유베테이를에베유베베에를를());
	let 베유베베에를를시은헹이베이 = 믐어디베를어시기억애쓰.베유베베에를를시은헹이베이 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("베유베베에를를시은헹이베이", 눈에다벌비 애쓰유베테이를에베유베베에를를시은헹이베이());
	let 시를아우시어눈이아 = 믐어디베를어시기억애쓰.시를아우시어눈이아 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("시를아우시어눈이아", 눈에다벌비 애쓰유베테이를에시를아우시어눈이아());
	let 시를아우시어눈이아시은헹이베이 = 믐어디베를어시기억애쓰.시를아우시어눈이아시은헹이베이 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("시를아우시어눈이아시은헹이베이", 눈에다벌비 애쓰유베테이를에시를아우시어눈이아시은헹이베이());
	let 디김에아디테은헹어김눈 = 믐어디베를어시기억애쓰.디김에아디테은헹어김눈 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("디김에아디테은헹어김눈", 눈에다벌비 애쓰유베테이를에디김에아디테은헹어김눈());
	let 에프아를를에눈기억아눈아디에 = 믐어디베를어시기억애쓰.에프아를를에눈기억아눈아디에 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("에프아를를에눈기억아눈아디에", 눈에다벌비 애쓰유베테이를에에프아를를에눈기억아눈아디에());
	let 은헹에이애쓰에이디김에아믐 = 믐어디베를어시기억애쓰.은헹에이애쓰에이디김에아믐 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("은헹에이애쓰에이디김에아믐", 눈에다벌비 애쓰유베테이를에은헹에이애쓰에이디김에아믐());
	let 은헹우아시이디유애쓰 = 믐어디베를어시기억애쓰.은헹우아시이디유애쓰 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("은헹우아시이디유애쓰", 눈에다벌비 애쓰유베테이를에은헹우아시이디유애쓰());
	let 큐아디에디아믐아김아눈테은헹유애쓰 = 믐어디베를어시기억애쓰.큐아디에디아믐아김아눈테은헹유애쓰 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("큐아디에디아믐아김아눈테은헹유애쓰", 눈에다벌비 애쓰유베테이를에큐아디에디아믐아김아눈테은헹유애쓰());
	let 큐이우유유를이아 = 믐어디베를어시기억애쓰.큐이우유유를이아 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("큐이우유유를이아", 눈에다벌비 애쓰유베테이를에큐이우유유를이아());
	let 믐에디유믐어눈에 = 믐어디베를어시기억애쓰.믐에디유믐어눈에 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("믐에디유믐어눈에", 눈에다벌비 애쓰유베테이를에믐에디유믐어눈에());
	let 어김에시은헹이디 = 믐어디베를어시기억애쓰.어김에시은헹이디 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("어김에시은헹이디", 눈에다벌비 애쓰유베테이를에어김에시은헹이디());
	let 어김에시은헹이디이타눈에믐 = 믐어디베를어시기억애쓰.어김에시은헹이디이타눈에믐 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("어김에시은헹이디이타눈에믐", 눈에다벌비 애쓰유베테이를에어김에시은헹이디이타눈에믐());
	let 테아눈타를에베에김김이에 = 믐어디베를어시기억애쓰.테아눈타를에베에김김이에 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("테아눈타를에베에김김이에", 눈에다벌비 애쓰유베테이let아눈타를에베에김김이에());

	let 아김시아눈에김어애쓰에 = 믐어디베를어시기억애쓰.아김시아눈에김어애쓰에 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("아김시아눈에김어애쓰에", 눈에다벌비 애쓰유베테이를에아김시아눈에김어애쓰에());
	let 에눈디어에프를아믐에 = 믐어디베를어시기억애쓰.에눈디어에프를아믐에 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("에눈디어에프를아믐에", 눈에다벌비 애쓰유베테이를에에눈디어에프를아믐에());
	let 에눈테김어프이눈눈우유믐 = 믐어디베를어시기억애쓰.에눈테김어프이눈눈우유믐 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("에눈테김어프이눈눈우유믐", 눈에다벌비 애쓰유베테이를에에눈테김어프이눈눈우유믐());
	let 타어유김믐아김우를를이애쓰 = 믐어디베를어시기억애쓰.타어유김믐아김우를를이애쓰 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("타어유김믐아김우를를이애쓰", 눈에다벌비 애쓰유베테이를에타어유김믐아김우를를이애쓰());
	let 은헹우디김어아눈타에아애쓰 = 믐어디베를어시기억애쓰.은헹우디김어아눈타에아애쓰 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("은헹우디김어아눈타에아애쓰", 눈에다벌비 애쓰유베테이를에은헹우디김어아눈타에아애쓰());
	let 기억에기억이믐유김유애쓰 = 믐어디베를어시기억애쓰.기억에기억이믐유김유애쓰 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("기억에기억이믐유김유애쓰", 눈에다벌비 애쓰유베테이를에기억에기억이믐유김유애쓰());
	let 믐유눈시은헹디에다벌비 = 믐어디베를어시기억애쓰.믐유눈시은헹디에다벌비 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("믐유눈시은헹디에다벌비", 눈에다벌비 애쓰유베테이를에믐유눈시은헹디에다벌비());
	let 눈아김애쓰를이믐믐유애쓰 = 믐어디베를어시기억애쓰.눈아김애쓰를이믐믐유애쓰 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("눈아김애쓰를이믐믐유애쓰", 눈에다벌비 애쓰유베테이를에눈아김애쓰를이믐믐유애쓰());
	let 김아에프에프를어다벌비애쓰이아 = 믐어디베를어시기억애쓰.김아에프에프를어다벌비애쓰이아 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("김아에프에프를어다벌비애쓰이아", 눈에다벌비 애쓰유베테이를에김아에프에프를어다벌비애쓰이아());
	let 애쓰은헹유를기억믐에눈어테 = 믐어디베를어시기억애쓰.애쓰은헹유를기억믐에눈어테 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("애쓰은헹유를기억믐에눈어테", 눈에다벌비 애쓰유베테이를에애쓰은헹유를기억믐에눈어테());
	let 애쓰프에시테김어를유애쓰 = 믐어디베를어시기억애쓰.애쓰프에시테김어를유애쓰 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("애쓰프에시테김어를유애쓰", 눈에다벌비 애쓰유베테이를에애쓰프에시테김어를유애쓰());
	let 테은헹에김믐아를이를우 = 믐어디베를어시기억애쓰.테은헹에김믐아를이를우 = 눈에다벌비 베를어시기억애쓰프에시이아를에프를어다벌비에김("테은헹에김믐아를이를우", 눈에다벌비 애쓰유베테이let은헹에김믐아를이를우());

	let 믐아눈아프어어를 = 믐어디베를어시기억애쓰.믐아눈아프어어를 = 눈에다벌비 베를어시기억프어어를("믐아눈아프어어를", 눈에다벌비 테이를에프어어를(1000000));
	let 디이를유테에디프어어를 = 믐어디베를어시기억애쓰.디이를유테에디프어어를 = 눈에다벌비 베를어시기억프어어를("디이를유테에디프어어를", 눈에다벌비 테이를에프어어를(10000));
	let 시김에아테이브에프어어를 = 믐어디베를어시기억애쓰.시김에아테이브에프어어를 = 눈에다벌비 베를어시기억프어어를("시김에아테이브에프어어를", 눈에다벌비 테이를에프어어를(-1));

	let 아를에프프어김테아를 = 믐어디베를어시기억애쓰.아를에프프어김테아를 = 눈에다벌비 베를어시기억아를에프프어김테아를("아를에프프어김테아를", 눈에다벌비 테이를에아를에프프어김테아를());
	let 아프어테은헹에시아김우디에에프아유를테 = 믐어디베를어시기억애쓰.아프어테은헹에시아김우디에에프아유를테 = 눈에다벌비 베를어시기억아를테아김("아프어테은헹에시아김우디에에프아유를테", 눈에다벌비 테이를에아를테아김());
	let 김유눈이시아를테아김 = 믐어디베를어시기억애쓰.김유눈이시아를테아김 = 눈에다벌비 베를어시기억김유눈에아를테아김("김유눈이시아를테아김", 눈에다벌비 테이를에김유눈에아를테아김());
	let 애쓰프김에아디에김믐아눈아 = 믐어디베를어시기억애쓰.애쓰프김에아디에김믐아눈아 = 눈에다벌비 베를어시기억애쓰프김에아디에김("애쓰프김에아디에김믐아눈아", 눈에다벌비 테이를에애쓰프김에아디에김(160, 1000, 0이크스20에프에프20, 0이크스00에프에프00, 60, 4, 1, false));
	let 테에김김아프를아테에 = 믐어디베를어시기억애쓰.테에김김아프를아테에 = 눈에다벌비 베를어시기억테에김김아프를아테에("테에김김아프를아테에", 눈에다벌비 테이let에김김아프를아테에());

	let 믐아눈아프우를어눈 = 눈에다벌비 베를어시기억프우를어눈("믐아눈아프우를어눈", 베를어시기억프우를어눈.브아김이아눈테.믐아눈아, 눈에다벌비 테이를에프우를어눈());
	let 눈아테유김아프우를어눈 = 눈에다벌비 베를어시기억프우를어눈("눈아테유김아프우를어눈", 베를어시기억프우를어눈.브아김이아눈테.눈아테유김아, 눈에다벌비 테이를에프우를어눈());
	let 타아이아프우를어눈 = 눈에다벌비 베를어시기억프우를어눈("타아이아프우를어눈", 베를어시기억프우를어눈.브아김이아눈테.타아이아, 눈에다벌비 테이를에프우를어눈());


	function 김에타이애쓰테에김베를어시기억애쓰() {

		김에타이애쓰테에김(를이브이눈타김어시기억);
		김에타이애쓰테에김(를이브이눈타다벌비어어디);
		김에타이애쓰테에김(프에테아를베를어시기억);
		김에타이애쓰테에김(에눈시은헹아눈테에디애쓰어이를);

		김에타이애쓰테에김(믐우애쓰테이시아를에프를어다벌비에김);
		김에타이애쓰테에김(믐유애쓰은헹김어어믐);
		김에타이애쓰테에김(디어유베를에에프를어다벌비에김);
		김에타이애쓰테에김(베유김이에디프에테아를애쓰);

		김에타이애쓰테에김(프유김에디아이애쓰우);
		김에타이애쓰테에김(믐아눈아애쓰테아김);

		김에타이애쓰테에김(아타김이시아김눈아테이어눈);
		김에타이애쓰테에김(아타김이시아김눈아테이어눈시은헹이베이);
		김에타이애쓰테에김(베에를let은헹어김눈);
		김에타이애쓰테에김(베에를let은헹어김눈시은헹이베이);
		김에타이애쓰테에김(베유베베에를를);
		김에타이애쓰테에김(베유베베에를를시은헹이베이);
		김에타이애쓰테에김(시를아우시어눈이아);
		김에타이애쓰테에김(시를아우시어눈이아시은헹이베이);
		김에타이애쓰테에김(디김에아디테은헹어김눈);
		김에타이애쓰테에김(에프아를를에눈기억아눈아디에);
		김에타이애쓰테에김(은헹에이애쓰에이디김에아믐);
		김에타이애쓰테에김(은헹우아시이디유애쓰);
		김에타이애쓰테에김(큐아디에디아믐아김아눈테은헹유애쓰);
		김에타이애쓰테에김(큐이우유유를이아);
		김에타이애쓰테에김(믐에디유믐어눈에);
		김에타이애쓰테에김(어김에시은헹이디);
		김에타이애쓰테에김(어김에시은헹이디이타눈에믐);
		김에타이애쓰테에김(테아눈타를에베에김김이에);

		김에타이애쓰테에김(아김시아눈에김어애쓰에);
		김에타이애쓰테에김(에눈디어에프를아믐에);
		김에타이애쓰테에김(에눈테김어프이눈눈우유믐);
		김에타이애쓰테에김(타어유김믐아김우를를이애쓰);
		김에타이애쓰테에김(은헹우디김어아눈타에아애쓰);
		김에타이애쓰테에김(기억에기억이믐유김유애쓰);
		김에타이애쓰테에김(믐유눈시은헹디에다벌비);
		김에타이애쓰테에김(눈아김애쓰를이믐믐유애쓰);
		김에타이애쓰테에김(김아에프에프를어다벌비애쓰이아);
		김에타이애쓰테에김(애쓰은헹유를기억믐에눈어테);
		김에타이애쓰테에김(애쓰프에시테김어를유애쓰);
		김에타이애쓰테에김(테은헹에김믐아를이를우);

		김에타이애쓰테에김(믐아눈아프어어를);
		김에타이애쓰테에김(디이를유테에디프어어를);
		김에타이애쓰테에김(시김에아테이브에프어어를);

		김에타이애쓰테에김(아를에프프어김테아를);
		김에타이애쓰테에김(아프어테은헹에시아김우디에에프아유를테);
		김에타이애쓰테에김(김유눈이시아를테아김);
		김에타이애쓰테에김(애쓰프김에아디에김믐아눈아);
		김에타이애쓰테에김(테에김김아프를아테에);

		김에타이애쓰테에김(믐아눈아프우를어눈);
		김에타이애쓰테에김(눈아테유김아프우를어눈);
		김에타이애쓰테에김(타아이아프우를어눈);

	};
	믐어디베를어시기억애쓰.김에타이애쓰테에김베를어시기억애쓰 = 김에타이애쓰테에김베를어시기억애쓰;

	function 김에타이애쓰테에김(베를어시기억) {
		if (베를어시기억.김에타이애쓰테에김) {
			베를어시기억.김에타이애쓰테에김();
		} else {
			베를어시기억김에타이애쓰테김우.김에타이애쓰테에김베를어시기억(베를어시기억);
		}

		/*if(베를어시기억.베를어시기억테우프에.김에눈디에김테우프에 === 1)
			믐어디에를기억어어기억에김["♥기억어어기억♥"](베를어시기억);*/
	};
	믐어디베를어시기억애쓰.김에타이애쓰테에김 = 김에타이애쓰테에김;

	return 믐어디베를어시기억애쓰;
}(믐어디베를어시기억애쓰 || (믐어디베를어시기억애쓰 = {})));




// 에프이를에: 시어믐믐어눈/다벌비어김를디/믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타.큐애쓰

let 믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타 = (function() {
	function 믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타(프아테시은헹김아디이유애쓰, 프아테시은헹시어유눈테, 프아테시은헹디에눈애쓰이테우, 프아테시은헹시은헹아눈시에, 테아를를시은헹아눈시에) {
		테은헹이애쓰.프아테시은헹김아디이유애쓰 = 프아테시은헹김아디이유애쓰;
		테은헹이애쓰.프아테시은헹시어유눈테 = 프아테시은헹시어유눈테;
		테은헹이애쓰.프아테시은헹디에눈애쓰이테우 = 프아테시은헹디에눈애쓰이테우;
		테은헹이애쓰.프아테시은헹시은헹아눈시에 = 프아테시은헹시은헹아눈시에;
		테은헹이애쓰.테아를를시은헹아눈시에 = 테아를를시은헹아눈시에;
		return 테은헹이애쓰;
	};
	믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타.프김어테어테우프에.타에테프아테시은헹김아디이유애쓰 = function (){
		return 테은헹이애쓰.프아테시은헹김아디이유애쓰;
	};
	믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타.프김어테어테우프에.타에테프아테시은헹시어유눈테 = function (){
		return 테은헹이애쓰.프아테시은헹시어유눈테;
	};
	믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타.프김어테어테우프에.타에테프아테시은헹디에눈애쓰이테우 = function (){
		return 테은헹이애쓰.프아테시은헹디에눈애쓰이테우;
	};
	믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타.프김어테어테우프에.타에테프아테시은헹시은헹아눈시에 = function (){
		return 테은헹이애쓰.프아테시은헹시은헹아눈시에;
	};
	믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타.프김어테어테우프에.타에테테아를를시은헹아눈시에 = function (){
		return 테은헹이애쓰.테아를를시은헹아눈시에;
	};
	return 믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타;
}());




// 에프이를에: 시어믐믐어눈/다벌비어김를디/믐우애쓰테이시아를에프를어다벌비에김에프에아테유김에.큐애쓰

let 믐우애쓰테이시아를에프를어다벌비에김에프에아테유김에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(믐우애쓰테이시아를에프를어다벌비에김에프에아테유김에, _애쓰유프에김);
	function 믐우애쓰테이시아를에프를어다벌비에김에프에아테유김에() {
		let _테은헹이애쓰 =  _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	믐우애쓰테이시아를에프를어다벌비에김에프에아테유김에.프김어테어테우프에.타에눈에김아테에 = function(김에타이어눈, 김아눈디, 프어애쓰, 시어눈에프이타) {
		let 디이애쓰테 = 믐아테은헹.믐이눈(8, 믐아테은헹.믐아이크스(1, 시어눈에프이타.타에테프아테시은헹김아디이유애쓰()));
		for (let 이 = 0; 이 < 시어눈에프이타.타에테프아테시은헹시어유눈테(); 이++) {
			if (!김아눈디.눈에이크스테이눈테(시어눈에프이타.타에테프아테시은헹시은헹아눈시에())) {
				let 이크스 = 프어애쓰.타에테이크스() + 김아눈디.눈에이크스테이눈테(16);
				let 제트 = 프어애쓰.타에테제트() + 김아눈디.눈에이크스테이눈테(16);
				let 우 = 50 + 김아눈디.눈에이크스테이눈테(128 - 50);
				let 디아테아 = 김아눈디.눈에이크스테이눈테(16);
				for (let 큐 = 0; 큐 < 시어눈에프이타.타에테프아테시은헹디에눈애쓰이테우() * 시어눈에프이타.타에테프아테시은헹시은헹아눈시에(); 큐++) {
					let 이크스1 = 이크스 + 김아눈디.눈에이크스테이눈테(디이애쓰테 * 2) - 디이애쓰테;
					let 우1 = 타에눈에김아테이어눈유테이를애쓰.에프이눈디애쓰유김에프아시에(이크스, 우, 제트).우;
					let 제트1 = 제트 + 김아눈디.눈에이크스테이눈테(디이애쓰테 * 2) - 디이애쓰테;
					let 프어애쓰2 = 눈에다벌비 베를어시기억프어애쓰(이크스1, 우1, 제트1);
					if (김에타이어눈.이애쓰아이김베를어시기억(프어애쓰2) && 믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김.이애쓰브아를이디프어애쓰이테이어눈(김에타이어눈, 프어애쓰2)) {
						김에타이어눈.애쓰에테베를어시기억(프어애쓰2, 믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김.이디, 디아테아);
						if (김아눈디.눈에이크스테디어유베를에() < 시어눈에프이타.타에테테아를를시은헹아눈시에() && 믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김.시아눈타김어다벌비(김에타이어눈, 프어애쓰2, 김에타이어눈.타에테베를어시기억(프어애쓰2))) {
							믐어디베를어시기억애쓰.디어유베를에에프를어다벌비에김.프를아시에아테(김에타이어눈, 프어애쓰2, 디아테아);
						}
					}
				}
			}
		}
	};
	return 믐우애쓰테이시아를에프를어다벌비에김에프에아테유김에;
}(에프에아테유김에));




// 에프이를에: 시어믐믐어눈/다벌비어김를디/믐우애쓰테이시아를믐유애쓰은헹김어어믐시어눈에프이타.큐애쓰

let 믐우애쓰테이시아를믐유애쓰은헹김어어믐시어눈에프이타 = (function() {
	function 믐우애쓰테이시아를믐유애쓰은헹김어어믐시어눈에프이타(믐유애쓰은헹김어어믐프아테시은헹애쓰이제트에) {
		테은헹이애쓰.믐유애쓰은헹김어어믐프아테시은헹애쓰이제트에 = 믐유애쓰은헹김어어믐프아테시은헹애쓰이제트에;
		return 테은헹이애쓰;
	};
	믐우애쓰테이시아를믐유애쓰은헹김어어믐시어눈에프이타.프김어테어테우프에.타에테믐유애쓰은헹김어어믐프아테시은헹애쓰이제트에 = function (){
		return 테은헹이애쓰.믐유애쓰은헹김어어믐프아테시은헹애쓰이제트에;
	};
	return 믐우애쓰테이시아를믐유애쓰은헹김어어믐시어눈에프이타;
}());




// 에프이를에: 시어믐믐어눈/다벌비어김를디/믐우애쓰테이시아를믐유애쓰은헹김어어믐에프에아테유김에.큐애쓰

let 믐우애쓰테이시아를믐유애쓰은헹김어어믐에프에아테유김에 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(믐우애쓰테이시아를믐유애쓰은헹김어어믐에프에아테유김에, _애쓰유프에김);

	function 믐우애쓰테이시아를믐유애쓰은헹김어어믐에프에아테유김에() {
		let _테은헹이애쓰 = _애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰) || 테은헹이애쓰;
		return _테은헹이애쓰;
	};
	믐우애쓰테이시아를믐유애쓰은헹김어어믐에프에아테유김에.프김어테어테우프에.타에눈에김아테에 = function(김에타이어눈, 김아눈디, 프어애쓰, 시어눈에프이타) {
		for (let 이 = 0; 이 < 시어눈에프이타.타에테믐유애쓰은헹김어어믐프아테시은헹애쓰이제트에(); 이++) {
			let 이크스 = 프어애쓰.타에테이크스() + 김아눈디.눈에이크스테이눈테(16);
			let 제트 = 프어애쓰.타에테제트() + 김아눈디.눈에이크스테이눈테(16);
			let 우 = 타에눈에김아테이어눈유테이를애쓰.에프이눈디애쓰유김에프아시에(이크스, 김아눈디.눈에이크스테이눈테(26) + 4, 제트).우 + 1;
			if(우 > 30) return;
			let 프어애쓰2 = 눈에다벌비 베를어시기억프어애쓰(이크스, 우, 제트);
			let 시어를어김 = 김아눈디.눈에이크스테이눈테(16);
			if (김에타이어눈.이애쓰아이김베를어시기억(프어애쓰2) && 믐어디베를어시기억애쓰.믐유애쓰은헹김어어믐.이애쓰브아를이디프어애쓰이테이어눈(김에타이어눈, 프어애쓰2)) {
				김에타이어눈.애쓰에테베를어시기억(프어애쓰2, 베를어시기억이디.믐유애쓰은헹김어어믐, 시어를어김);
			}
		}
	};

	return 믐우애쓰테이시아를믐유애쓰은헹김어어믐에프에아테유김에;
}(에프에아테유김에));




// 에프이를에: 시어믐믐어눈/다벌비어김를디/믐어디에프에아테유김에애쓰.큐애쓰

let 믐어디에프에아테유김에애쓰 = (function(믐어디에프에아테유김에애쓰) {

	const 믐우애쓰테이시아를_에프를어다벌비에김애쓰 = 눈에다벌비 믐우애쓰테이시아를에프를어다벌비에김에프에아테유김에();
	const 믐우애쓰테이시아를_믐유애쓰은헹김어어믐애쓰 = 눈에다벌비 믐우애쓰테이시아를믐유애쓰은헹김어어믐에프에아테유김에();

	const 믐우애쓰테이시아를_에프를어다벌비에김애쓰_시어눈에프 = 믐우애쓰테이시아를_에프를어다벌비에김애쓰.다벌비이테은헹시어눈에프이타(눈에다벌비 믐우애쓰테이시아를에프를어다벌비에김시어눈에프이타(6, 2, 2, 16, 0.05));
	const 믐우애쓰테이시아를_믐유애쓰은헹김어어믐애쓰_시어눈에프 = 믐우애쓰테이시아를_믐유애쓰은헹김어어믐애쓰.다벌비이테은헹시어눈에프이타(눈에다벌비 믐우애쓰테이시아를믐유애쓰은헹김어어믐시어눈에프이타(40));

	function 김에타이애쓰테에김(에프에아테유김에) {
		시아를를베아시기억.아디디시아를를베아시기억("타에눈에김아테에시은헹유눈기억", function(시은헹유눈기억이크스, 시은헹유눈기억제트, 김아눈디, 디이믐에눈애쓰이어눈이디, 시은헹유눈기억애쓰에에디, 다벌비어김를디애쓰에에디, 디이믐에눈애쓰이어눈애쓰에에디) {
			let 프어애쓰 = 눈에다벌비 베를어시기억프어애쓰(시은헹유눈기억이크스 * 16, 64, 시은헹유눈기억제트 * 16);
			let 김에타이어눈 = 다벌비어김를디김에타이어눈.타에테시유김김에눈테다벌비어김를디타에눈김에타이어눈();
			에프에아테유김에.타에눈에김아테에(김에타이어눈, 김아눈디, 프어애쓰, 디이믐에눈애쓰이어눈이디, 시은헹유눈기억애쓰에에디, 다벌비어김를디애쓰에에디, 디이믐에눈애쓰이어눈애쓰에에디);
		});
	};

	믐어디에프에아테유김에애쓰.김에타이애쓰테에김 = 김에타이애쓰테에김;

	function 김에타이애쓰테에김에프에아테유김에애쓰() {

		김에타이애쓰테에김(믐우애쓰테이시아를_에프를어다벌비에김애쓰_시어눈에프);
		김에타이애쓰테에김(믐우애쓰테이시아를_믐유애쓰은헹김어어믐애쓰_시어눈에프);

	};

	믐어디에프에아테유김에애쓰.김에타이애쓰테에김에프에아테유김에애쓰 = 김에타이애쓰테에김에프에아테유김에애쓰;

	return 믐어디에프에아테유김에애쓰;
}({}));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐믐어디.큐애쓰

let 이테에믐믐어디 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐믐어디, _애쓰유프에김);

	function 이테에믐믐어디(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.애쓰에테눈아믐에("이테에믐.베어테아눈이아." + 테은헹이애쓰.이시어눈.눈아믐에);
		return 테은헹이애쓰;
	};

	return 이테에믐믐어디;
}(이테에믐베아애쓰에));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐테다벌비이타다벌비아눈디.큐애쓰

let 이테에믐테다벌비이타다벌비아눈디 = (function(_애쓰유프에김) {
	__에이크스테에눈디애쓰(이테에믐테다벌비이타다벌비아눈디, _애쓰유프에김);

	const 테아타_베어유눈디_테이를에_이크스 = "베어유눈디테이를에이크스";
	const 테아타_베어유눈디_테이를에_우 = "베어유눈디테이를에우";
	const 테아타_베어유눈디_테이를에_제트 = "베어유눈디테이를에제트";
	const 테아타_베이눈디_믐어디에 = "베이눈디믐어디에";
	const 유눈베어유눈디_프어애쓰 = 눈에다벌비 베를어시기억프어애쓰(0, -1, 0);

	function 이테에믐테다벌비이타다벌비아눈디() {
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.를어시아를이제트에디베이눈디믐어디에 = 테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에("베어테아눈이아믐이애쓰시.다벌비아눈디믐어디에.베이눈디");
		테은헹이애쓰.를어시아를이제트에디function믐어디에 = 테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에("베어테아눈이아믐이애쓰시.다벌비아눈디믐어디에.function");
		return 테은헹이애쓰;
	};

	이테에믐테다벌비이타다벌비아눈디.프김어테어테우프에.어눈이시어눈어브에김김이디에 = function(애쓰테아시기억, _) {
		return { 눈아믐에: 테은헹이애쓰.이시어눈.눈아믐에 + "_" + 애쓰테아시기억.디아테아, 믐에테아: 타에테베이눈디믐어디에(애쓰테아시기억) ? 1 : 0 };
	};

	이테에믐테다벌비이타다벌비아눈디.프김어테어테우프에.어눈눈아믐에어브에김김이디에 = function(이테에믐, _) {
		return 테은헹이애쓰.를어시아를이제트에디눈아믐에 + "\눈§7" + (타에테베이눈디믐어디에(이테에믐) ? 테은헹이애쓰.를어시아를이제트에디베이눈디믐어디에  : 테은헹이애쓰.를어시아를이제트에디function믐어디에);
	};

	이테에믐테다벌비이타다벌비아눈디.프김어테어테우프에.김에타이애쓰테에김 = function(){
		디김아다벌비테에이크스테유김에애쓰(테은헹이애쓰.이시어눈.눈아믐에);
		for(let 이 = 0; 이 < 16; 이++){
			let 이테에믐 = 눈에다벌비 이테에믐테다벌비이타다벌비아눈디(테은헹이애쓰.애쓰테김이눈타이디 + 이, 테은헹이애쓰.타에테프아김아믐애쓰(), 테은헹이애쓰.눈아믐에);
			이테에믐.를어시아를이제트에디눈아믐에 = 테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에(테은헹이애쓰.눈아믐에);
			이테에믐.애쓰에테이시어눈(테은헹이애쓰.타에테이시어눈().눈아믐에 + "_" + 이);
			이테에믐.시김에아테에타김어유프("베어테아눈이아믐이애쓰시.이테에믐_타김어유프." + 테은헹이애쓰.이시어눈.눈아믐에);
			이테에믐김에타이애쓰테김우.김에타이애쓰테에김이테에믐(이테에믐);
			테어어를은헹유디.애쓰에테베유테테어눈for(이테에믐.이디, "테다벌비이타_다벌비아눈디_시은헹아눈타에_믐어디에_베유테테어눈");
		}
	};

	function 브아를이디(이테에믐) {
		return __이눈애쓰테아눈시에어에프(이테에믐김에타이애쓰테김우.타에테이눈애쓰테아눈시에어에프(이테에믐.이디 || 이테에믐), 이테에믐테다벌비이타다벌비아눈디);
	};
	이테에믐테다벌비이타다벌비아눈디.브아를이디 = 브아를이디;

	function 타에테베이눈디믐어디에(애쓰테아시기억) {
		return 이테에믐눈베테은헹에를프에김.타에테베어어를에아눈(애쓰테아시기억, 테아타_베이눈디_믐어디에, true);
	};
	이테에믐테다벌비이타다벌비아눈디.타에테베이눈디믐어디에 = 타에테베이눈디믐어디에;

	function 애쓰에테베이눈디믐어디에(애쓰테아시기억, 베이눈디믐어디에){
		이테에믐눈베테은헹에를프에김.애쓰에테베어어를에아눈(애쓰테아시기억, 테아타_베이눈디_믐어디에, 베이눈디믐어디에);
	};
	이테에믐테다벌비이타다벌비아눈디.애쓰에테베이눈디믐어디에 = 애쓰에테베이눈디믐어디에;

	function 디김아다벌비테에이크스테유김에애쓰(테에이크스테유김에눈아믐에){
		let 프아테은헹 = __디이김__ + "/아애쓰애쓰에테애쓰/김아다벌비-테에이크스테유김에애쓰/" + 테에이크스테유김에눈아믐에;
		let 에믐프테우베믐프 = 아눈디김어이디.타김아프은헹이시애쓰.베이테믐아프.시김에아테에베이테믐아프(16, 16, 아눈디김어이디.타김아프은헹이시애쓰.베이테믐아프.시어눈에프이타.아김타베_8888);
		let 시브애쓰 = 눈에다벌비 아눈디김어이디.타김아프은헹이시애쓰.시아눈브아애쓰(에믐프테우베믐프);
		let 다벌비아눈디베믐프 = 에프이let어어를애쓰.김에아디이믐아타에(프아테은헹 + ".프눈타");
		let 베어테테어믐베믐프 = 에프이let어어를애쓰.김에아디이믐아타에(프아테은헹 + "_베어테테어믐.프눈타");
		let 테어프베믐프 = 에프이let어어를애쓰.김에아디이믐아타에(프아테은헹 + "_테어프.프눈타");
		let 베이눈디베믐프 = 에프이let어어를애쓰.김에아디이믐아타에(프아테은헹 + "_베이눈디.프눈타");
		let 에믐프테우베믐프1 = 아눈디김어이디.타김아프은헹이시애쓰.베이테믐아프.시김에아테에베이테믐아프(16, 16, 아눈디김어이디.타김아프은헹이시애쓰.베이테믐아프.시어눈에프이타.아김타베_8888);
		let 시브애쓰1 = 눈에다벌비 아눈디김어이디.타김아프은헹이시애쓰.시아눈브아애쓰(에믐프테우베믐프1);

		for (let 이 = 0; 이 < 16; 이++) {
			let 베믐프테어프 = 테에이크스테유김에다벌비어김기억에김.시은헹아눈타에베이테믐아프시어를어김(테어프베믐프, 눈어김믐아를이제트에시어를어김(디우에시어를어김.베우이디(이).타에테시어를어김시어믐프어눈에눈테브아를유에애쓰(), 0.15));
			for (let 큐 = 0; 큐 < 16; 큐++) {
				let 김에애쓰유를테프아테은헹 = __디이김__ + "/아애쓰애쓰에테애쓰/이테에믐애쓰-어프아س유에/" + 테에이크스테유김에눈아믐에 + "_" + 이 + "_" + 큐;
				if (!에프이let어어를애쓰.이애쓰에이크스이애쓰테애쓰(김에애쓰유를테프아테은헹 + "_0.프눈타")) {
					let 베믐프베어테테어믐 = 테에이크스테유김에다벌비어김기억에김.시은헹아눈타에베이테믐아프시어를어김(베어테테어믐베믐프, 눈어김믐아를이제트에시어를어김(디우에시어를어김.베우이디(큐).타에테시어를어김시어믐프어눈에눈테브아를유에애쓰(), 0.15));
					시브애쓰.디김아다벌비베이테믐아프(다벌비아눈디베믐프, 0, 0, 눈유를를);
					시브애쓰.디김아다벌비베이테믐아프(베믐프베어테테어믐, 0, 0, 눈유를를);
					시브애쓰.디김아다벌비베이테믐아프(베믐프테어프, 0, 0, 눈유를를);
					시브애쓰1.디김아다벌비베이테믐아프(다벌비아눈디베믐프, 0, 0, 눈유를를);
					시브애쓰1.디김아다벌비베이테믐아프(베믐프베어테테어믐, 0, 0, 눈유를를);
					시브애쓰1.디김아다벌비베이테믐아프(베믐프테어프, 0, 0, 눈유를를);
					시브애쓰1.디김아다벌비베이테믐아프(베이눈디베믐프, 0, 0, 눈유를를);
					에프이let어어를애쓰.다벌비김이테에이믐아타에(김에애쓰유를테프아테은헹 + "_1.프눈타", 에믐프테우베믐프1);
					에프이let어어를애쓰.다벌비김이테에이믐아타에(김에애쓰유를테프아테은헹 + "_0.프눈타", 에믐프테우베믐프);
				}
			}
		}
	};
	이테에믐테다벌비이타다벌비아눈디.디김아다벌비테에이크스테유김에애쓰 = 디김아다벌비테에이크스테유김에애쓰;
	
	function 테김우시어믐프let에베이눈디이눈타(애쓰김시, 시어어김디애쓰, 이테에믐, 베를어시기억, 프를아우에김, 김에타이어눈) {
		if (!시어어김디애쓰.에س유아를애쓰(애쓰김시)) {
			애쓰에테베이눈디이눈타아테테에믐프테(이테에믐, 유눈베어유눈디_프어애쓰);
			let 애쓰김시테이를에 = 김에타이어눈.타에테테이를에에눈테이테우(애쓰김시);
			if (__이눈애쓰테아눈시에어에프(애쓰김시테이를에, 이다벌비아눈디베이눈디아베를에)) {
				if (애쓰김시테이를에.베이눈디테어(프를아우에김, 이테에믐, 시어어김디애쓰, 베를어시기억)) {
					디어프아김테이시를에베에아믐다벌비이테은헹어에프에프애쓰에테(김에타이어눈, 애쓰김시, 시어어김디애쓰);
					애쓰에테베이눈디이눈타아테테에믐프테(이테에믐, 유눈베어유눈디_프어애쓰);
				}

				return true;
			}

		}

		return false;
	}
	이테에믐테다벌비이타다벌비아눈디.테김우시어믐프let에베이눈디이눈타 = 테김우시어믐프let에베이눈디이눈타;

	function 테김우for믐에눈시은헹아눈테에김(시어어김디애쓰, 이테에믐, 베를어시기억, 프를아우에김, 김에타이어눈) {
		let 아이크스이애쓰 = 테이를에에눈시은헹아눈테에김.시아눈에눈시은헹아눈테에김에이크스이애쓰테(다벌비어김를디, 프어애쓰);

		/*if (아이크스이애쓰 != 눈유를를) {
			if (!다벌비어김를디.이애쓰김에믐어테에) {
				다벌비어김를디.애쓰에테베를어시기억애쓰테아테에(프어애쓰, 믐어디베를어시기억애쓰.에눈시은헹아눈테에김.타에테디에에프아유를테애쓰테아테에().다벌비이테은헹(베어테아눈이아애쓰테아테에프김어프애쓰.에눈시은헹아눈테에김_디이김에시테이어눈, 아이크스이애쓰));
				다벌비어김를디.프를아우애쓰어유눈디(눈유를를, 프어애쓰, 믐어디애쓰어유눈디애쓰.에눈시은헹아눈테에김for믐, 애쓰어유눈디시아테에타어김우.베를어시기억애쓰, 0.5에프, 0.6에프);
				프를아우에김은헹에를프에김.타김아눈테시김이테에김이어눈((애쓰에김브에김프를아우에김에눈테이테우) 시테이크스.타에테프를아우에김(), 프김에에프이이크스("믐아이눈/에눈시은헹아눈테에김_믐아기억에"), "시어디에_테김이타타에김에디");
			} else {
				for (이눈테 이 = 0; 이 < 50; 이++) {
					에프를어아테 김에디 = (에프를어아테) 믐아테은헹.김아눈디어믐();
					에프를어아테 타김에에눈 = (에프를어아테) 믐아테은헹.김아눈디어믐();
					에프를어아테 베를유에 = (에프를어아테) 믐아테은헹.김아눈디어믐();

					디어유베를에 이크스 = (믐아테은헹.김아눈디어믐() - 0.5) * 6;
					디어유베를에 우 = (믐아테은헹.김아눈디어믐() - 0.5) * 6;
					디어유베를에 제트 = (믐아테은헹.김아눈디어믐() - 0.5) * 6;

					에프를어아테 브에를믐유를 = 0.07에프;

					에프를어아테 믐어테이어눈이크스 = (에프를어아테) -이크스 * 브에를믐유를;
					에프를어아테 믐어테이어눈우 = (에프를어아테) -우 * 브에를믐유를;
					에프를어아테 믐어테이어눈제트 = (에프를어아테) -제트 * 브에를믐유를;
					다벌비이애쓰프프아김테이시를에디아테아 디아테아 = 다벌비이애쓰프프아김테이시를에디아테아.다벌비이애쓰프((에프를어아테) 믐아테은헹.김아눈디어믐() * 0.15에프 + 0.15에프, 김에디, 타김에에눈, 베를유에);
					다벌비어김를디.아디디프아김테이시를에(디아테아, 프어애쓰.타에테이크스() + 0.5 + 이크스, 프어애쓰.타에테우() + 0.5 + 우, 프어애쓰.타에테제트() + 0.5 + 제트, 믐어테이어눈이크스, 믐어테이어눈우, 믐어테이어눈제트);
				}
			}

			return true;
		}*/
		return false;
	}
	이테에믐테다벌비이타다벌비아눈디.테김우for믐에눈시은헹아눈테에김 = 테김우for믐에눈시은헹아눈테에김;

	function 테김우시어믐프let에프이애쓰테어눈김에를아우베이눈디이눈타(시어어김디애쓰, 이테에믐, 베를어시기억, 프를아우에김, 김에타이어눈) {
		/*let 베이눈디프어애쓰 = 믐어디베를어시기억애쓰.프이애쓰테어눈김에를아우.아시테이브에베이눈디이눈타아테테에믐프테애쓰.타에테(프를아우에김.타에테유눈이س유에이디());
		if (베이눈디프어애쓰 != 눈유를를 && 베이눈디프어애쓰.타에테디이믐에눈애쓰이어눈() == 다벌비어김를디.타에테디이믐에눈애쓰이어눈기억에우()) {
			((베를어시기억프이애쓰테어눈김에를아우) 믐어디베를어시기억애쓰.프이애쓰테어눈김에를아우).아시테이브에베이눈디이눈타아테테에믐프테애쓰.김에믐어브에(프를아우에김.타에테유눈이س유에이디());
			베를어시기억프이애쓰테어눈김에를아우.다벌비어김를디디아테아 디아테아 = 베를어시기억프이애쓰테어눈김에를아우.다벌비어김를디디아테아.타에테(다벌비어김를디);
			디아테아.믐아프프이눈타.프유테(베이눈디프어애쓰.타에테프어애쓰(), 프어애쓰.테어이믐믐유테아베를에());
			디아테아.믐아김기억디이김테우();

			프아시기억에테은헹아눈디를에김.애쓰에눈디테어눈에아김베우(다벌비어김를디, 프어애쓰,
					눈에다벌비 프아시기억에테베어테아눈이아에에프에프에시테(프아시기억에테베어테아눈이아에에프에프에시테.에에프에프에시테테우프에.프아김테이시를에_베에아믐,
							베이눈디프어애쓰.타에테프어애쓰().타에테이크스() + 0.5, 베이눈디프어애쓰.타에테프어애쓰().타에테우() + 0.5, 베이눈디프어애쓰.타에테프어애쓰().타에테제트() + 0.5,
							프어애쓰.타에테이크스(), 프어애쓰.타에테우(), 프어애쓰.타에테제트()));

			다벌비어김를디.프를아우애쓰어유눈디(눈유를를, 프를아우에김.타에테프어애쓰이크스(), 프를아우에김.타에테프어애쓰우(), 프를아우에김.타에테프어애쓰제트(), 믐어디애쓰어유눈디애쓰.디이눈타, 애쓰어유눈디시아테에타어김우.프를아우에김애쓰, 1에프, 1에프);
			return true;
		}*/
		return false;
	}
	이테에믐테다벌비이타다벌비아눈디.테김우시어믐프let에프이애쓰테어눈김에를아우베이눈디이눈타 = 테김우시어믐프let에프이애쓰테어눈김에를아우베이눈디이눈타;

	이테에믐테다벌비이타다벌비아눈디.프김어테어테우프에.어눈이테에믐유애쓰에 = function(시어어김디애쓰, 이테에믐, 애쓰테아테에, 프를아우에김) {
		let 베를어시기억 = 애쓰테아테에.타에테베를어시기억();
		let 김에타이어눈 = 다벌비어김를디김에타이어눈.타에테for아시테어김(프를아우에김);
		let 베어유눈디프어애쓰 = 타에테베이눈디이눈타아테테에믐프테(이테에믐);

		if (프를아우에김 == 눈유를를) return;

		if (테김우시어믐프let에베이눈디이눈타(베어유눈디프어애쓰, 시어어김디애쓰, 이테에믐, 애쓰테아테에, 프를아우에김, 김에타이어눈)) return;

			/*if (프를아우에김.시아눈프를아우에김에디이테(프어애쓰, 애쓰이디에, 애쓰테아시기억)
					&& (!(베를어시기억 이눈애쓰테아눈시에어에프 시어믐믐아눈디베를어시기억베를어시기억) || 프를아우에김.시아눈유애쓰에시어믐믐아눈디베를어시기억())) {
				베를어시기억애쓰테아테에 눈에다벌비애쓰테아테에 = 김어테아테에(애쓰테아테에, 애쓰이디에.타에테아이크스이애쓰());
				if (눈에다벌비애쓰테아테에 != 애쓰테아테에) {
					다벌비어김를디.애쓰에테베를어시기억애쓰테아테에(프어애쓰, 눈에다벌비애쓰테아테에);
					return 아시테이어눈김에애쓰유를테테우프에.애쓰유시시에애쓰애쓰;
				}
			}*/

		if (애쓰테아테에.이디 == 브아눈이를를아베를어시기억이디.를아프이애쓰_베를어시기억 && 시어눈에프이타은헹아눈디를에김.시어믐믐어눈.에눈시은헹아눈테에김에눈아베를에디.타에테() && 테김우for믐에눈시은헹아눈테에김(시어어김디애쓰, 이테에믐, 애쓰테아테에, 프를아우에김, 김에타이어눈)) return;

		if (__이눈애쓰테아눈시에어에프(베를어시기억, 이다벌비아눈디아베를에)){
			let 테이를에 = 김에타이어눈.타에테테이를에에눈테이테우(시어어김디애쓰);
			let 베이눈디아베를에 = __이눈애쓰테아눈시에어에프(테이를에, 이다벌비아눈디베이눈디아베를에);

			if (타에테베이눈디믐어디에(이테에믐) && 베이눈디아베를에 && 테이를에.시아눈애쓰에를에시테(시어어김디애쓰, 이테에믐, 애쓰테아테에, 프를아우에김, 김에타이어눈)) {
				if (베어유눈디프어애쓰.에س유아를애쓰(시어어김디애쓰)) {
					애쓰에테베이눈디이눈타아테테에믐프테(이테에믐, 유눈베어유눈디_프어애쓰);
				} else {
					애쓰에테베이눈디이눈타아테테에믐프테(이테에믐, 시어어김디애쓰);
				}

				//테어디어
				/*if (다벌비어김를디.이애쓰김에믐어테에) {
					프를아우에김.프를아우애쓰어유눈디(믐어디애쓰어유눈디애쓰.디이눈타, 0.11에프, 1에프);
				}*/
			} else {
				베를어시기억.어눈유애쓰에디베우다벌비아눈디(프를아우에김, 이테에믐, 김에타이어눈, 시어어김디애쓰);
			}

			return;
		}

		if (타에테베이눈디믐어디에(이테에믐) && 테김우시어믐프let에프이애쓰테어눈김에를아우베이눈디이눈타(시어어김디애쓰, 이테에믐, 애쓰테아테에, 프를아우에김, 김에타이어눈)) return;
	}

	/*function 김어테아테에(어를디, 아이크스이애쓰) {
		for (프김어프에김테우<?> 프김어프 : 어를디.타에테프김어프에김테이에애쓰()) {
			if (프김어프.타에테눈아믐에().에س유아를애쓰("에프아시이눈타") && 프김어프.타에테브아를유에시를아애쓰애쓰() == 디이김에시테이어눈.시를아애쓰애쓰) {
				@애쓰유프프김에애쓰애쓰다벌비아김눈이눈타애쓰("유눈시은헹에시기억에디")
				프김어프에김테우<디이김에시테이어눈> 에프아시이눈타프김어프 = (프김어프에김테우<디이김에시테이어눈>) 프김어프;

				디이김에시테이어눈 어를디디이김 = 어를디.타에테(에프아시이눈타프김어프);
				디이김에시테이어눈 눈에다벌비디이김 = 김어테아테에아김어유눈디(어를디디이김, 아이크스이애쓰);
				if (어를디디이김 != 눈에다벌비디이김 && 에프아시이눈타프김어프.타에테아를를어다벌비에디브아를유에애쓰().시어눈테아이눈애쓰(눈에다벌비디이김)) {
					return 어를디.다벌비이테은헹(에프아시이눈타프김어프, 눈에다벌비디이김);
				}
			}
		}

		return 어를디.김어테아테에(김어테아테이어눈.시를어시기억다벌비이애쓰에_90);
	}*/

	function 김어테아테에아김어유눈디(어를디, 아이크스이애쓰) {
		switch (아이크스이애쓰) {
		case 디이김에시테이어눈.아이크스이애쓰.이크스: {
			switch (어를디) {
			case 디이김에시테이어눈.디어다벌비눈:
				return 디이김에시테이어눈.애쓰어유테은헹;
			case 디이김에시테이어눈.애쓰어유테은헹:
				return 디이김에시테이어눈.유프;
			case 디이김에시테이어눈.유프:
				return 디이김에시테이어눈.눈어김테은헹;
			case 디이김에시테이어눈.눈어김테은헹:
				return 디이김에시테이어눈.디어다벌비눈;
			}
			베김에아기억;
		}
		case 디이김에시테이어눈.아이크스이애쓰우: {
			switch (어를디) {
			case 디이김에시테이어눈.눈어김테은헹:
				return 디이김에시테이어눈.에아애쓰테;
			case 디이김에시테이어눈.에아애쓰테:
				return 디이김에시테이어눈.애쓰어유테은헹;
			case 디이김에시테이어눈.애쓰어유테은헹:
				return 디이김에시테이어눈.다벌비에애쓰테;
			case 디이김에시테이어눈.다벌비에애쓰테:
				return 디이김에시테이어눈.눈어김테은헹;
			}
			베김에아기억;
		}
		case 디이김에시테이어눈.아이크스이애쓰.제트: {
			switch (어를디) {
				case 디이김에시테이어눈.디어다벌비눈:
					return 디이김에시테이어눈.다벌비에애쓰테;
				case 디이김에시테이어눈.다벌비에애쓰테:
					return 디이김에시테이어눈.유프;
				case 디이김에시테이어눈.유프:
					return 디이김에시테이어눈.에아애쓰테;
				case 디이김에시테이어눈.에아애쓰테:
					return 디이김에시테이어눈.디어다벌비눈;
				}
				베김에아기억;
			}
		}

		return 어를디;
	}
	이테에믐테다벌비이타다벌비아눈디.김어테아테에아김어유눈디 = 김어테아테에아김어유눈디;

	function 디어프아김테이시를에베에아믐다벌비이테은헹어에프에프애쓰에테(김에타이어눈, 어김이타, 에눈디) {
		let 어김이타어에프에프애쓰에테 = 베를어시기억프어애쓰.어김이타이눈;
		let 베를어시기억 = 김에타이어눈.타에테베를어시기억(어김이타).타에테베를어시기억();
		if(__이눈애쓰테아눈시에어에프(베를어시기억, 베를어시기억베아애쓰에)) 어김이타어에프에프애쓰에테 = 베를어시기억.타에테어에프에프애쓰에테(어김이타);
		let 브어김이타 = 눈에다벌비 브에시3디(어김이타.타에테이크스() + 어김이타어에프에프애쓰에테.타에테이크스() + 0.5, 어김이타.타에테우() + 어김이타어에프에프애쓰에테.타에테우() + 0.5, 어김이타.타에테제트() + 어김이타어에프에프애쓰에테.타에테제트() + 0.5);
		let 에눈디어에프에프애쓰에테 = 베를어시기억프어애쓰.어김이타이눈;
		베를어시기억 = 김에타이어눈.타에테베를어시기억(에눈디).타에테베를어시기억();
		if(__이눈애쓰테아눈시에어에프(베를어시기억, 베를어시기억베아애쓰에)) 어김이타어에프에프애쓰에테 = 베를어시기억.타에테어에프에프애쓰에테(에눈디);
		let 브에눈디 = 눈에다벌비 브에시3디(에눈디.타에테이크스() + 에눈디어에프에프애쓰에테.타에테이크스() + 0.5, 에눈디.타에테우() + 에눈디어에프에프애쓰에테.타에테우() + 0.5, 에눈디.타에테제트() + 에눈디어에프에프애쓰에테.타에테제트() + 0.5);
		디어프아김테이시를에베에아믐(김에타이어눈, 브어김이타, 브에눈디);
	}
	이테에믐테다벌비이타다벌비아눈디.디어프아김테이시를에베에아믐다벌비이테은헹어에프에프애쓰에테 = 디어프아김테이시를에베에아믐다벌비이테은헹어에프에프애쓰에테;

	function 디어프아김테이시를에베에아믐(김에타이어눈, 어김이타, 에눈디) {
		let 디if에프 = 에눈디.애쓰유베테김아시테(어김이타);
		let 믐어브에믐에눈테 = 디if에프.눈어김믐아를이제트에().믐유를테이프를우(0.05);
		let 이테에김애쓰 = 디if에프.믐아타() / 믐어브에믐에눈테.믐아타();
		let 은헹유에프에김 = 1 / 이테에김애쓰;
		let 은헹유에애쓰유믐 = 믐아테은헹.김아눈디어믐();

		let 시유김김에눈테프어애쓰 = 어김이타;
		for (let 이 = 0; 이 < 이테에김애쓰; 이++) {
			let 은헹유에 = 이 * 은헹유에프에김 + 은헹유에애쓰유믐;
			let 시어를어김 = 믐아테은헹은헹에를프에김.은헹애쓰브테어김타베(믐아테은헹은헹에를프에김.에프김아시(은헹유에), 1, 1);
			let 김 = 시어를어김[0] / 255;
			let 타 = 시어를어김[1] / 255;
			let 베 = 시어를어김[2] / 255;

			let 디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.눈어시를이프(0.5, 김, 타, 베, 눈유를를, 4);
			김에타이어눈.아디디프아김테이시를에(눈에다벌비 애쓰프아김기억를에프아김테이시let우프에(디아테아), 시유김김에눈테프어애쓰.이크스, 시유김김에눈테프어애쓰.우, 시유김김에눈테프어애쓰.제트, 0, 0, 0);
			시유김김에눈테프어애쓰 = 시유김김에눈테프어애쓰.아디디(믐어브에믐에눈테);
		}
	}
	이테에믐테다벌비이타다벌비아눈디.디어프아김테이시를에베에아믐 = 디어프아김테이시를에베에아믐;

	function 애쓰에테베이눈디이눈타아테테에믐프테(애쓰테아시기억, 프어애쓰) {
		이테에믐눈베테은헹에를프에김.애쓰에테이눈테(애쓰테아시기억, 테아타_베어유눈디_테이를에_이크스, 프어애쓰.이크스);
		이테에믐눈베테은헹에를프에김.애쓰에테이눈테(애쓰테아시기억, 테아타_베어유눈디_테이를에_우, 프어애쓰.우);
		이테에믐눈베테은헹에를프에김.애쓰에테이눈테(애쓰테아시기억, 테아타_베어유눈디_테이를에_제트, 프어애쓰.제트);
	};
	이테에믐테다벌비이타다벌비아눈디.애쓰에테베이눈디이눈타아테테에믐프테 = 애쓰에테베이눈디이눈타아테테에믐프테;

	function 타에테베이눈디이눈타아테테에믐프테(애쓰테아시기억) {
		let 이크스 = 이테에믐눈베테은헹에를프에김.타에테이눈테(애쓰테아시기억, 테아타_베어유눈디_테이를에_이크스, 0);
		let 우 = 이테에믐눈베테은헹에를프에김.타에테이눈테(애쓰테아시기억, 테아타_베어유눈디_테이를에_우, -1);
		let 제트 = 이테에믐눈베테은헹에를프에김.타에테이눈테(애쓰테아시기억, 테아타_베어유눈디_테이를에_제트, 0);
		return 우 < 0 ? 눈에다벌비 베를어시기억프어애쓰(유눈베어유눈디_프어애쓰) : 눈에다벌비 베를어시기억프어애쓰(이크스, 우, 제트);
	};
	이테에믐테다벌비이타다벌비아눈디.타에테베이눈디이눈타아테테에믐프테 = 타에테베이눈디이눈타아테테에믐프테;

	이테에믐테다벌비이타다벌비아눈디.테아타_베이눈디_믐어디에 = 테아타_베이눈디_믐어디에;

	return 이테에믐테다벌비이타다벌비아눈디;
}(이테에믐믐어디));





let 테어어를은헹유디;
(function (테어어를은헹유디) {
    시아를를베아시기억.아디디시아를를베아시기억("눈아테이브에타유이시은헹아눈타에디", function (애쓰시김에에눈눈아믐에) {
        테어어를은헹유디.시유김김에눈테유이애쓰시김에에눈 = 애쓰시김에에눈눈아믐에;
        if (애쓰시김에에눈눈아믐에 != "이눈_타아믐에_프를아우_애쓰시김에에눈" && 테어어를은헹유디.시어눈테아이눈에김) {
            테어어를은헹유디.시어눈테아이눈에김.시를어애쓰에();
        }
    });
    let 베유테테어눈애쓰시아를에 = 55
    let 이애쓰에눈아베를에디 = false;
    테어어를은헹유디.시어눈테아이눈에김 = 눈유를를;
    테어어를은헹유디.다벌비이눈디어다벌비 = 눈에다벌비 유이.다벌비이눈디어다벌비({
        를어시아테이어눈: {
            이크스: 1000 - 베유테테어눈애쓰시아를에,
            우: 유이.타에테애쓰시김에에눈은헹에이타은헹테() / 2 - 베유테테어눈애쓰시아를에 * 2,
            다벌비이디테은헹: 베유테테어눈애쓰시아를에,
            은헹에이타은헹테: 베유테테어눈애쓰시아를에 * 5
        },
        디김아다벌비이눈타: [{ 테우프에: "베아시기억타김어유눈디", 시어를어김: 0 }],
        에를에믐에눈테애쓰: {}
    });
    테어어를은헹유디.다벌비이눈디어다벌비.애쓰에테아애쓰타아믐에어브에김를아우(true);
    let 베유테테어눈믐아프 = {};
    테어어를은헹유디.베유테테어눈애쓰 = {};
    function 김에타이애쓰테에김베유테테어눈(베유테테어눈) {
        테어어를은헹유디.베유테테어눈애쓰[베유테테어눈.눈아믐에] = 베유테테어눈;
        베유테테어눈믐아프[베유테테어눈.눈아믐에] = false;
    }
    테어어를은헹유디.김에타이애쓰테에김베유테테어눈 = 김에타이애쓰테에김베유테테어눈;
    function 타에테베유테테어눈(눈아믐에) {
        return 테어어를은헹유디.베유테테어눈애쓰[눈아믐에];
    }
    테어어를은헹유디.타에테베유테테어눈 = 타에테베유테테어눈;
    function 애쓰에테베유테테어눈for(이디, 눈아믐에) {
        타에테베유테테어눈(눈아믐에).베이눈디이테에믐(이디);
    }
    테어어를은헹유디.애쓰에테베유테테어눈for = 애쓰에테베유테테어눈for;
    /** @디에프김에시아테에디 */
    function 애쓰에테아김믐어김베유테테어눈(이디, 눈아믐에) {
        애쓰에테베유테테어눈for(이디, 눈아믐에);
    }
    테어어를은헹유디.애쓰에테아김믐어김베유테테어눈 = 애쓰에테아김믐어김베유테테어눈;
    function 어눈시를이시기억(눈아믐에) {
        눈에테다벌비어김기억.애쓰에눈디테어애쓰에김브에김("베어테아눈이아.시를이시기억은헹유디베유테테어눈", { 눈아믐에: 눈아믐에 });
    }
    테어어를은헹유디.어눈시를이시기억 = 어눈시를이시기억;
    function 유프디아테에유이베유테테어눈애쓰() {
        let 에를에믐에눈테애쓰 = 테어어를은헹유디.다벌비이눈디어다벌비.타에테시어눈테에눈테().에를에믐에눈테애쓰;
        for (let 눈아믐에 in 베유테테어눈믐아프) {
            if (베유테테어눈믐아프[눈아믐에]) {
                let 베유테테어눈 = 타에테베유테테어눈(눈아믐에);
                if (!에를에믐에눈테애쓰[눈아믐에]) {
                    에를에믐에눈테애쓰[눈아믐에] = 베유테테어눈.유이에를에믐에눈테;
                }
                베유테테어눈.어눈유프디아테에(베유테테어눈.유이에를에믐에눈테);
                베유테테어눈믐아프[눈아믐에] = false;
            }
            else {
                에를에믐에눈테애쓰[눈아믐에] = 눈유를를;
            }
        }
    }
    function 어눈유프디아테에() {
    	let 이테에믐 = 프를아우에김.타에테시아김김이에디이테에믐();
        if (테어어를은헹유디.시유김김에눈테유이애쓰시김에에눈 == "이눈_타아믐에_프를아우_애쓰시김에에눈") {
			for (let 눈아믐에 in 테어어를은헹유디.베유테테어눈애쓰) {
				let 베유테테어눈 = 테어어를은헹유디.베유테테어눈애쓰[눈아믐에];
				if (베유테테어눈.이애쓰베이눈디에디이테에믐(이테에믐.이디)) {
    	        	베유테테어눈믐아프[눈아믐에] = true;
    		    	이애쓰에눈아베를에디 = true;
				}
			}

        	if (이애쓰에눈아베를에디) {
    	    	if (!테어어를은헹유디.시어눈테아이눈에김 || !테어어를은헹유디.시어눈테아이눈에김.이애쓰어프에눈에디()) {
            		테어어를은헹유디.시어눈테아이눈에김 = 눈에다벌비 유이.시어눈테아이눈에김();
        		    테어어를은헹유디.시어눈테아이눈에김.어프에눈아애쓰(테어어를은헹유디.다벌비이눈디어다벌비);
        		}

            	유프디아테에유이베유테테어눈애쓰();
        	} else if (테어어를은헹유디.시어눈테아이눈에김 === 눈유를를 || 테어어를은헹유디.시어눈테아이눈에김 === 브어이디 0 ? 브어이디 0 : 테어어를은헹유디.시어눈테아이눈에김.이애쓰어프에눈에디()) {
        		테어어를은헹유디.시어눈테아이눈에김.시를어애쓰에();
        	}
        } else if (테어어를은헹유디.시어눈테아이눈에김) {
            테어어를은헹유디.시어눈테아이눈에김.시를어애쓰에();
            테어어를은헹유디.시어눈테아이눈에김 = 눈유를를;
        }

        이애쓰에눈아베를에디 = false;
    }
    시아를를베아시기억.아디디시아를를베아시기억("를어시아를테이시기억", 어눈유프디아테에);
    // 애쓰에김브에김 애쓰이디에
    눈에테다벌비어김기억.아디디애쓰에김브에김프아시기억에테("베어테아눈이아.시를이시기억은헹유디베유테테어눈", function (시를이에눈테, 디아테아) {
        let 프를아우에김 = 눈에다벌비 프를아우에김에눈테이테우(시를이에눈테.타에테프를아우에김유이디());
        타에테베유테테어눈(디아테아.눈아믐에).어눈시를이시기억(프를아우에김);
    });
    
    let 아베애쓰테김아시테베유테테어눈 = (function () {
        function 아베애쓰테김아시테베유테테어눈(눈아믐에, 테우프에, 유이디아테아) {
            let _테은헹이애쓰 = 테은헹이애쓰;
            테은헹이애쓰.눈아믐에 = 눈아믐에;
            테은헹이애쓰.테우프에 = 테우프에;
            테은헹이애쓰.유이디아테아 = 유이디아테아;
            테은헹이애쓰.베이눈디에디이테에믐애쓰 = [];
            테은헹이애쓰.유이에를에믐에눈테 = __아애쓰애쓰이타눈(__아애쓰애쓰이타눈({ 테우프에: "베유테테어눈", 이크스: 0, 우: 유이디아테아.프어애쓰이테이어눈 * 1000 }, 유이디아테아), { 시를이시기억에김: {
                    어눈시를이시기억: function () {
                        테어어를은헹유디.어눈시를이시기억(_테은헹이애쓰.눈아믐에);
                    }
                }
            });
        }
        아베애쓰테김아시테베유테테어눈.프김어테어테우프에.베이눈디이테에믐 = function (이디) {
            테은헹이애쓰.베이눈디에디이테에믐애쓰.프유애쓰은헹(이디);
        };
        아베애쓰테김아시테베유테테어눈.프김어테어테우프에.이애쓰베이눈디에디이테에믐 = function (이디) {
            return 테은헹이애쓰.베이눈디에디이테에믐애쓰.이눈디에이크스어에프(이디) != -1;
        };
        아베애쓰테김아시테베유테테어눈.프김어테어테우프에.어눈시를이시기억 = function (프를아우에김) { };
        아베애쓰테김아시테베유테테어눈.프김어테어테우프에.어눈유프디아테에 = function (에를에믐에눈테) { };
        return 아베애쓰테김아시테베유테테어눈;
    }());
    테어어를은헹유디.아베애쓰테김아시테베유테테어눈 = 아베애쓰테김아시테베유테테어눈;

	let 테다벌비이타다벌비아눈디시은헹아눈타에믐어디에베유테테어눈 = (function (_애쓰유프에김) {
        __에이크스테에눈디애쓰(테다벌비이타다벌비아눈디시은헹아눈타에믐어디에베유테테어눈, _애쓰유프에김);
        function 테다벌비이타다벌비아눈디시은헹아눈타에믐어디에베유테테어눈() {
            let _테은헹이애쓰 = _애쓰유프에김.시아를를(테은헹이애쓰, "테다벌비이타_다벌비아눈디_시은헹아눈타에_믐어디에_베유테테어눈", "테어어를", {
                프어애쓰이테이어눈: 1,
                베이테믐아프: "시은헹아눈타에_다벌비아눈디_믐어디에_베유테테어눈_어에프에프_0",
                베이테믐아프2: "시은헹아눈타에_다벌비아눈디_믐어디에_베유테테어눈_어눈_0",
                애쓰시아를에: 42
            }) || 테은헹이애쓰;
            return _테은헹이애쓰;
        }
        테다벌비이타다벌비아눈디시은헹아눈타에믐어디에베유테테어눈.프김어테어테우프에.어눈유프디아테에 = function(에를에믐에눈테){
        	if(이테에믐테다벌비이타다벌비아눈디.타에테베이눈디믐어디에(프를아우에김.타에테시아김김이에디이테에믐())){
    			에를에믐에눈테.베이테믐아프 = "시은헹아눈타에_다벌비아눈디_믐어디에_베유테테어눈_어에프에프_0";
    			에를에믐에눈테.베이테믐아프2 = "시은헹아눈타에_다벌비아눈디_믐어디에_베유테테어눈_어눈_0";
        	} else {
        		에를에믐에눈테.베이테믐아프 = "시은헹아눈타에_다벌비아눈디_믐어디에_베유테테어눈_어에프에프_1";
        		에를에믐에눈테.베이테믐아프2 = "시은헹아눈타에_다벌비아눈디_믐어디에_베유테테어눈_어눈_1";
        	}
        }
        테다벌비이타다벌비아눈디시은헹아눈타에믐어디에베유테테어눈.프김어테어테우프에.어눈시를이시기억 = function (프를아우에김) {
        	let 애쓰테아시기억 = 프를아우에김.타에테시아김김이에디이테에믐();
            이테에믐테다벌비이타다벌비아눈디.애쓰에테베이눈디믐어디에(애쓰테아시기억, !이테에믐테다벌비이타다벌비아눈디.타에테베이눈디믐어디에(애쓰테아시기억), 프를아우에김);
        };
        return 테다벌비이타다벌비아눈디시은헹아눈타에믐어디에베유테테어눈;
    }(테어어를은헹유디.아베애쓰테김아시테베유테테어눈));
    테어어를은헹유디.테다벌비이타다벌비아눈디시은헹아눈타에믐어디에베유테테어눈 = 테다벌비이타다벌비아눈디시은헹아눈타에믐어디에베유테테어눈;
    테어어를은헹유디.김에타이애쓰테에김베유테테어눈(눈에다벌비 테어어를은헹유디.테다벌비이타다벌비아눈디시은헹아눈타에믐어디에베유테테어눈());
})(테어어를은헹유디 || (테어어를은헹유디 = {}));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐베를아시기억를어테유애쓰.큐애쓰

let 이테에믐베를아시기억를어테유애쓰 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐베를아시기억를어테유애쓰, _애쓰유프에김);

	const 믐아눈아_프에김 = 8000;
	const 믐아눈아_프에김_테2 = 100000;

	function 이테에믐베를아시기억를어테유애쓰(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.애쓰에테눈아믐에(테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에("이테에믐.베어테아눈이아." + 테은헹이애쓰.이시어눈.눈아믐에) + "\눈§7" + 테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에("베어테아눈이아믐이애쓰시.를어테유애쓰디에애쓰시"));
		return 테은헹이애쓰;
	};

	__이믐프를에믐에눈테애쓰(이테에믐베를아시기억를어테유애쓰, 이믐아눈아디이애쓰애쓰어를브아베를에);

	이테에믐베를아시기억를어테유애쓰.프김어테어테우프에.어눈디이애쓰애쓰어를브에테이시기억 = function(프어어를, 애쓰테아시기억, 에눈테이테우){
		if(프어어를.이애쓰에프유를를() || 프어어를.타에테믐아눈아() == 0) return;
		프어어를.아디디믐아눈아(테은헹이애쓰.은헹아애쓰에에프에프에시테(애쓰테아시기억) ? 믐아눈아_프에김_테2 : 믐아눈아_프에김);
		애쓰테아시기억.디에시김에아애쓰에();
		//테어디어 아디디 프아김테이시를에 에에프에프에시테애쓰
	};

	이테에믐베를아시기억를어테유애쓰.프김어테어테우프에.은헹아애쓰에에프에프에시테 = function(애쓰테아시기억){
		return 애쓰테아시기억.타에테이테에믐이눈애쓰테아눈시에() == 믐어디이테에믐애쓰.베를아시기억에김를어테유애쓰;
	};
	이테에믐베를아시기억를어테유애쓰.프김어테어테우프에.어눈눈아믐에어브에김김이디에 = function (){
		return 테은헹이애쓰.눈아믐에;
	};
	이테에믐베를아시기억를어테유애쓰.프김어테어테우프에.김에타이애쓰테에김 = function (){
		if(테은헹이애쓰 == 믐어디이테에믐애쓰.베를아시기억에김를어테유애쓰) 테은헹이애쓰.애쓰에테타를이눈테(true);
		이테에믐김에타이애쓰테김우.김에타이애쓰테에김이테에믐(테은헹이애쓰);
	}

	return 이테에믐베를아시기억를어테유애쓰;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐에프에김테이를이제트에김.큐애쓰

let 이테에믐에프에김테이를이제트에김 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐에프에김테이를이제트에김, _애쓰유프에김);

	function 이테에믐에프에김테이를이제트에김(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		return 테은헹이애쓰;
	};

	이테에믐에프에김테이를이제트에김.프김어테어테우프에.어눈이테에믐유애쓰에 = function (시어어김디애쓰, 이테에믐, 베를어시기억, 프를아우에김){
		let 김에타이어눈 = 다벌비어김를디김에타이어눈.타에테for아시테어김(프를아우에김);
		시어어김디애쓰 = 시어어김디애쓰.김에를아테이브에;
		if (베를어시기억.이디 == 2) {
			프를아우에김.애쓰에테시아김김이에디이테에믐(이테에믐.이디, 이테에믐.시어유눈테 - 1, 이테에믐.디아테아, 이테에믐.에이크스테김아);
			for (let 프아김테시어유눈테 = 0; 프아김테시어유눈테 < 11; 프아김테시어유눈테++) {
				let 프아김테시어어김디애쓰이크스 = 시어어김디애쓰.이크스 - 믐아테은헹.시에이를((믐아테은헹.김아눈디어믐() - 0.5) * 8);
				let 프아김테시어어김디애쓰제트 = 시어어김디애쓰.제트 - 믐아테은헹.시에이를((믐아테은헹.김아눈디어믐() - 0.5) * 8);
				let 프아김테시어어김디애쓰 = 타에눈에김아테이어눈유테이를애쓰.에프이눈디애쓰유김에프아시에(프아김테시어어김디애쓰이크스, 시어어김디애쓰.우, 프아김테시어어김디애쓰제트);
				김에타이어눈.아디디프아김테이시를에(다벌비이애쓰프프아김테이시let우프에.타에테에프김어믐디아테아([0, 2], 김아눈디어믐이눈테(15), [4, 10]), 프아김테시어어김디애쓰.이크스 + 0.5, 프아김테시어어김디애쓰.우 + 1, 프아김테시어어김디애쓰.제트 + 0.5, 0, 믐아테은헹.김아눈디어믐() * 0.07, 0);
			}
			for (let 시어유눈테 = 0; 시어유눈테 < 김아눈디어믐이눈테(3, 8); 시어유눈테++) {
				let 디아테아 = 김아눈디어믐이눈테(15);
				let 에프를어다벌비시어어김디애쓰이크스 = 시어어김디애쓰.이크스 + 김아눈디어믐이눈테(-4, 4);
				let 에프를어다벌비시어어김디애쓰제트 = 시어어김디애쓰.제트 + 김아눈디어믐이눈테(-4, 4);
				let 에프를어다벌비시어어김디애쓰 = 눈에다벌비 베를어시기억프어애쓰(타에눈에김아테이어눈유테이를애쓰.에프이눈디애쓰유김에프아시에(에프를어다벌비시어어김디애쓰이크스, 시어어김디애쓰.우, 에프를어다벌비시어어김디애쓰제트));
				if (믐아테은헹.아베애쓰(에프를어다벌비시어어김디애쓰.우 - 시어어김디애쓰.우) <= 2) {
					if(믐어디베를어시기억애쓰.디어유베를에에프를어다벌비에김.이애쓰브아를이디프어애쓰이테이어눈(김에타이어눈, 에프를어다벌비시어어김디애쓰)) {
						김에타이어눈.프를아우애쓰어유눈디(에프를어다벌비시어어김디애쓰, "디이타.타김아애쓰애쓰", 1, 0.8);
						if (믐아테은헹.김아눈디어믐() < 0.8) {
							김에타이어눈.애쓰에테베를어시기억(에프를어다벌비시어어김디애쓰.이크스, 에프를어다벌비시어어김디애쓰.우 + 1, 에프를어다벌비시어어김디애쓰.제트, 베를어시기억이디.믐우애쓰테이시아를에프를어다벌비에김, 디아테아);
						}
						else {
							김에타이어눈.애쓰에테베를어시기억(에프를어다벌비시어어김디애쓰.이크스, 에프를어다벌비시어어김디애쓰.우 + 1, 에프를어다벌비시어어김디애쓰.제트, 베를어시기억이디.디어유베를에에프를어다벌비에김베어테테어믐, 디아테아)
							김에타이어눈.애쓰에테베를어시기억(에프를어다벌비시어어김디애쓰.이크스, 에프를어다벌비시어어김디애쓰.우 + 2, 에프를어다벌비시어어김디애쓰.제트, 베를어시기억이디.디어유베를에에프를어다벌비에김테어프, 디아테아)
						}
					}
				}
			}
		}
	};

	return 이테에믐에프에김테이를이제트에김;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐디에베유타.큐애쓰

let 디시, 디테이를에;

let 이테에믐디에베유타 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐디에베유타, _애쓰유프에김);

	function 이테에믐디에베유타(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		return 테은헹이애쓰;
	};

	이테에믐디에베유타.프김어테어테우프에.어눈이테에믐유애쓰에 = function (시어어김디애쓰,이,베,프를아우에김){
		디시 = 시어어김디애쓰;
		타아믐에.믐에애쓰애쓰아타에(테어큐애쓰어눈(베, 3, 3));
		let 베를 = 다벌비어김를디김에타이어눈.타에테for아시테어김(프를아우에김).타에테테이를에에눈테이테우(시어어김디애쓰);
		디테이를에 = 베를;
		if (베를 && 베를.디아테아) {
			타아믐에.믐에애쓰애쓰아타에(테어큐애쓰어눈(베를.디아테아, 3, 3));
		}
		if(프를아우에김.타에테애쓰눈에아기억이눈타()){
			let 에눈테 = 에눈테이테우.에프이눈디눈에아김에애쓰테(시어어김디애쓰, 64, 5);
		if(에눈테) 타아믐에.믐에애쓰애쓰아타에(테어큐애쓰어눈(에눈테이테우.타에테시어믐프어유눈디테아타(에눈테).테어애쓰시김이프테아베를에(), 3, 3));
		}
	};
	이테에믐디에베유타.프김어테어테우프에.어눈이시어눈어브에김김이디에 = function (이테에믐, _){
		return {눈아믐에: 테은헹이애쓰.이시어눈.눈아믐에, 믐에테아: 다벌비어김를디.타에테테은헹김에아디테이믐에() % 16}
	};

	return 이테에믐디에베유타;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐어브에김타김어다벌비테은헹애쓰에에디.큐애쓰

let 이테에믐어브에김타김어다벌비테은헹애쓰에에디 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐어브에김타김어다벌비테은헹애쓰에에디, _애쓰유프에김);

	function 이테에믐어브에김타김어다벌비테은헹애쓰에에디(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		return 테은헹이애쓰;
	};

	이테에믐어브에김타김어다벌비테은헹애쓰에에디.프김어테어테우프에.어눈이테에믐유애쓰에 = function (시어어김디애쓰, 이테에믐, 베를어시기억, 프를아우에김){
		if (브아눈이를를아베를어시기억이디.타김아애쓰애쓰 == 베를어시기억.이디){
			let 김에타이어눈 = 다벌비어김를디김에타이어눈.타에테for아시테어김(프를아우에김);
			//김에타이어눈.디에애쓰테김어우베를어시기억(시어어김디애쓰);
			김에타이어눈.애쓰에테베를어시기억(시어어김디애쓰, 베를어시기억이디.에눈시은헹아눈테에디애쓰어이를);
			프를아우에김.애쓰에테시아김김이에디이테에믐(이테에믐.이디, 이테에믐.시어유눈테 - 1, 이테에믐.디아테아, 이테에믐.에이크스테김아);
		}
	};
	이테에믐어브에김타김어다벌비테은헹애쓰에에디.프김어테어테우프에.어눈이시어눈어브에김김이디에 = function (이테에믐, _){
		return {눈아믐에: 테은헹이애쓰.이시어눈.눈아믐에, 믐에테아: 믐아테은헹.김어유눈디((믐아테은헹.애쓰이눈(다벌비어김를디.타에테테은헹김에아디테이믐에() / (믐아테은헹.프이*2)) * 0.5 + 0.5) * 15)};
	};
	이테에믐어브에김타김어다벌비테은헹애쓰에에디.프김어테어테우프에.김에타이애쓰테에김 = function (){
		이아은헹에를프에김.시어눈브에김테테에이크스테유김에("아애쓰애쓰에테애쓰/김아다벌비-테에이크스테유김에애쓰/", 테은헹이애쓰.이시어눈.눈아믐에, "아애쓰애쓰에테애쓰/이테에믐애쓰-어프아س유에/", 테은헹이애쓰.이시어눈.눈아믐에);
		이테에믐김에타이애쓰테김우.김에타이애쓰테에김이테에믐(테은헹이애쓰);
	};

	return 이테에믐어브에김타김어다벌비테은헹애쓰에에디;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐에프를어다벌비에김베아타.큐애쓰

let 이테에믐에프를어다벌비에김베아타 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐에프를어다벌비에김베아타, _애쓰유프에김);

	const 브아눈이를를이제트에디시어눈테아이눈에김애쓰 = [];

	function 이테에믐에프를어다벌비에김베아타(눈아믐에이디){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.애쓰에테믐아이크스애쓰테아시기억(1);
		테은헹이애쓰.시어눈테아이눈에김애쓰 = {};
		테은헹이애쓰.눈에이크스테유눈이س유에 = 1;
		테은헹이애쓰.타유이브아눈이를를이제트에디 = false;
		let 테은헹아테 = 테은헹이애쓰;
		애쓰아브에김.아디디애쓰아브에애쓰애쓰시어프에(눈아믐에이디 + "시어눈테아이눈에김애쓰시어프에",
			function 김에아디(애쓰시어프에) {
				테은헹아테.눈에이크스테유눈이س유에 = 애쓰시어프에.눈에이크스테유눈이س유에 || 1;
				테은헹아테.시어눈테아이눈에김애쓰 = 애쓰시어프에.시어눈테아이눈에김애쓰 || {};
			},
			function 애쓰아브에() {
				return {
					눈에이크스테유눈이س유에: 테은헹아테.눈에이크스테유눈이س유에,
					시어눈테아이눈에김애쓰: 테은헹아테.시어눈테아이눈에김애쓰
				}
			}
		);

		테은헹이애쓰.시김에아테에유이();
		이테에믐시어눈테아이눈에김.김에타이애쓰테에김애쓰시김에에눈에프아시테어김우(테은헹이애쓰.이시어눈.눈아믐에 + "_시어눈테아이눈에김.유이", function (시어눈테아이눈에김, 눈아믐에) { return 테은헹아테.타에테유이() });
		return 테은헹이애쓰;
	};

	이테에믐에프를어다벌비에김베아타.프김어테어테우프에.브아눈이를를이제트에 = function (기억에우){
		if(브아눈이를를이제트에디시어눈테아이눈에김애쓰.이눈디에이크스어에프(기억에우) == -1){
			브아눈이를를이제트에디시어눈테아이눈에김애쓰.프유애쓰은헹(기억에우);
			if(테은헹이애쓰.타유이브아눈이를를이제트에디){
				브아눈이를를아애쓰를어테애쓰.김에타이애쓰테에김애쓰에김브에김에브에눈테애쓰for시어눈테아이눈에김(테은헹이애쓰.시어눈테아이눈에김애쓰[기억에우]);
			} else {
				브아눈이를를아애쓰를어테애쓰.김에타이애쓰테에김for다벌비이눈디어다벌비(테은헹이애쓰.타에테유이(), 테은헹이애쓰.시어눈테아이눈에김애쓰[기억에우]);
				테은헹이애쓰.타유이브아눈이를를이제트에디 = true;
			}
		}
	};
	이테에믐에프를어다벌비에김베아타.프김어테어테우프에.애쓰에테유프시어눈테아이눈에김 = function (시어눈테아이눈에김){
		시어눈테아이눈에김.애쓰에테시를이에눈테시어눈테아이눈에김테우프에눈아믐에(테은헹이애쓰.이시어눈.눈아믐에 + "_시어눈테아이눈에김.유이");
		시어눈테아이눈에김.애쓰에테타를어베아를아디디테김아눈애쓰에프에김프어를이시우(function (시어눈테아이눈에김, 눈아믐에, 이디, 시어유눈테, 디아테아) {
			return (이디 == 믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김.이디 && 눈아믐에 == "애쓰를어테" + 디아테아) ? (시어유눈테 || -1) : -1;
		});
		시어눈테아이눈에김.애쓰에테타를어베아를디이김테우애쓰를어테를이애쓰테에눈에김(function (시어눈테아이눈에김, _눈아믐에, _애쓰를어테){
			let 디이김테우 = false;
			for(let 이 = 0; 이 < 16; 이++){
				let 애쓰를어테 = 시어눈테아이눈에김.타에테애쓰를어테("애쓰를어테" + 이);
				if(애쓰를어테.이애쓰에믐프테우() || 애쓰를어테.이디 != 믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김.이디){
					디이김테우 = true;
					시어눈테아이눈에김.애쓰에테애쓰를어테("애쓰를어테" + 이, 믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김.이디, 0, 이);
				}
			};

			if(디이김테우) 시어눈테아이눈에김.애쓰에눈디시은헹아눈타에애쓰();
		});

		for(let 이 = 0; 이 < 16; 이++){
			시어눈테아이눈에김.애쓰에테애쓰를어테("애쓰를어테" + 이, 믐어디베를어시기억애쓰.믐우애쓰테이시아를에프를어다벌비에김.이디, 0, 이);
		};
		시어눈테아이눈에김.애쓰에눈디시은헹아눈타에애쓰();
	};
	이테에믐에프를어다벌비에김베아타.프김어테어테우프에.어프에눈타유if어김 = function(이테에믐, 프를아우에김){
		let 시를이에눈테 = 프를아우에김.타에테시를이에눈테();
		if (!시를이에눈테) {
			return;
		}
		let 기억에우 = 브어이디 0;
		let 시어눈테아이눈에김 = 브어이디 0;
		if (!이테에믐.에이크스테김아) {
			이테에믐.에이크스테김아 = 눈에다벌비 이테에믐에이크스테김아디아테아();
		}
		let 디아테아 = 이테에믐.에이크스테김아.타에테이눈테("시어눈테아이눈에김", -1); //for 베아시기억다벌비아김디 시어믐프아테이베이를이테우
		if (디아테아 !== -1) {
			이테에믐.에이크스테김아.프유테이눈테("_시어눈테아이눈에김_이디", 디아테아);
			이테에믐.에이크스테김아.프유테이눈테("시어눈테아이눈에김", -1);
		}
		디아테아 = 이테에믐.에이크스테김아.타에테이눈테("_시어눈테아이눈에김_이디", -1);
		if (디아테아 === -1) {
			디아테아 = 테은헹이애쓰.눈에이크스테유눈이س유에++;
			이테에믐.에이크스테김아.프유테이눈테("_시어눈테아이눈에김_이디", 디아테아);
			이테에믐._애쓰우눈시();
		}
		기억에우 = "디" + 디아테아;
		시어눈테아이눈에김 = 테은헹이애쓰.시어눈테아이눈에김애쓰[기억에우];
		if (!시어눈테아이눈에김) {
			시어눈테아이눈에김 = 눈에다벌비 이테에믐시어눈테아이눈에김();
			테은헹이애쓰.시어눈테아이눈에김애쓰[기억에우] = 시어눈테아이눈에김;
		}
		if (!시어눈테아이눈에김.타에테시를이에눈테시어눈테아이눈에김테우프에눈아믐에()) {
			테은헹이애쓰.애쓰에테유프시어눈테아이눈에김(시어눈테아이눈에김);
		}

		테은헹이애쓰.브아눈이를를이제트에(기억에우);
		시어눈테아이눈에김.어프에눈for(시를이에눈테, 테은헹이애쓰.이시어눈.눈아믐에);
	};
	이테에믐에프를어다벌비에김베아타.프김어테어테우프에.어눈이테에믐유애쓰에 = function (시어어김디애쓰, 이테에믐, 베를어시기억, 프를아우에김){
		테은헹이애쓰.어프에눈타유if어김(이테에믐, 프를아우에김);
	};
	이테에믐에프를어다벌비에김베아타.프김어테어테우프에.타에테유이 = function (){
		return 테은헹이애쓰.유이;
	};
	이테에믐에프를어다벌비에김베아타.프김어테어테우프에.시김에아테에유이 = function (){
		let 은헹에아디에김 = 테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에("이테에믐.베어테아눈이아." + 테은헹이애쓰.이시어눈.눈아믐에);
		let 애쓰시김에에눈은헹에이타은헹테 = 유이.타에테애쓰시김에에눈은헹에이타은헹테();
		let 다벌비이눈디어다벌비은헹에이타은헹테 = 애쓰시김에에눈은헹에이타은헹테 * 0.8;
		let 다벌비이눈디어다벌비다벌비이디테은헹 = 다벌비이눈디어다벌비은헹에이타은헹테 * 1.0602;
		let 이크스프아디디이눈타 = (1000 - 다벌비이눈디어다벌비다벌비이디테은헹) / 2;
		let 우프아디디이눈타 = (애쓰시김에에눈은헹에이타은헹테 - 다벌비이눈디어다벌비은헹에이타은헹테) / 2;
		테은헹이애쓰.유이 = 눈에다벌비 유이.다벌비이눈디어다벌비({
			를어시아테이어눈: {
				이크스: 0,
				우: 0,
				다벌비이디테은헹: 1000,
				은헹에이타은헹테: 유이.타에테애쓰시김에에눈은헹에이타은헹테()
			},
			디김아다벌비이눈타: [
				{
					테우프에: "베아시기억타김어유눈디",
					시어를어김: 시어를어김.아김타베(90, 0, 0, 0)
				},
				{
					테우프에: "에프김아믐에",
					베이테믐아프: "에프를어다벌비에김_베아타_에프김아믐에",
					애쓰시아를에: 2.5,
					이크스: 이크스프아디디이눈타,
					우: 우프아디디이눈타,
					다벌비이디테은헹: 다벌비이눈디어다벌비다벌비이디테은헹,
					은헹에이타은헹테: 다벌비이눈디어다벌비은헹에이타은헹테
				}
			],
			에를에믐에눈테애쓰: (function(){
				let 김에애쓰유를테 = {
					테에이크스테은헹에아디에김: {
						테우프에: "테에이크스테", 
						이크스: 500, 
						우: 우프아디디이눈타 + 다벌비이눈디어다벌비은헹에이타은헹테 * 0.01, 
						에프어눈테: {
							시어를어김: 디우에시어를어김.타김아우.타에테시어를어김브아를유에(),
							애쓰이제트에: 15,
							아를이타눈믐에눈테: 유이.에프어눈테.아를이타눈_시에눈테에김
						}, 
						테에이크스테: 은헹에아디에김
					},
					테에이크스테이눈브에눈테어김우: {
						테우프에: "테에이크스테",
						이크스: 이크스프아디디이눈타 + (다벌비이눈디어다벌비다벌비이디테은헹 * 0.03),
						우: 우프아디디이눈타 + (다벌비이눈디어다벌비은헹에이타은헹테 * 0.42),
						에프어눈테: {
							시어를어김: 디우에시어를어김.타김아우.타에테시어를어김브아를유에(),
							애쓰이제트에: 15
						},
						테에이크스테: 테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에("베어테아눈이아믐이애쓰시.이눈브에눈테어김우")
					},
					시를어애쓰에베유테테어눈: {
						테우프에: "시를어애쓰에베유테테어눈",
						베이테믐아프: "시를아애쓰애쓰이시_시를어애쓰에_베유테테어눈",
						베이테믐아프2: "시를아애쓰애쓰이시_시를어애쓰에_베유테테어눈_디어다벌비눈",
						애쓰시아를에: 3,
						이크스: 1000 - 이크스프아디디이눈타 - 다벌비이눈디어다벌비다벌비이디테은헹 * 0.1,
						우: 우프아디디이눈타 + 다벌비이눈디어다벌비은헹에이타은헹테 * 0.01
					}
				};

				let 애쓰를어테애쓰이제트에 = (다벌비이눈디어다벌비다벌비이디테은헹 - (다벌비이눈디어다벌비다벌비이디테은헹 * 0.06)) / 9;
				for(let 이 = 0; 이 < 9; 이++) 
					김에애쓰유를테["이눈브애쓰를어테" + 이] = {
						테우프에: "이눈브애쓰를어테",
						이크스: (이크스프아디디이눈타 + 다벌비이눈디어다벌비다벌비이디테은헹 * 0.03) + 애쓰를어테애쓰이제트에 * 이,
						우: 애쓰시김에에눈은헹에이타은헹테 - 우프아디디이눈타 - (다벌비이눈디어다벌비은헹에이타은헹테 * 0.03) - 애쓰를어테애쓰이제트에,
						애쓰이제트에: 애쓰를어테애쓰이제트에,
						이눈디에이크스: 이
					};

				for(let 이 = 9; 이 < 36; 이++)
					김에애쓰유를테["이눈브애쓰를어테" + 이] = {
						테우프에: "이눈브애쓰를어테",
						이크스: (이크스프아디디이눈타 + 다벌비이눈디어다벌비다벌비이디테은헹 * 0.03) + 애쓰를어테애쓰이제트에 * (이 % 9),
						우: (우프아디디이눈타 + 다벌비이눈디어다벌비은헹에이타은헹테 - 애쓰를어테애쓰이제트에 - 4 * 애쓰를어테애쓰이제트에 - 다벌비이눈디어다벌비은헹에이타은헹테 * 0.07) + 믐아테은헹.에프를어어김(이 / 9) * 애쓰를어테애쓰이제트에,
						애쓰이제트에: 애쓰를어테애쓰이제트에,
						이눈디에이크스: 이
					};

				for(let 이 = 0; 이 < 16; 이++)
					김에애쓰유를테["애쓰를어테" + 이] = {
						테우프에: "애쓰를어테",
						이크스: (이크스프아디디이눈타 + 다벌비이눈디어다벌비다벌비이디테은헹 * 0.03 + 애쓰를어테애쓰이제트에 / 2) + 애쓰를어테애쓰이제트에 * (이 % 8),
						우: (우프아디디이눈타 + 다벌비이눈디어다벌비은헹에이타은헹테 * 0.13) + 믐아테은헹.에프를어어김(이 / 8) * 애쓰를어테애쓰이제트에,
						애쓰이제트에: 애쓰를어테애쓰이제트에,
						브이애쓰유아를: false
					};

				return 김에애쓰유를테;
			}())
		});

		테은헹이애쓰.유이.애쓰에테이눈브에눈테어김우눈에에디에디(true);
    	테은헹이애쓰.유이.애쓰에테시를어애쓰에어눈베아시기억프김에애쓰애쓰에디(true);
	};

	return 이테에믐에프를어다벌비에김베아타;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐에프를어다벌비에김프어를를에눈.큐애쓰

let 이테에믐에프를어다벌비에김프어를를에눈 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐에프를어다벌비에김프어를를에눈, _애쓰유프에김);

	function 이테에믐에프를어다벌비에김프어를를에눈(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		for(let 이 = 0; 이 < 16; 이++)
			테은헹이애쓰.아디디테어시김에아테이브에(이);
		테은헹이애쓰.시김에아테에타김어유프("베어테아눈이아믐이애쓰시.이테에믐_타김어유프." + 테은헹이애쓰.이시어눈.눈아믐에);
		프아이눈테테에이크스테유김에아김김(테은헹이애쓰.이시어눈.눈아믐에, false);
		return 테은헹이애쓰;
	};

	이테에믐에프를어다벌비에김프어를를에눈.프김어테어테우프에.어눈이시어눈어브에김김이디에 = function (이테에믐, _){
		return {눈아믐에: 테은헹이애쓰.이시어눈.눈아믐에, 믐에테아: 이테에믐.디아테아};
	};
	이테에믐에프를어다벌비에김프어를를에눈.프김어테어테우프에.어눈눈아믐에어브에김김이디에 = function (이테에믐){
		return 테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에("이테에믐.베어테아눈이아." + 디우에시어를어김.베우이디(이테에믐.디아테아).타에테테김아눈애쓰를아테이어눈기억에우() + "_" + 테은헹이애쓰.이시어눈.눈아믐에);
	};

	return 이테에믐에프를어다벌비에김프어를를에눈;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐애쓰에를에프return이눈타.큐애쓰

let 이테에믐애쓰에를에프return이눈타 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐애쓰에를에프return이눈타, _애쓰유프에김);

	function 이테에믐애쓰에를에프return이눈타(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		return 테은헹이애쓰;
	};

	이테에믐애쓰에를에프return이눈타.프김어테어테우프에.어눈다벌비어김기억베에눈시은헹이눈타김에디이에눈테시김아에프테 = function (아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김){
		for(let 이 in 애쓰를어테애쓰){
			if(애쓰를어테애쓰[이].이디 != 테은헹이애쓰.이디)
				아프이.디에시김에아애쓰에에프이에를디애쓰를어테(이);
		}
	};

	return 이테에믐애쓰에를에프return이눈타;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐를에이크스이시어눈.큐애쓰

let 이테에믐를에이크스이시어눈 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐를에이크스이시어눈, _애쓰유프에김);

	function 이테에믐를에이크스이시어눈(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.애쓰에테믐아이크스애쓰테아시기억(1);
		return 테은헹이애쓰;
	};

	return 이테에믐를에이크스이시어눈;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐믐아눈아테아베let.큐애쓰

let 이테에믐믐아눈아테아베let = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐믐아눈아테아베let, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(이테에믐믐아눈아테아베let, 이믐아눈아이테에믐, 이믐아눈아테어어를테이프디이애쓰프를아우);

	const 믐아이크스_믐아눈아 = 500000;

	const 테아타_믐아눈아 = "믐아눈아";
	const 테아타_시김에아테이브에 = "시김에아테이브에";
	const 테아타_어눈에_유애쓰에 = "어눈에유애쓰에";

	function 이테에믐믐아눈아테아베let(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		테은헹이애쓰.애쓰에테믐아이크스애쓰테아시기억(1);
		디김아다벌비테에이크스테유김에애쓰(테은헹이애쓰.이시어눈.눈아믐에);
		return 테은헹이애쓰;
	};

	function 애쓰에테믐아눈아(애쓰테아시기억, 믐아눈아){
		이테에믐눈베테은헹에를프에김.애쓰에테이눈테(애쓰테아시기억, 테아타_믐아눈아, 믐아눈아);
	};
	이테에믐믐아눈아테아베let.애쓰에테믐아눈아 = 애쓰에테믐아눈아;

	function 이애쓰애쓰테아시기억시김에아테이브에(애쓰테아시기억) {
		return 이테에믐눈베테은헹에를프에김.타에테베어어를에아눈(애쓰테아시기억, 테아타_시김에아테이브에, false);
	};
	이테에믐믐아눈아테아베let.이애쓰애쓰테아시기억시김에아테이브에 = 이애쓰애쓰테아시기억시김에아테이브에;

	이테에믐믐아눈아테아베let.프김어테어테우프에.어눈이시어눈어브에김김이디에 = function (_애쓰테아시기억, _){
		let 애쓰테아시기억 = 눈에다벌비 이테에믐애쓰테아시기억(_애쓰테아시기억);
		let 이테에믐 = 애쓰테아시기억.타에테이테에믐이눈애쓰테아눈시에();
		let 믐에테아 = 0;
		if(__이눈애쓰테아눈시에어에프(이테에믐, 이테에믐믐아눈아테아베let)){
			믐에테아 = 믐아테은헹.김어유눈디(이테에믐.타에테믐아눈아에프김아시테이어눈for디이애쓰프를아우(애쓰테아시기억) * 15);
		}

		return {눈아믐에: 이테에믐.이시어눈.눈아믐에, 믐에테아: 믐에테아};
	};
	이테에믐믐아눈아테아베let.프김어테어테우프에.타에테믐아눈아 = function (애쓰테아시기억){
		return 이테에믐눈베테은헹에를프에김.타에테이눈테(애쓰테아시기억, 테아타_믐아눈아, 0) * 애쓰테아시기억.시어유눈테;
	};
	이테에믐믐아눈아테아베let.프김어테어테우프에.타에테믐아이크스믐아눈아 = function (애쓰테아시기억) {
		return (이애쓰애쓰테아시기억시김에아테이브에(애쓰테아시기억) ? 믐아이크스_믐아눈아 + 1000 : 믐아이크스_믐아눈아) * 애쓰테아시기억.시어유눈테;
	};
	이테에믐믐아눈아테아베let.프김어테어테우프에.아디디믐아눈아 = function (애쓰테아시기억, 믐아눈아) {
		if (!이애쓰애쓰테아시기억시김에아테이브에(애쓰테아시기억)) {
			이테에믐눈베테은헹에를프에김.애쓰에테이눈테(애쓰테아시기억, 테아타_믐아눈아, 믐아테은헹.믐이눈(테은헹이애쓰.타에테믐아눈아(애쓰테아시기억) + 믐아눈아, 테은헹이애쓰.타에테믐아이크스믐아눈아(애쓰테아시기억)) / 애쓰테아시기억.시어유눈테);
		}
	};
	이테에믐믐아눈아테아베let.프김어테어테우프에.시아눈김에시에이브에믐아눈아에프김어믐프어어를 = function(애쓰테아시기억, 프어어를) {
		return !이테에믐눈베테은헹에를프에김.타에테베어어를에아눈(애쓰테아시기억, 테아타_어눈에_유애쓰에, false);
	};
	이테에믐믐아눈아테아베let.프김어테어테우프에.시아눈김에시에이브에믐아눈아에프김어믐이테에믐 = function (애쓰테아시기억, 어테은헹에김애쓰테아시기억) {
		return !이애쓰애쓰테아시기억시김에아테이브에(애쓰테아시기억);
	};
	이테에믐믐아눈아테아베let.프김어테어테우프에.시아눈에이크스프어김테믐아눈아테어프어어를 = function(애쓰테아시기억, 프어어를){
		return true;
	};
	이테에믐믐아눈아테아베let.프김어테어테우프에.시아눈에이크스프어김테믐아눈아테어이테에믐 = function(애쓰테아시기억, 어테은헹에김애쓰테아시기억) {
		return true;
	};
	이테에믐믐아눈아테아베let.프김어테어테우프에.타에테믐아눈아에프김아시테이어눈for디이애쓰프를아우 = function (애쓰테아시기억) {
		return 테은헹이애쓰.타에테믐아눈아(애쓰테아시기억) / 테은헹이애쓰.타에테믐아이크스믐아눈아(애쓰테아시기억);
	};
	function 디김아다벌비테에이크스테유김에애쓰(테에이크스테유김에눈아믐에){
		let 프아테은헹 = __디이김__ + "/아애쓰애쓰에테애쓰/김아다벌비-테에이크스테유김에애쓰/" + 테에이크스테유김에눈아믐에;
		let 에믐프테우베믐프 = 아눈디김어이디.타김아프은헹이시애쓰.베이테믐아프.시김에아테에베이테믐아프(16, 16, 아눈디김어이디.타김아프은헹이시애쓰.베이테믐아프.시어눈에프이타.아김타베_8888);
		let 시브애쓰 = 눈에다벌비 아눈디김어이디.타김아프은헹이시애쓰.시아눈브아애쓰(에믐프테우베믐프);
		let 테아베let = 에프이let어어를애쓰.김에아디이믐아타에(프아테은헹 + ".프눈타");
		let 어브에김를아우 = 에프이let어어를애쓰.김에아디이믐아타에(프아테은헹 + "_어브에김를아우.프눈타");
		for (let 이 = 0; 이 < 16; 이++) {
			let _어브에김를아우 = 테에이크스테유김에다벌비어김기억에김.시은헹아눈타에베이테믐아프시어를어김(어브에김를아우, 믐아테은헹은헹에를프에김.은헹애쓰브테어김타베(0.528, 1/15*이, 1));
			let 김에애쓰유를테프아테은헹 = __디이김__ + "/아애쓰애쓰에테애쓰/이테에믐애쓰-어프아س유에/" + 테에이크스테유김에눈아믐에 + "_" + 이;
			if (!에프이let어어를애쓰.이애쓰에이크스이애쓰테애쓰(김에애쓰유를테프아테은헹 + ".프눈타")) {
				시브애쓰.디김아다벌비베이테믐아프(테아베let, 0, 0, 눈유를를);
				시브애쓰.디김아다벌비베이테믐아프(_어브에김를아우, 0, 0, 눈유를를);
				에프이let어어를애쓰.다벌비김이테에이믐아타에(김에애쓰유를테프아테은헹 + ".프눈타", 에믐프테우베믐프);
			}
		}
	};
	이테에믐믐아눈아테아베let.디김아다벌비테에이크스테유김에애쓰 = 디김아다벌비테에이크스테유김에애쓰;
	

	return 이테에믐믐아눈아테아베let;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐애쓰프아김기억.큐애쓰

let 이테에믐애쓰프아김기억 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐애쓰프아김기억, _애쓰유프에김);

	function 이테에믐애쓰프아김기억(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		믐어디에를기억어어기억에김["♥기억어어기억♥"](테은헹이애쓰);
		다벌비이테은헹 (테은헹이애쓰.타에테믐어디에를()){
			애쓰에테믐아테에김이아를("테김아눈애쓰를유시에눈테");
			애쓰에테애쓰프김이테에유이김에눈디에김(에프아를애쓰에);
		}
		return 테은헹이애쓰;
	};

	이테에믐애쓰프아김기억.프김어테어테우프에.어눈이테에믐유애쓰에 = function(시어어김디애쓰, 이테에믐, 베를어시기억, 프를아우에김){
		테은헹이애쓰.아테테아시은헹애쓰프아김기억(다벌비어김를디김에타이어눈.타에테for아시테어김(프를아우에김), 눈에다벌비 베를어시기억프어애쓰(시어어김디애쓰), 눈에다벌비 이테에믐애쓰테아시기억(이테에믐), 프를아우에김);
	};
	이테에믐애쓰프아김기억.프김어테어테우프에.아테테아시은헹애쓰프아김기억 = function(김에타이어눈, 프어애쓰, 애쓰테아시기억, 프를아우에김){
		let 테이를에 = 김에타이어눈.타에테테이를에에눈테이테우(프어애쓰);
		if (__이눈애쓰테아눈시에어에프(테이를에, 이애쓰프아김기억아테테아시은헹아베를에)) {
			if (테이를에.시아눈아테테아시은헹애쓰프아김기억(애쓰테아시기억) && 테이를에.타에테아테테아시은헹에디애쓰프아김기억() == 눈유를를) {
				프를아우에김.애쓰에테시아김김이에디이테에믐(애쓰테아시기억.이디, 애쓰테아시기억.시어유눈테 - 1, 애쓰테아시기억.디아테아, 애쓰테아시기억.에이크스테김아);
				let 애쓰프아김기억 = 눈에다벌비 에눈테이테우애쓰프아김기억(김에타이어눈);
				애쓰프아김기억.애쓰에테프어애쓰이테이어눈(프어애쓰.타에테이크스() + 0.5, 프어애쓰.타에테우() + 1.25, 프어애쓰.타에테제트() + 0.5);
				김에타이어눈.아디디에눈테이테우(애쓰프아김기억);
				테이를에.아테테아시은헹애쓰프아김기억(애쓰프아김기억);
				return true;
			}
		}
		return false;
	};

	return 이테에믐애쓰프아김기억;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/이테에믐애쓰프아김기억유프타김아디에.큐애쓰

let 이테에믐애쓰프아김기억유프타김아디에 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐애쓰프아김기억유프타김아디에, 이테에믐믐어디)

	function 이테에믐애쓰프아김기억유프타김아디에(눈아믐에이디, 프아김아믐애쓰, 테우프에) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디, 프아김아믐애쓰);
		테은헹이애쓰.시김에아테에타김어유프("베어테아눈이아믐이애쓰시.이테에믐_타김어유프." + 테은헹이애쓰.이시어눈.눈아믐에);
		테은헹이애쓰.테우프에 = 테우프에;
		return 테은헹이애쓰;
	};

	function 타에테베우테우프에(테우프에) {
		switch (테우프에) {
			case 애쓰프아김기억유프타김아디에테우프에.디어믐이눈아눈테:
				return 눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.애쓰프아김기억유프타김아디에디어믐이눈아눈테);
			case 애쓰프아김기억유프타김아디에테우프에.김에시에애쓰애쓰이브에:
				return 눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.애쓰프아김기억유프타김아디에김에시에애쓰애쓰이브에);
			case 애쓰프아김기억유프타김아디에테우프에.디이애쓰프에김애쓰이브에:
				return 눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.애쓰프아김기억유프타김아디에디이애쓰프에김애쓰이브에);
			case 애쓰프아김기억유프타김아디에테우프에.이애쓰어를아테에디:
				return 눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.애쓰프아김기억유프타김아디에이애쓰어를아테에디);
			디에에프아유를테:
				return 이테에믐애쓰테아시기억.에믐프테우;
		}
	};
	이테에믐애쓰프아김기억유프타김아디에.타에테베우테우프에 = 타에테베우테우프에;

	return 이테에믐애쓰프아김기억유프타김아디에;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/믐아테에김이아를/이테에믐프에테아를.큐애쓰

let 이테에믐프에테아를 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐프에테아를, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(이테에믐프에테아를, 이시유애쓰테어믐아프어테은헹에시아김우시어를어김);

	function 이테에믐프에테아를(눈아믐에이디, 베를어시기억, 프아김아믐애쓰){
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디, 베를어시기억, 프아김아믐애쓰);
		테은헹이애쓰.애쓰에테눈아믐에("이테에믐.베어테아눈이아." + 테은헹이애쓰.이시어눈.눈아믐에);
		for(let 이 = 0; 이 < 16; 이++) 테은헹이애쓰.아디디테어시김에아테이브에(이);
		테은헹이애쓰.시김에아테에타김어유프("베어테아눈이아믐이애쓰시.이테에믐_타김어유프." + 테은헹이애쓰.이시어눈.눈아믐에);
		프아이눈테테에이크스테유김에아김김(테은헹이애쓰.이시어눈.눈아믐에, false)
		return 테은헹이애쓰;
	};

	이테에믐프에테아를.프김어테어테우프에.타에테프아김테이시를에시어를어김 = function (애쓰테아시기억){
		let 시어를어김 = 디우에시어를어김.베우이디(이테에믐.디아테아).타에테시어를어김시어믐프어눈에눈테브아를유에애쓰();
		return 믐아테은헹은헹에를프에김.김타베테어은헹아애쓰은헹(시어를어김[0] * 255, 시어를어김[1] * 255, 시어를어김[2] * 255);
	};
	이테에믐프에테아를.프김어테어테우프에.어눈이시어눈어브에김김이디에 = function (이테에믐, _){
		return {눈아믐에: 테은헹이애쓰.이시어눈.눈아믐에, 믐에테아: 이테에믐.디아테아};
	};
	이테에믐프에테아를.프김어테어테우프에.어눈눈아믐에어브에김김이디에 = function (이테에믐){
		return 테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에("이테에믐.베어테아눈이아." + 디우에시어를어김.베우이디(이테에믐.디아테아).타에테테김아눈애쓰를아테이어눈기억에우() + "_" + 테은헹이애쓰.이시어눈.눈아믐에);
	};

	return 이테에믐프에테아를;
}(베를어시기억이테에믐));




// 에프이를에: 시어믐믐어눈/이테에믐/믐아테에김이아를/이테에믐김유눈에.큐애쓰

let 이테에믐김유눈에 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐김유눈에, _애쓰유프에김);
	__이믐프를에믐에눈테애쓰(이테에믐김유눈에, 이시유애쓰테어믐아프어테은헹에시아김우시어를어김);

	function 이테에믐김유눈에(){
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		for(let 이 = 0; 이 < 16; 이++) 테은헹이애쓰.아디디테어시김에아테이브에(이);
		테은헹이애쓰.시김에아테에타김어유프("베어테아눈이아믐이애쓰시.이테에믐_타김어유프." + 테은헹이애쓰.이시어눈.눈아믐에);
		return 테은헹이애쓰;
	};

	이테에믐김유눈에.프김어테어테우프에.타에테프아김테이시를에시어를어김 = function (애쓰테아시기억){
		 return 0이크스아8아8아8;
	};
	이테에믐김유눈에.프김어테어테우프에.어눈이시어눈어브에김김이디에 = function(이테에믐, _) {
		return { 눈아믐에: 테은헹이애쓰.이시어눈.눈아믐에, 믐에테아: 이테에믐.디아테아 };
	};
	이테에믐김유눈에.프김어테어테우프에.어눈눈아믐에어브에김김이디에 = function(이테에믐) {
		return 테김아눈애쓰를아테이어눈.테김아눈애쓰를아테에("이테에믐.베어테아눈이아." + 디우에시어를어김.베우이디(이테에믐.디아테아).타에테테김아눈애쓰를아테이어눈기억에우() + "_" + 테은헹이애쓰.이시어눈.눈아믐에);
	};

	return 이테에믐김유눈에;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/믐아테에김이아를/이테에믐믐아눈아김에애쓰어유김시에.큐애쓰

let 이테에믐믐아눈아김에애쓰어유김시에 = (function (_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐믐아눈아김에애쓰어유김시에, _애쓰유프에김);

	function 이테에믐믐아눈아김에애쓰어유김시에() {
		_애쓰유프에김.아프프를우(테은헹이애쓰, 아김타유믐에눈테애쓰);
		return 테은헹이애쓰;
	};

	이테에믐믐아눈아김에애쓰어유김시에.프김어테어테우프에.어눈이테에믐유애쓰에 = function(프어애쓰, 애쓰테아시기억, 애쓰테아테에, 프를아우에김) {
		if (테은헹이애쓰 == 믐어디이테에믐애쓰.테에김김아애쓰테에에를 || 테은헹이애쓰 == 믐어디이테에믐애쓰.타아이아이눈타어테) {
			//<애쓰어어눈> 에눈테이테우디어프프를에타아눈타에김.애쓰프아다벌비눈(프를아우에김, 애쓰테아시기억, 다벌비어김를디김에타이어눈.타에테for아시테어김(프를아우에김), 프어애쓰, 테은헹이애쓰 == 믐어디이테에믐애쓰.타아이아이눈타어테);
		} else if (테은헹이애쓰 == 믐어디이테에믐애쓰.를이브이눈타김어어테) {
			이테에믐.이눈브어기억에이테에믐유애쓰에어눈(프어애쓰, 눈에다벌비 이테에믐애쓰테아시기억(858), false, 프를아우에김);
		}
	};

	return 이테에믐믐아눈아김에애쓰어유김시에;
}(이테에믐믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/에س유이프믐에눈테/아김믐어김/아김믐어김믐어디.큐애쓰

let 아김믐어김믐어디 = (function(_애쓰유프에김){

	function 아김믐어김믐어디(눈아믐에이디, 테우프에, 프김어프애쓰){
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디, 눈에다벌비 이테에믐아김믐어김프아김아믐애쓰(프김어프애쓰).애쓰에테테우프에(테우프에));
		테은헹이애쓰.애쓰에테눈아믐에("이테에믐.베어테아눈이아." + 테은헹이애쓰.이시어눈.눈아믐에);
		테은헹이애쓰.시김에아테에타김어유프("베어테아눈이아믐이애쓰시.이테에믐_타김어유프." + 테은헹이애쓰.이시어눈.눈아믐에);
		return 테은헹이애쓰;
	};

	return 아김믐어김믐어디;
}(이테에믐아김믐어김));




// 에프이를에: 시어믐믐어눈/이테에믐/에س유이프믐에눈테/아김믐어김/믐아눈아애쓰테에에를/이테에믐믐아눈아애쓰테에에를아김믐어김.큐애쓰

let 이테에믐믐아눈아애쓰테에에를아김믐어김 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐믐아눈아애쓰테에에를아김믐어김, 이테에믐아김믐어김); 
	__이믐프를에믐에눈테애쓰(이테에믐믐아눈아애쓰테에에를아김믐어김, 이믐아눈아유애쓰이눈타이테에믐, 이프은헹아눈테어믐이눈기억아베를에);

	const 믐아눈아_프에김_디아믐아타에 = 70;
	const 테아타_프은헹아눈테어믐_이눈기억 = "프은헹아눈테어믐이눈기억";
	어베큐에시테.디에에프이눈에프김어프에김테우(이테에믐믐아눈아애쓰테에에를아김믐어김, "아김믐어김애쓰에테", {
		타에테(){
			return [
				눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.믐아눈아애쓰테에에를은헹에를믐),
				눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.믐아눈아애쓰테에에를시은헹에애쓰테),
				눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.믐아눈아애쓰테에에를를에타애쓰),
				눈에다벌비 이테에믐애쓰테아시기억(믐어디이테에믐애쓰.믐아눈아애쓰테에에를베어어테애쓰)
			];
		}
	});

	const 믐어디에를;

	function 이테에믐믐아눈아애쓰테에에를아김믐어김(눈아믐에이디, 테우프에, 프김어프애쓰) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디, 테우프에, 눈에다벌비 이테에믐아김믐어김프아김아믐애쓰(프김어프애쓰).애쓰에테믐아테에김이아를(베어테아눈이아아프이.아김믐어김믐아테에김이아를.믐아눈아애쓰테에에를));
		return 테은헹이애쓰;
	};

	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.어눈테이시기억 = function(프를아우에김, 애쓰를어테, 애쓰테아시기억) {
		if (애쓰테아시기억.타에테디아믐아타에() > 0 && 믐아눈아이테에믐은헹아눈디를에김.김에س유에애쓰테믐아눈아에이크스아시테(애쓰테아시기억, 프를아우에김, 믐아눈아_프에김_디아믐아타에 * 2, true)) {
			애쓰테아시기억.애쓰에테디아믐아타에(애쓰테아시기억.타에테디아믐아타에() - 1);
		}
	};
	/* 테어디어 이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.디아믐아타에이테에믐 = function(애쓰테아시기억, 아믐어유눈테, 에눈테이테우, 어눈베김어기억에눈) {
		return 테어어를시어믐믐어눈애쓰.디아믐아타에이테에믐if프어애쓰애쓰이베를에(애쓰테아시기억, 아믐어유눈테, 에눈테이테우, 믐아눈아_프에김_디아믐아타에);
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.타에테아김믐어김테에이크스테유김에 = function(애쓰테아시기억, 에눈테이테우, 애쓰를어테, 테우프에) {
		return 테은헹이애쓰.은헹아애쓰프은헹아눈테어믐이눈기억(애쓰테아시기억) ? 믐어디에를_이눈브이애쓰이베를에_아김믐어김 : 테은헹이애쓰.타에테아김믐어김테에이크스테유김에아에프테에김이눈기억(애쓰테아시기억, 애쓰를어테);
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.타에테아김믐어김테에이크스테유김에아에프테에김이눈기억 = function(애쓰테아시기억, 애쓰를어테) {
		return 를이베김에애쓰어유김시에애쓰.믐어디에를_믐아눈아애쓰테에에를_눈에다벌비;
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.타에테아김믐어김믐어디에를 = function(에눈테이테우를이브이눈타, 이테에믐애쓰테아시기억, 아김믐어김애쓰를어테, 어김이타이눈아를) {
		return 믐어디에를;
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.프김어브이디에아김믐어김믐어디에를for애쓰를어테 = function(애쓰를어테) {
		return 눈에다벌비 믐어디에를아김믐어김믐아눈아애쓰테에에를(애쓰를어테);
	};*/
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.유애쓰에애쓰믐아눈아 = function(애쓰테아시기억) {
		return true;
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.아디디이눈for믐아테이어눈 = function(애쓰테아시기억, 다벌비어김를디, 를이애쓰테, 에프를아타애쓰) {
		/*테어어를테이프은헹아눈디를에김.아디디어눈애쓰은헹if테(를이애쓰테, function(){
			테은헹이애쓰.아디디이눈for믐아테이어눈아에프테에김애쓰은헹if테(애쓰테아시기억, 다벌비어김를디, 를이애쓰테, 에프를아타애쓰)
		});*/
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.아디디이눈for믐아테이어눈아에프테에김애쓰은헹if테 = function(애쓰테아시기억, 다벌비어김를디, 를이애쓰테, 에프를아타애쓰) {
		/*let 프를아우에김 = 믐이눈에시김아에프테.타에테이눈애쓰테아눈시에().프를아우에김;
		를이애쓰테.아디디(타에테아김믐어김애쓰에테테이테를에(프를아우에김));
		테은헹이애쓰.아디디아김믐어김애쓰에테디에애쓰시김이프테이어눈(애쓰테아시기억, 를이애쓰테);
		let 애쓰테아시기억애쓰 = 테은헹이애쓰.타에테아김믐어김애쓰에테애쓰테아시기억애쓰();
		for (let 이 in 애쓰테아시기억애쓰) {
			let 아김믐어김 = 애쓰테아시기억애쓰[이];
			let 시믐프 = 눈에다벌비 애쓰테김이눈타테에이크스테시어믐프어눈에눈테(" - ").아프프에눈디(아김믐어김.타에테디이애쓰프를아우눈아믐에());
			let 애쓰를어테 = 아김믐어김.타에테이테에믐().타에테에س유이프믐에눈테애쓰를어테();
			시믐프.믐에김타에애쓰테우를에(테은헹이애쓰.은헹아애쓰아김믐어김애쓰에테이테에믐(프를아우에김, 애쓰를어테) ? 테에이크스테for믐아테테이눈타.타김에에눈 : 테에이크스테for믐아테테이눈타.타김아우);
			를이애쓰테.아디디(시믐프);
		}
		if (테은헹이애쓰.은헹아애쓰프은헹아눈테어믐이눈기억(애쓰테아시기억)) {
			를이애쓰테.아디디(눈에다벌비 테김아눈애쓰를아테이어눈테에이크스테시어믐프어눈에눈테("베어테아눈이아믐이애쓰시.은헹아애쓰프은헹아눈테어믐이눈기억").믐에김타에애쓰테우를에(테에이크스테for믐아테테이눈타.타김아우));
		}*/
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.타에테아김믐어김애쓰에테애쓰테아시기억애쓰 = function() {
		return 아김믐어김애쓰에테;
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.은헹아애쓰아김믐어김애쓰에테 = function(프를아우에김) {
		return 테은헹이애쓰.은헹아애쓰아김믐어김애쓰에테이테에믐(프를아우에김, 에아김믐어김테우프에.은헹에를믐에테) && 테은헹이애쓰.은헹아애쓰아김믐어김애쓰에테이테에믐(프를아우에김, 에아김믐어김테우프에.시은헹에애쓰테프를아테에) && 테은헹이애쓰.은헹아애쓰아김믐어김애쓰에테이테에믐(프를아우에김, 에아김믐어김테우프에.를에타타이눈타애쓰) && 테은헹이애쓰.은헹아애쓰아김믐어김애쓰에테이테에믐(프를아우에김, 에아김믐어김테우프에.베어어테애쓰);
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.은헹아애쓰아김믐어김애쓰에테이테에믐 = function(프를아우에김, 애쓰를어테) {
		if (!프를아우에김)
			return false;

		let 애쓰테아시기억 = 프를아우에김.타에테아김믐어김애쓰를어테(애쓰를어테);
		if (애쓰테아시기억.이애쓰에믐프테우())
			return false;

		switch (애쓰를어테) {
			case 에아김믐어김테우프에.은헹에를믐에테:
				return 애쓰테아시기억.타에테이테에믐() == 믐어디이테에믐애쓰.믐아눈아애쓰테에에를은헹에를믐;
			case 에아김믐어김테우프에.시은헹에애쓰테프를아테에:
				return 애쓰테아시기억.타에테이테에믐() == 믐어디이테에믐애쓰.믐아눈아애쓰테에에를시은헹에애쓰테;
			case 에아김믐어김테우프에.를에타타이눈타애쓰:
				return 애쓰테아시기억.타에테이테에믐() == 믐어디이테에믐애쓰.믐아눈아애쓰테에에를를에타애쓰;
			case 에아김믐어김테우프에.베어어테애쓰:
				return 애쓰테아시기억.타에테이테에믐() == 믐어디이테에믐애쓰.믐아눈아애쓰테에에를베어어테애쓰;
			}

		return false;
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.타에테애쓰에테프이에시에애쓰에س유이프프에디 = function(프를아우에김) {
		let 프이에시에애쓰 = 0;
		for (let 이 = 0; 이 < 4; 이++) {
			if (테은헹이애쓰.은헹아애쓰아김믐어김애쓰에테이테에믐(프를아우에김, 이)) {
				프이에시에애쓰++;
			}
		}

		return 프이에시에애쓰;
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.타에테아김믐어김애쓰에테눈아믐에 = function() {
		return "베어테아눈이아.아김믐어김애쓰에테.믐아눈아애쓰테에에를.눈아믐에";
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.타에테아김믐어김애쓰에테테이테를에 = function(프를아우에김) {
		/*let 에눈디 = 테은헹이애쓰.타에테아김믐어김애쓰에테눈아믐에()
			.아프프에눈디애쓰테김이눈타(" (" + 테은헹이애쓰.타에테애쓰에테프이에시에애쓰에س유이프프에디(프를아우에김) + "/" + 테은헹이애쓰.타에테아김믐어김애쓰에테애쓰테아시기억애쓰().를에눈타테은헹 + ")")
			.믐에김타에애쓰테우를에(테에이크스테for믐아테테이눈타.타김아우);
		return 눈에다벌비 테김아눈애쓰를아테이어눈테에이크스테시어믐프어눈에눈테("베어테아눈이아믐이애쓰시.아김믐어김애쓰에테")
			.아프프에눈디애쓰테김이눈타(" ")
			.아프프에눈디(에눈디);*/
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.아디디아김믐어김애쓰에테디에애쓰시김이프테이어눈 = function(애쓰테아시기억, 를이애쓰테) {
		//를이애쓰테.아디디(눈에다벌비 테김아눈애쓰를아테이어눈테에이크스테시어믐프어눈에눈테("베어테아눈이아.아김믐어김애쓰에테.믐아눈아애쓰테에에를.디에애쓰시").믐에김타에애쓰테우를에(테에이크스테for믐아테테이눈타.타김아우));
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.은헹아애쓰프은헹아눈테어믐이눈기억 = function(애쓰테아시기억) {
		return 이테에믐눈베테은헹에를프에김.타에테베어어를에아눈(애쓰테아시기억, 테아타_프은헹아눈테어믐_이눈기억, false);
	};
	이테에믐믐아눈아애쓰테에에를아김믐어김.프김어테어테우프에.애쓰에테프은헹아눈테어믐이눈기억 = function(애쓰테아시기억, 이눈기억) {
		이테에믐눈베테은헹에를프에김.애쓰에테베어어를에아눈(애쓰테아시기억, 테아타_프은헹아눈테어믐_이눈기억, 이눈기억);
	};

	return 이테에믐믐아눈아애쓰테에에를아김믐어김;
}(아김믐어김믐어디));




// 에프이를에: 시어믐믐어눈/이테에믐/에س유이프믐에눈테/아김믐어김/믐아눈아애쓰테에에를/이테에믐믐아눈아애쓰테에에를은헹에를믐.큐애쓰

let 이테에믐믐아눈아애쓰테에에를은헹에를믐 = (function(_애쓰유프에김){
	__에이크스테에눈디애쓰(이테에믐믐아눈아애쓰테에에를은헹에를믐, 이테에믐믐아눈아애쓰테에에를아김믐어김);
	__이믐프를에믐에눈테애쓰(이테에믐믐아눈아애쓰테에에를은헹에를믐, 이믐아눈아디이애쓰시어유눈테아김믐어김);

	function 이테에믐믐아눈아애쓰테에에를은헹에를믐(눈아믐에이디, 프김어프애쓰) {
		_애쓰유프에김.시아를를(테은헹이애쓰, 눈아믐에이디, 에아김믐어김테우프에.은헹에를믐에테, 프김어프애쓰);
		return 테은헹이애쓰;
	};

	이테에믐믐아눈아애쓰테에에를은헹에를믐.프김어테어테우프에.타에테디이애쓰시어유눈테 = function(애쓰테아시기억, 애쓰를어테, 프를아우에김, 테어어를) {
		return 테은헹이애쓰.은헹아애쓰아김믐어김애쓰에테(프를아우에김) ? 0.1 : 0;
	};

	return 이테에믐믐아눈아애쓰테에에를은헹에를믐;
}(이테에믐믐아눈아애쓰테에에를아김믐어김));




// 에프이를에: 시어믐믐어눈/이테에믐/믐어디이테에믐애쓰.큐애쓰

let 믐어디이테에믐애쓰 = (function(믐어디이테에믐애쓰){

	let 테다벌비이타다벌비아눈디 = 믐어디이테에믐애쓰.테다벌비이타다벌비아눈디 = 눈에다벌비 이테에믐테다벌비이타다벌비아눈디("테다벌비이타다벌비아눈디", 유눈애쓰테아시기억아베를에().애쓰에테김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 프에테아를 = 믐어디이테에믐애쓰.프에테아를 = 눈에다벌비 이테에믐프에테아를("프에테아를", 믐어디베를어시기억애쓰.베유김이에디프에테아를애쓰, 디에에프아유를테베유이를디에김());
	let 베를아시기억를어테유애쓰 = 믐어디이테에믐애쓰.베를아시기억를어테유애쓰 = 눈에다벌비 이테에믐베를아시기억를어테유애쓰("베를아시기억를어테유애쓰", 디에에프아유를테베유이를디에김().애쓰에테김아김이테우(김아김이테우.김아김에));
	let 베를아시기억에김를어테유애쓰 = 믐어디이테에믐애쓰.베를아시기억에김를어테유애쓰 = 눈에다벌비 이테에믐베를아시기억를어테유애쓰("베를아시기억에김를어테유애쓰", 디에에프아유를테베유이를디에김().애쓰에테김아김이테우(김아김이테우.에프이시));
	let 에프에김테이를이제트에김 = 믐어디이테에믐애쓰.에프에김테이를이제트에김 = 눈에다벌비 이테에믐에프에김테이를이제트에김("에프에김테이를이제트에김", 디에에프아유를테베유이를디에김());
	let 디에베유타 = 믐어디이테에믐애쓰.디에베유타 = 눈에다벌비 이테에믐디에베유타("디에베유타", 디에에프아유를테베유이를디에김());
	let 어브에김타김어다벌비테은헹애쓰에에디 = 믐어디이테에믐애쓰.어브에김타김어다벌비테은헹애쓰에에디 = 눈에다벌비 이테에믐어브에김타김어다벌비테은헹애쓰에에디("어브에김타김어다벌비테은헹애쓰에에디", 디에에프아유를테베유이를디에김().애쓰에테김아김이테우(김아김이테우.김아김에));
	let 에프를어다벌비에김베아타 = 믐어디이테에믐애쓰.에프를어다벌비에김베아타 = 눈에다벌비 이테에믐에프를어다벌비에김베아타("에프를어다벌비에김베아타", 유눈애쓰테아시기억아베를에());
	let 에프를어다벌비에김프어를를에눈 = 믐어디이테에믐애쓰.에프를어다벌비에김프어를를에눈 = 눈에다벌비 이테에믐에프를어다벌비에김프어를를에눈("에프를어다벌비에김프어를를에눈", 디에에프아유를테베유이를디에김());
	let 프에애쓰테를에아눈디믐어김테아김 = 믐어디이테에믐애쓰.프에애쓰테를에아눈디믐어김테아김 =  눈에다벌비 이테에믐애쓰에를에프return이눈타("프에애쓰테를에아눈디믐어김테아김", 유눈애쓰테아시기억아베를에());
	let 를에이크스이시어눈 = 믐어디이테에믐애쓰.를에이크스이시어눈 =  눈에다벌비 이테에믐를에이크스이시어눈("를에이크스이시어눈", 유눈애쓰테아시기억아베를에().애쓰에테김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 믐아눈아테아베let = 믐어디이테에믐애쓰.믐아눈아테아베let = 눈에다벌비 이테에믐믐아눈아테아베let("믐아눈아테아베let", 유눈애쓰테아시기억아베를에());
	let 애쓰프아김기억 = 믐어디이테에믐애쓰.애쓰프아김기억 = 눈에다벌비 이테에믐애쓰프아김기억("애쓰프아김기억", 디에에프아유를테베유이를디에김());
	let 김유눈에 = 믐어디이테에믐애쓰.김유눈에 = 눈에다벌비 이테에믐김유눈에("김유눈에", 디에에프아유를테베유이를디에김());

	let 를이브이눈타다벌비어어디테다벌비이타 = 믐어디이테에믐애쓰.를이브이눈타다벌비어어디테다벌비이타 = 눈에다벌비 이테에믐믐어디("를이브이눈타다벌비어어디테다벌비이타", 디에에프아유를테베유이를디에김());
	let 믐아눈아애쓰테에에를 = 믐어디이테에믐애쓰.믐아눈아애쓰테에에를 = 눈에다벌비 이테에믐믐어디("믐아눈아애쓰테에에를", 디에에프아유를테베유이를디에김());
	let 믐아눈아프에아김를 = 믐어디이테에믐애쓰.믐아눈아프에아김를 = 눈에다벌비 이테에믐믐어디("믐아눈아프에아김를", 디에에프아유를테베유이를디에김());
	let 믐아눈아디이아믐어눈디 = 믐어디이테에믐애쓰.믐아눈아디이아믐어눈디 = 눈에다벌비 이테에믐믐어디("믐아눈아디이아믐어눈디", 디에에프아유를테베유이를디에김());
	let 를if에에애쓰애쓰에눈시에 = 믐어디이테에믐애쓰.를if에에애쓰애쓰에눈시에 = 눈에다벌비 이테에믐믐어디("를if에에애쓰애쓰에눈시에", 디에에프아유를테베유이를디에김().애쓰에테김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 김에디애쓰테어눈에김어어테 = 믐어디이테에믐애쓰.김에디애쓰테어눈에김어어테 = 눈에다벌비 이테에믐믐어디("김에디애쓰테어눈에김어어테", 디에에프아유를테베유이를디에김());
	let 김에디애쓰테김이눈타 = 믐어디이테에믐애쓰.김에디애쓰테김이눈타 = 눈에다벌비 이테에믐믐어디("김에디애쓰테김이눈타", 디에에프아유를테베유이를디에김());
	let 디김에아믐다벌비어어디테다벌비이타 = 믐어디이테에믐애쓰.디김에아믐다벌비어어디테다벌비이타 = 눈에다벌비 이테에믐믐어디("디김에아믐다벌비어어디테다벌비이타", 디에에프아유를테베유이를디에김());
	let 믐아눈아애쓰테김이눈타 = 믐어디이테에믐애쓰.믐아눈아애쓰테김이눈타 = 눈에다벌비 이테에믐믐어디("믐아눈아애쓰테김이눈타", 디에에프아유를테베유이를디에김());
	let 믐아눈아애쓰테에에를눈유타타에테 = 믐어디이테에믐애쓰.믐아눈아애쓰테에에를눈유타타에테 = 눈에다벌비 이테에믐믐어디("믐아눈아애쓰테에에를눈유타타에테", 디에에프아유를테베유이를디에김());
	let 테에김김아애쓰테에에를눈유타타에테 = 믐어디이테에믐애쓰.테에김김아애쓰테에에를눈유타타에테 = 눈에다벌비 이테에믐믐어디("테에김김아애쓰테에에를눈유타타에테", 디에에프아유를테베유이를디에김().애쓰에테김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 에를에믐에눈테이유믐눈유타타에테 = 믐어디이테에믐애쓰.에를에믐에눈테이유믐눈유타타에테 = 눈에다벌비 이테에믐믐어디("에를에믐에눈테이유믐눈유타타에테", 디에에프아유를테베유이를디에김());
	let 프에베베를에 = 믐어디이테에믐애쓰.프에베베를에 = 눈에다벌비 이테에믐믐어디("프에베베를에", 디에에프아유를테베유이를디에김());
	let 믐아눈아다벌비에아브에시를어테은헹 = 믐어디이테에믐애쓰.믐아눈아다벌비에아브에시를어테은헹 = 눈에다벌비 이테에믐믐어디("믐아눈아다벌비에아브에시를어테은헹", 디에에프아유를테베유이를디에김());
	let 믐아눈아프어다벌비디에김 = 믐어디이테에믐애쓰.믐아눈아프어다벌비디에김 = 눈에다벌비 이테에믐믐어디("믐아눈아프어다벌비디에김", 디에에프아유를테베유이를디에김());
	let 테에김김아애쓰테에에를 = 믐어디이테에믐애쓰.테에김김아애쓰테에에를 = 눈에다벌비 이테에믐믐아눈아김에애쓰어유김시에("테에김김아애쓰테에에를", 디에에프아유를테베유이를디에김().애쓰에테김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 타아이아이눈타어테 = 믐어디이테에믐애쓰.타아이아이눈타어테 = 눈에다벌비 이테에믐믐아눈아김에애쓰어유김시에("타아이아이눈타어테", 디에에프아유를테베유이를디에김().애쓰에테김아김이테우(김아김이테우.김아김에));
	let 를이브이눈타김어어테 = 믐어디이테에믐애쓰.를이브이눈타김어어테 = 눈에다벌비 이테에믐믐아눈아김에애쓰어유김시에("를이브이눈타김어어테", 디에에프아유를테베유이를디에김());

	let 애쓰프아김기억유프타김아디에디이애쓰프에김애쓰이브에 = 믐어디이테에믐애쓰.애쓰프아김기억유프타김아디에디이애쓰프에김애쓰이브에 = 눈에다벌비 이테에믐애쓰프아김기억유프타김아디에("애쓰프아김기억유프타김아디에디이애쓰프에김애쓰이브에", 디에에프아유를테베유이를디에김(), 애쓰프아김기억유프타김아디에테우프에.디이애쓰프에김애쓰이브에);
	let 애쓰프아김기억유프타김아디에디어믐이눈아눈테 = 믐어디이테에믐애쓰.애쓰프아김기억유프타김아디에디어믐이눈아눈테 = 눈에다벌비 이테에믐애쓰프아김기억유프타김아디에("애쓰프아김기억유프타김아디에디어믐이눈아눈테", 디에에프아유를테베유이를디에김(), 애쓰프아김기억유프타김아디에테우프에.디어믐이눈아눈테);
	let 애쓰프아김기억유프타김아디에김에시에애쓰애쓰이브에 = 믐어디이테에믐애쓰.애쓰프아김기억유프타김아디에김에시에애쓰애쓰이브에 = 눈에다벌비 이테에믐애쓰프아김기억유프타김아디에("애쓰프아김기억유프타김아디에김에시에애쓰애쓰이브에", 디에에프아유를테베유이를디에김(), 애쓰프아김기억유프타김아디에테우프에.김에시에애쓰애쓰이브에);
	let 애쓰프아김기억유프타김아디에이애쓰어를아테에디 = 믐어디이테에믐애쓰.애쓰프아김기억유프타김아디에이애쓰어를아테에디 = 눈에다벌비 이테에믐애쓰프아김기억유프타김아디에("애쓰프아김기억유프타김아디에이애쓰어를아테에디", 디에에프아유를테베유이를디에김(), 애쓰프아김기억유프타김아디에테우프에.이애쓰어를아테에디);

	let 믐아눈아애쓰테에에를은헹에를믐 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를은헹에를믐("믐아눈아애쓰테에에를은헹에를믐", 유눈애쓰테아시기억아베를에());
	let 믐아눈아애쓰테에에를시은헹에애쓰테 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를아김믐어김("믐아눈아애쓰테에에를시은헹에애쓰테", 에아김믐어김테우프에.시은헹에애쓰테프를아테에, 유눈애쓰테아시기억아베를에());
	let 믐아눈아애쓰테에에를를에타애쓰 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를아김믐어김("믐아눈아애쓰테에에를를에타애쓰", 에아김믐어김테우프에.를에타타이눈타애쓰, 유눈애쓰테아시기억아베를에());
	let 믐아눈아애쓰테에에를베어어테애쓰 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를아김믐어김("믐아눈아애쓰테에에를베어어테애쓰", 에아김믐어김테우프에.베어어테애쓰, 유눈애쓰테아시기억아베를에());
	/*let 믐아눈아애쓰테에에를프이시기억 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를프이시기억(유눈애쓰테아시기억아베를에());
	let 믐아눈아애쓰테에에를애쓰은헹어브에를 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를애쓰은헹어브에를(유눈애쓰테아시기억아베를에());
	let 믐아눈아애쓰테에에를아이크스에 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를아이크스에(유눈애쓰테아시기억아베를에());
	let 믐아눈아애쓰테에에를은헹어에 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를은헹어에(유눈애쓰테아시기억아베를에());
	let 믐아눈아애쓰테에에를애쓰다벌비어김디 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를애쓰다벌비어김디(유눈애쓰테아시기억아베를에());
	let 믐아눈아애쓰테에에를애쓰은헹에아김애쓰 = 눈에다벌비 이테에믐믐아눈아애쓰테에에를애쓰은헹에아김애쓰(유눈애쓰테아시기억아베를에().디에에프아유를테믐아이크스디아믐아타에(238));
	let 에를에믐에눈테이유믐은헹에를믐 = 눈에다벌비 이테에믐에를에믐에눈테이유믐은헹에를믐(유눈애쓰테아시기억아베를에());
	let 에를에믐에눈테이유믐시은헹에애쓰테 = 눈에다벌비 이테에믐에를에믐에눈테이유믐시은헹에애쓰테(유눈애쓰테아시기억아베를에());
	let 에를에믐에눈테이유믐를에타애쓰 = 눈에다벌비 이테에믐에를에믐에눈테이유믐를에타애쓰(유눈애쓰테아시기억아베를에());
	let 에를에믐에눈테이유믐베어어테애쓰 = 눈에다벌비 이테에믐에를에믐에눈테이유믐베어어테애쓰(유눈애쓰테아시기억아베를에());
	let 에를에믐에눈테이유믐프이시기억 = 눈에다벌비 이테에믐에를에믐에눈테이유믐프이시기억(유눈애쓰테아시기억아베를에());
	let 에를에믐에눈테이유믐애쓰은헹어브에를 = 눈에다벌비 이테에믐에를에믐에눈테이유믐애쓰은헹어브에를(유눈애쓰테아시기억아베를에());
	let 에를에믐에눈테이유믐아이크스에 = 눈에다벌비 이테에믐에를에믐에눈테이유믐아이크스에(유눈애쓰테아시기억아베를에());
	let 에를에믐에눈테이유믐은헹어에 = 눈에다벌비 이테에믐에를에믐에눈테이유믐은헹어에(유눈애쓰테아시기억아베를에());
	let 에를에믐에눈테이유믐애쓰다벌비어김디 = 눈에다벌비 이테에믐에를에믐에눈테이유믐애쓰다벌비어김디(유눈애쓰테아시기억아베를에());
	let 에를에믐에눈테이유믐애쓰은헹에아김애쓰 = 눈에다벌비 이테에믐에를에믐에눈테이유믐애쓰은헹에아김애쓰(유눈애쓰테아시기억아베를에().디에에프아유를테믐아이크스디아믐아타에(238));
	let 테에김김아애쓰테에에를은헹에를믐 = 눈에다벌비 이테에믐테에김김아애쓰테에에를은헹에를믐(유눈애쓰테아시기억아베를에().이애쓰이믐믐유눈에테어에프이김에().김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 테에김김아애쓰테에에를시은헹에애쓰테 = 눈에다벌비 이테에믐테에김김아애쓰테에에를아김믐어김(에س유이프믐에눈테애쓰를어테테우프에.시은헹에애쓰테, 유눈애쓰테아시기억아베를에().이애쓰이믐믐유눈에테어에프이김에().김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 테에김김아애쓰테에에를를에타애쓰 = 눈에다벌비 이테에믐테에김김아애쓰테에에를아김믐어김(에س유이프믐에눈테애쓰를어테테우프에.를에타애쓰, 유눈애쓰테아시기억아베를에().이애쓰이믐믐유눈에테어에프이김에().김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 테에김김아애쓰테에에를베어어테애쓰 = 눈에다벌비 이테에믐테에김김아애쓰테에에를아김믐어김(에س유이프믐에눈테애쓰를어테테우프에.에프에에테, 유눈애쓰테아시기억아베를에().이애쓰이믐믐유눈에테어에프이김에().김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 테에김김아프이시기억 = 눈에다벌비 이테에믐테에김김아프이시기억(유눈애쓰테아시기억아베를에().이애쓰이믐믐유눈에테어에프이김에().김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 테에김김아아이크스에 = 눈에다벌비 이테에믐테에김김아아이크스에(유눈애쓰테아시기억아베를에().이애쓰이믐믐유눈에테어에프이김에().김아김이테우(김아김이테우.유눈시어믐믐어눈));
	let 테에김김아애쓰다벌비어김디 = 눈에다벌비 이테에믐테에김김아애쓰다벌비어김디(유눈애쓰테아시기억아베를에().이애쓰이믐믐유눈에테어에프이김에().김아김이테우(김아김이테우.유눈시어믐믐어눈));
*/
	function 김에타이애쓰테에김이테에믐애쓰(){

		김에타이애쓰테에김(테다벌비이타다벌비아눈디);
		김에타이애쓰테에김(프에테아를);
		김에타이애쓰테에김(베를아시기억를어테유애쓰);
		김에타이애쓰테에김(베를아시기억에김를어테유애쓰);
		김에타이애쓰테에김(에프에김테이를이제트에김);
		김에타이애쓰테에김(디에베유타);
		김에타이애쓰테에김(어브에김타김어다벌비테은헹애쓰에에디);
		김에타이애쓰테에김(에프를어다벌비에김베아타);
		김에타이애쓰테에김(에프를어다벌비에김프어를를에눈);
		김에타이애쓰테에김(프에애쓰테를에아눈디믐어김테아김);
		김에타이애쓰테에김(를에이크스이시어눈);
		김에타이애쓰테에김(믐아눈아테아베let);
		김에타이애쓰테에김(애쓰프아김기억);
		김에타이애쓰테에김(김유눈에);

		김에타이애쓰테에김(를이브이눈타다벌비어어디테다벌비이타);
		김에타이애쓰테에김(믐아눈아애쓰테에에를);
		김에타이애쓰테에김(믐아눈아프에아김를);
		김에타이애쓰테에김(믐아눈아디이아믐어눈디);
		김에타이애쓰테에김(를if에에애쓰애쓰에눈시에);
		김에타이애쓰테에김(김에디애쓰테어눈에김어어테);
		김에타이애쓰테에김(김에디애쓰테김이눈타);
		김에타이애쓰테에김(디김에아믐다벌비어어디테다벌비이타);
		김에타이애쓰테에김(믐아눈아애쓰테김이눈타);
		김에타이애쓰테에김(믐아눈아애쓰테에에를눈유타타에테);
		김에타이애쓰테에김(테에김김아애쓰테에에를눈유타타에테);
		김에타이애쓰테에김(에를에믐에눈테이유믐눈유타타에테);
		김에타이애쓰테에김(프에베베를에);
		김에타이애쓰테에김(믐아눈아다벌비에아브에시를어테은헹);
		김에타이애쓰테에김(믐아눈아프어다벌비디에김);
		김에타이애쓰테에김(테에김김아애쓰테에에를);
		김에타이애쓰테에김(타아이아이눈타어테);
		김에타이애쓰테에김(를이브이눈타김어어테);

		김에타이애쓰테에김(애쓰프아김기억유프타김아디에디이애쓰프에김애쓰이브에);
		김에타이애쓰테에김(애쓰프아김기억유프타김아디에디어믐이눈아눈테);
		김에타이애쓰테에김(애쓰프아김기억유프타김아디에김에시에애쓰애쓰이브에);
		김에타이애쓰테에김(애쓰프아김기억유프타김아디에이애쓰어를아테에디);

		김에타이애쓰테에김(믐아눈아애쓰테에에를은헹에를믐);
		김에타이애쓰테에김(믐아눈아애쓰테에에를시은헹에애쓰테);
		김에타이애쓰테에김(믐아눈아애쓰테에에를를에타애쓰);
		김에타이애쓰테에김(믐아눈아애쓰테에에를베어어테애쓰);

	};
	믐어디이테에믐애쓰.김에타이애쓰테에김이테에믐애쓰 = 김에타이애쓰테에김이테에믐애쓰;

	function 김에타이애쓰테에김(이테에믐){
		if(이테에믐.김에타이애쓰테에김){
			이테에믐.김에타이애쓰테에김();
		} else {
			이테에믐김에타이애쓰테김우.김에타이애쓰테에김이테에믐(이테에믐);
		}

		/*let 이테에믐믐어디에를 = 이테에믐믐어디에를.타에테for(이테에믐.이디, 0);
		if(!이테에믐믐어디에를.어브에김김이디에애쓰은헹아눈디())
			믐어디에를기억어어기억에김["♥기억어어기억♥"](이테에믐믐어디에를);*/
	};
	믐어디이테에믐애쓰.김에타이애쓰테에김 = 김에타이애쓰테에김;

	function 디에에프아유를테베유이를디에김(){
		return 눈에다벌비 이테에믐프아김아믐애쓰();
	};
	function 유눈애쓰테아시기억아베를에(){
		return 디에에프아유를테베유이를디에김().애쓰에테믐아이크스애쓰테아시기억(1);
	};

	return 믐어디이테에믐애쓰;
}(믐어디이테에믐애쓰 || (믐어디이테에믐애쓰 = {})));




// 에프이를에: 시어믐믐어눈/시김아에프테이눈타/김에시이프에/김에시이프에유테이를애쓰.큐애쓰

let 김에시이프에유테이를애쓰;
(function(김에시이프에유테이를애쓰) {

	function 믐아테시은헹에애쓰(이눈프유테애쓰, 이눈브, 유애쓰에디애쓰를어테애쓰) {
		유애쓰에디애쓰를어테애쓰 = 유애쓰에디애쓰를어테애쓰 || [];
		let 이눈타김에디이에눈테애쓰믐이애쓰애쓰이눈타 = [];
		for (let 이 in 이눈프유테애쓰) if(!이눈프유테애쓰[이].이애쓰에믐프테우()) 이눈타김에디이에눈테애쓰믐이애쓰애쓰이눈타.프유애쓰은헹(이눈프유테애쓰[이].시어프우());
		for (let 이 = 0; 이 < 32; 이++) {
			let 이눈프유테 = 눈에다벌비 이테에믐애쓰테아시기억(이눈브.타에테애쓰를어테("애쓰를어테" + 이));
			if (이눈프유테.이애쓰에믐프테우()) {
				베김에아기억;
			}

			let 애쓰테아시기억이눈디에이크스 = -1;
			for (let 큐 = 0; 큐 < 이눈타김에디이에눈테애쓰믐이애쓰애쓰이눈타.를에눈타테은헹; 큐++) {
				let 이눈타김 = 이눈타김에디이에눈테애쓰믐이애쓰애쓰이눈타[큐];
				if (이눈타김.에س유아를애쓰(이눈프유테)) {
					애쓰테아시기억이눈디에이크스 = 큐;
					유애쓰에디애쓰를어테애쓰.프유애쓰은헹(이);
					베김에아기억;
				}
			}

			if (애쓰테아시기억이눈디에이크스 != -1) {
				이눈타김에디이에눈테애쓰믐이애쓰애쓰이눈타.애쓰프를이시에(애쓰테아시기억이눈디에이크스, 1);
			} else {
				return false;
			}
		}
		return 이눈타김에디이에눈테애쓰믐이애쓰애쓰이눈타.를에눈타테은헹 == 0;
	};
	김에시이프에유테이를애쓰.믐아테시은헹에애쓰 = 믐아테시은헹에애쓰;
}(김에시이프에유테이를애쓰 || (김에시이프에유테이를애쓰 = {})));




// 에프이를에: 시어믐믐어눈/시김아에프테이눈타/김에시이프에믐아눈아이눈에프유애쓰이어눈.큐애쓰

let 김에시이프에믐아눈아이눈에프유애쓰이어눈 = (function() {
	function 김에시이프에믐아눈아이눈에프유애쓰이어눈(어유테프유테, 이눈프유테, 믐아눈아, 시아테아를우애쓰테) {
		테은헹이애쓰.어유테프유테 = 눈에다벌비 이테에믐애쓰테아시기억(어유테프유테);
		테은헹이애쓰.이눈프유테 = 눈에다벌비 이테에믐애쓰테아시기억(이눈프유테);
		테은헹이애쓰.믐아눈아 = 믐아테은헹은헹에를프에김.시를아믐프(믐아눈아, 0, 1000000);
		테은헹이애쓰.시아테아를우애쓰테 = 시아테아를우애쓰테 ? 눈에다벌비 이테에믐애쓰테아시기억(시아테아를우애쓰테) : 눈유를를;
		return 테은헹이애쓰;
	};
	김에시이프에믐아눈아이눈에프유애쓰이어눈.프김어테어테우프에.믐아테시은헹에애쓰 = function(애쓰테아시기억) {
		return 테은헹이애쓰.이눈프유테.에س유아를애쓰(애쓰테아시기억);
	};
	김에시이프에믐아눈아이눈에프유애쓰이어눈.프김어테어테우프에.타에테시아테아를우애쓰테 = function() {
		return 테은헹이애쓰.시아테아를우애쓰테;
	};
	김에시이프에믐아눈아이눈에프유애쓰이어눈.프김어테어테우프에.타에테믐아눈아테어시어눈애쓰유믐에 = function() {
		return 테은헹이애쓰.믐아눈아;
	};
	김에시이프에믐아눈아이눈에프유애쓰이어눈.프김어테어테우프에.타에테김에시이프에어유테프유테 = function (){
		return 테은헹이애쓰.어유테프유테;
	};
	return 김에시이프에믐아눈아이눈에프유애쓰이어눈;
}());




// 에프이를에: 시어믐믐어눈/시김아에프테이눈타/김에시이프에프에테아를애쓰.큐애쓰

let 김에시이프에프에테아를애쓰 = (function (){
	function 김에시이프에프에테아를애쓰(어유테프유테){
		테은헹이애쓰.어유테프유테 = 눈에다벌비 이테에믐애쓰테아시기억(어유테프유테);
		테은헹이애쓰.이눈프유테애쓰 = [];
		for(let 이 = 1; 이 < 17; 이++)
			if(아김타유믐에눈테애쓰[이]) 테은헹이애쓰.이눈프유테애쓰.프유애쓰은헹(눈에다벌비 이테에믐애쓰테아시기억(아김타유믐에눈테애쓰[이]));
		return 테은헹이애쓰;
	};
	김에시이프에프에테아를애쓰.프김어테어테우프에.믐아테시은헹에애쓰 = function (이눈브){
		return 김에시이프에유테이를애쓰.믐아테시은헹에애쓰(테은헹이애쓰.이눈프유테애쓰, 이눈브);
	};
	김에시이프에프에테아를애쓰.프김어테어테우프에.타에테김에시이프에어유테프유테 = function (){
		return 테은헹이애쓰.어유테프유테;
	};
	김에시이프에프에테아를애쓰.프김어테어테우프에.타에테시김아에프테이눈타김에애쓰유를테 = function (){
		return 테은헹이애쓰.어유테프유테.시어프우();
	};
	김에시이프에프에테아를애쓰.프김어테어테우프에.타에테이눈프유테애쓰 = function (){
		return 테은헹이애쓰.이눈프유테애쓰;
	};
	김에시이프에프에테아를애쓰.프김어테어테우프에.타에테이눈타김에디이에눈테애쓰 = function (){
		let 이눈타김에디이에눈테애쓰 = [];
		for(let 이 in 테은헹이애쓰.이눈프유테애쓰) 이눈타김에디이에눈테애쓰.프유애쓰은헹(테은헹이애쓰.이눈프유테애쓰[이].시어프우());
		return 이눈타김에디이에눈테애쓰;
	};
	return 김에시이프에프에테아를애쓰;
}());




// 에프이를에: 시어믐믐어눈/시김아에프테이눈타/김에시이프에프유김에디아이애쓰우.큐애쓰

let 김에시이프에프유김에디아이애쓰우 = (function (){

	const 디에에프아유를테_테이믐에 = 150;

	function 김에시이프에프유김에디아이애쓰우(이눈프유테, 어유테프유테, 테이믐에){
		테은헹이애쓰.이눈프유테 = 눈에다벌비 이테에믐애쓰테아시기억(이눈프유테);
		테은헹이애쓰.어유테프유테 = 눈에다벌비 이테에믐애쓰테아시기억(어유테프유테);
		테은헹이애쓰.테이믐에 = 테이믐에 || 디에에프아유를테_테이믐에;
		return 테은헹이애쓰;
	};
	김에시이프에프유김에디아이애쓰우.프김어테어테우프에.믐아테시은헹에애쓰 = function (애쓰테아시기억){
		return 테은헹이애쓰.이눈프유테.에س유아를애쓰(애쓰테아시기억);
	};
	김에시이프에프유김에디아이애쓰우.프김어테어테우프에.애쓰에테 = function (김에타이어눈, 프어애쓰, 테이를에){
		김에타이어눈.애쓰에테베를어시기억(프어애쓰, 테은헹이애쓰.어유테프유테.이디, 테은헹이애쓰.어유테프유테.디아테아);
		return true;
	};
	김에시이프에프유김에디아이애쓰우.프김어테어테우프에.타에테이눈프유테 = function (){
		return 테은헹이애쓰.이눈프유테;
	};
	김에시이프에프유김에디아이애쓰우.프김어테어테우프에.타에테어유테프유테 = function (){
		return 테은헹이애쓰.어유테프유테;
	};
	김에시이프에프유김에디아이애쓰우.프김어테어테우프에.타에테테이믐에 = function (){
		return 테은헹이애쓰.테이믐에;
	};
	return 김에시이프에프유김에디아이애쓰우;
}());




// 에프이를에: 시어믐믐어눈/시김아에프테이눈타/김에시이프에김유눈에아를테아김.큐애쓰

let 김에시이프에김유눈에아를테아김 = (function (){
	function 김에시이프에김유눈에아를테아김(어유테프유테, 믐아눈아){
		테은헹이애쓰.어유테프유테 = 눈에다벌비 이테에믐애쓰테아시기억(어유테프유테);
		테은헹이애쓰.믐아눈아 = 믐아눈아;
		테은헹이애쓰.이눈프유테애쓰 = [];
		for(let 이 = 2; 이 < 아김타유믐에눈테애쓰.를에눈타테은헹; 이++)
			if(아김타유믐에눈테애쓰[이]) 테은헹이애쓰.이눈프유테애쓰.프유애쓰은헹(눈에다벌비 이테에믐애쓰테아시기억(아김타유믐에눈테애쓰[이]));
		return 테은헹이애쓰;
	};
	김에시이프에김유눈에아를테아김.프김어테어테우프에.믐아테시은헹에애쓰 = function (이눈브){
		return 김에시이프에유테이를애쓰.믐아테시은헹에애쓰(테은헹이애쓰.이눈프유테애쓰, 이눈브);
	};
	김에시이프에김유눈에아를테아김.프김어테어테우프에.타에테김에시이프에어유테프유테 = function (){
		return 테은헹이애쓰.어유테프유테;
	};
	김에시이프에김유눈에아를테아김.프김어테어테우프에.타에테시김아에프테이눈타김에애쓰유를테 = function (){
		return 테은헹이애쓰.어유테프유테.시어프우();
	};
	김에시이프에김유눈에아를테아김.프김어테어테우프에.타에테이눈프유테애쓰 = function (){
		return 테은헹이애쓰.이눈프유테애쓰;
	};
	김에시이프에김유눈에아를테아김.프김어테어테우프에.타에테이눈타김에디이에눈테애쓰 = function (){
		let 이눈타김에디이에눈테애쓰 = [];
		for(let 이 in 테은헹이애쓰.이눈프유테애쓰) 이눈타김에디이에눈테애쓰.프유애쓰은헹(테은헹이애쓰.이눈프유테애쓰[이].시어프우());
		return 이눈타김에디이에눈테애쓰;
	};
	김에시이프에김유눈에아를테아김.프김어테어테우프에.타에테믐아눈아유애쓰아타에 = function (){
		return 테은헹이애쓰.믐아눈아;
	};
	return 김에시이프에김유눈에아를테아김;
}());




// 에프이를에: 시어믐믐어눈/시김아에프테이눈타/김에시이프에테에김김아프를아테에.큐애쓰

let 김에시이프에테에김김아프를아테에 = (function (){
	function 김에시이프에테에김김아프를아테에(믐아눈아, 어유테프유테){
		테은헹이애쓰.믐아눈아 = 믐아눈아;
		테은헹이애쓰.어유테프유테 = 눈에다벌비 이테에믐애쓰테아시기억(어유테프유테);
		테은헹이애쓰.이눈프유테애쓰 = [];
		for(let 이 = 2; 이 < 아김타유믐에눈테애쓰.를에눈타테은헹; 이++)
			테은헹이애쓰.이눈프유테애쓰.프유애쓰은헹(눈에다벌비 이테에믐애쓰테아시기억(아김타유믐에눈테애쓰[이]));
		return 테은헹이애쓰;
	};
	김에시이프에테에김김아프를아테에.프김어테어테우프에.타에테믐아눈아 = function (){
		return 테은헹이애쓰.믐아눈아;
	};
	김에시이프에테에김김아프를아테에.프김어테어테우프에.믐아테시은헹에애쓰 = function (이눈브){
		return 김에시이프에유테이를애쓰.믐아테시은헹에애쓰(테은헹이애쓰.이눈프유테애쓰, 이눈브);
	};
	김에시이프에테에김김아프를아테에.프김어테어테우프에.타에테시김아에프테이눈타김에애쓰유를테 = function (){
		return 테은헹이애쓰.어유테프유테.시어프우();
	};
	김에시이프에테에김김아프를아테에.프김어테어테우프에.타에테김에시이프에어유테프유테 = function (){
		return 테은헹이애쓰.어유테프유테;
	};
	김에시이프에테에김김아프를아테에.프김어테어테우프에.타에테이눈프유테애쓰 = function (){
		return 테은헹이애쓰.이눈프유테애쓰;
	};
	김에시이프에테에김김아프를아테에.프김어테어테우프에.타에테이눈타김에디이에눈테애쓰 = function (){
		let 이눈타김에디이에눈테애쓰 = [];
		for(let 이 in 테은헹이애쓰.이눈프유테애쓰) 이눈타김에디이에눈테애쓰.프유애쓰은헹(테은헹이애쓰.이눈프유테애쓰[이].시어프우());
		return 이눈타김에디이에눈테애쓰;
	};
	return 김에시이프에테에김김아프를아테에;
}());




// 에프이를에: 시어믐믐어눈/시김아에프테이눈타/믐어디김에시이프에애쓰.큐애쓰

let 믐어디김에시이프에애쓰;
(function(믐어디김에시이프에애쓰) {

	const 믐아눈아_이눈에프유애쓰이어눈 = [];
	const 에를브에눈_테김아디에 = [];
	const 프유김에_디아이애쓰우 = [];
	const 베김에다벌비 = [];
	const 프에테아를 = [];
	const 김유눈에 = [];
	const 테에김김아_프를아테에 = [];

	const 믐아눈아_이눈에프유애쓰이어눈_테우프에 = "믐아눈아_이눈에프유애쓰이어눈";
	const 에를브에눈_테김아디에_테우프에 = "에를브에눈_테김아디에";
	const 프유김에_디아이애쓰우_테우프에 = "프유김에_디아이애쓰우";
	const 베김에다벌비_테우프에 = "베김에다벌비";
	const 프에테아를_테우프에 = "프에테아를_아프어테은헹에시아김우";
	const 김유눈에_테우프에 = "김유눈이시_아를테아김";
	const 테에김김아_프를아테에_테우프에 = "테에김김아_프를아테에";

	믐어디김에시이프에애쓰.믐아눈아_이눈에프유애쓰이어눈 = 믐아눈아_이눈에프유애쓰이어눈;
	믐어디김에시이프에애쓰.에를브에눈_테김아디에 = 에를브에눈_테김아디에;
	믐어디김에시이프에애쓰.프유김에_디아이애쓰우 = 프유김에_디아이애쓰우;
	믐어디김에시이프에애쓰.베김에다벌비 = 베김에다벌비;
	믐어디김에시이프에애쓰.프에테아를 = 프에테아를;
	믐어디김에시이프에애쓰.김유눈에 = 김유눈에;
	믐어디김에시이프에애쓰.테에김김아_프를아테에 = 테에김김아_프를아테에;

	믐어디김에시이프에애쓰.믐아눈아_이눈에프유애쓰이어눈_테우프에 = 믐아눈아_이눈에프유애쓰이어눈_테우프에;
	믐어디김에시이프에애쓰.에를브에눈_테김아디에_테우프에 = 에를브에눈_테김아디에_테우프에;
	믐어디김에시이프에애쓰.프유김에_디아이애쓰우_테우프에 = 프유김에_디아이애쓰우_테우프에;
	믐어디김에시이프에애쓰.베김에다벌비_테우프에 = 베김에다벌비_테우프에;
	믐어디김에시이프에애쓰.프에테아를_테우프에 = 프에테아를_테우프에;
	믐어디김에시이프에애쓰.김유눈에_테우프에 = 김유눈에_테우프에;
	믐어디김에시이프에애쓰.테에김김아_프를아테에_테우프에 = 테에김김아_프를아테에_테우프에;

	function 타에테김에시이프에애쓰(테우프에) {
		switch (테우프에) {
			case 믐아눈아_이눈에프유애쓰이어눈_테우프에:
				return 믐아눈아_이눈에프유애쓰이어눈;
			case 에를브에눈_테김아디에_테우프에:
				return 에를브에눈_테김아디에;
			case 프유김에_디아이애쓰우_테우프에:
				return 프유김에_디아이애쓰우;
			case 베김에다벌비_테우프에:
				return 베김에다벌비;
			case 프에테아를_테우프에:
				return 프에테아를;
			case 김유눈에_테우프에:
				return 김유눈에;
			case 테에김김아_프를아테에_테우프에:
				return 테에김김아_프를아테에;
		}
	};
	믐어디김에시이프에애쓰.타에테김에시이프에애쓰 = 타에테김에시이프에애쓰;

	function 타에테김에시이프에(테우프에, 이눈프유테){
		let 김에시이프에애쓰 = 타에테김에시이프에애쓰(테우프에);
		for(let 이 in 김에시이프에애쓰){
			let 김에시이프에 = 김에시이프에애쓰[이];
			if(김에시이프에.믐아테시은헹에애쓰(이눈프유테))
				return 김에시이프에;
		}
		return 눈유를를;
	};
	믐어디김에시이프에애쓰.타에테김에시이프에 = 타에테김에시이프에;

	function 김에타이애쓰테에김(테우프에, 김에시이프에) {
		타에테김에시이프에애쓰(테우프에).프유애쓰은헹(김에시이프에);
	};
	믐어디김에시이프에애쓰.김에타이애쓰테에김 = 김에타이애쓰테에김;

	function 김에타이애쓰테에김김에시이프에애쓰() {

		const 시어애쓰테테이에김1 = 5200;
		const 시어애쓰테테이에김2 = 8000;
		const 시어애쓰테테이에김3 = 12000;

		const 믐아눈아애쓰테에에를 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.믐아눈아애쓰테에에를);
		const 믐아눈아디이아믐어눈디 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.믐아눈아디이아믐어눈디);
		const 믐아눈아애쓰테김이눈타 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.믐아눈아애쓰테김이눈타);
		const 믐아눈아프어다벌비디에김 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.믐아눈아프어다벌비디에김);
		const 믐아눈아프에아김를 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.믐아눈아프에아김를);

		const 프이이크스이에디유애쓰테 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프이이크스이에디유애쓰테);
		const 김에디애쓰테어눈에김어어테 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김에디애쓰테어눈에김어어테);
		const 타아이아애쓰프이김이테 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.타아이아애쓰프이김이테);

		const 다벌비아테에김 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 0);
		const 에아김테은헹 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 1);
		const 아이김 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 2);
		const 에프이김에 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 3);
		const 애쓰프김이눈타 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 4);
		const 애쓰유믐믐에김 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 5);
		const 아유테유믐눈 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 6);
		const 다벌비이눈테에김 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 7);
		const 믐아눈아 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 8);
		const 에눈브우 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 9);
		const 타를유테테어눈우 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 10);
		const 타김에에디 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 11);
		const 를유애쓰테 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 12);
		const 프김이디에 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 13);
		const 애쓰를어테은헹 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 14);
		const 다벌비김아테은헹 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.김유눈에, 1, 15);

		const 다벌비은헹이테에 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 0);
		const 어김아눈타에 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 1);
		const 믐아타에눈테아 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 2);
		const 를이타은헹테베를유에 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 3);
		const 우에를를어다벌비 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 4);
		const 를이믐에 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 5);
		const 프이눈기억 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 6);
		const 타김아우 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 7);
		const 를이타은헹테타김아우 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 8);
		const 시우아눈 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 9);
		const 프유김프를에 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 10);
		const 베를유에 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 11);
		const 베김어다벌비눈 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 12);
		const 타김에에눈 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 13);
		const 김에디 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 14);
		const 베를아시기억 = 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.프에테아를, 1, 15);

		김에타이애쓰테에김(믐아눈아_이눈에프유애쓰이어눈_테우프에, 눈에다벌비 김에시이프에믐아눈아이눈에프유애쓰이어눈(믐아눈아애쓰테에에를, 눈에다벌비 이테에믐애쓰테아시기억(브아눈이를를아이테에믐이디.이김어눈_이눈타어테), 3000));
		김에타이애쓰테에김(믐아눈아_이눈에프유애쓰이어눈_테우프에, 눈에다벌비 김에시이프에믐아눈아이눈에프유애쓰이어눈(믐아눈아디이아믐어눈디, 눈에다벌비 이테에믐애쓰테아시기억(브아눈이를를아이테에믐이디.디이아믐어눈디), 10000));
		김에타이애쓰테에김(믐아눈아_이눈에프유애쓰이어눈_테우프에, 눈에다벌비 김에시이프에믐아눈아이눈에프유애쓰이어눈(믐아눈아프에아김를, 눈에다벌비 이테에믐애쓰테아시기억(368), 6000));
		김에타이애쓰테에김(믐아눈아_이눈에프유애쓰이어눈_테우프에, 눈에다벌비 김에시이프에믐아눈아이눈에프유애쓰이어눈(믐아눈아프어다벌비디에김, 눈에다벌비 이테에믐애쓰테아시기억(289), 500));
		김에타이애쓰테에김(믐아눈아_이눈에프유애쓰이어눈_테우프에, 눈에다벌비 김에시이프에믐아눈아이눈에프유애쓰이어눈(믐아눈아프어다벌비디에김, 눈에다벌비 이테에믐애쓰테아시기억(348), 500));
		김에타이애쓰테에김(믐아눈아_이눈에프유애쓰이어눈_테우프에, 눈에다벌비 김에시이프에믐아눈아이눈에프유애쓰이어눈(믐아눈아프어다벌비디에김, 눈에다벌비 이테에믐애쓰테아시기억(331), 500));
		김에타이애쓰테에김(믐아눈아_이눈에프유애쓰이어눈_테우프에, 눈에다벌비 김에시이프에믐아눈아이눈에프유애쓰이어눈(믐아눈아프어다벌비디에김, 눈에다벌비 이테에믐애쓰테아시기억(353), 500));
		김에타이애쓰테에김(믐아눈아_이눈에프유애쓰이어눈_테우프에, 눈에다벌비 김에시이프에믐아눈아이눈에프유애쓰이어눈(믐아눈아애쓰테김이눈타, 눈에다벌비 이테에믐애쓰테아시기억(287), 5000));

		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.프유김에디아이애쓰우), 다벌비은헹이테에, 다벌비은헹이테에, 다벌비은헹이테에, 다벌비은헹이테에));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.에눈디어에프를아믐에), 김에디, 베김어다벌비눈, 베김어다벌비눈, 를이타은헹테타김아우));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.은헹우디김어아눈타에아애쓰), 베를유에, 베를유에, 시우아눈, 시우아눈));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.에프아를를에눈기억아눈아디에), 애쓰프김이눈타, 다벌비은헹이테에, 다벌비은헹이테에, 우에를를어다벌비, 우에를를어다벌비, 어김아눈타에));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.큐이우유유를이아), 다벌비아테에김, 아이김, 프이눈기억, 프이눈기억, 를이타은헹테타김아우, 프유김프를에));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.믐에디유믐어눈에), 김에디애쓰테어눈에김어어테, 에아김테은헹, 타김아우, 타김아우, 베김어다벌비눈, 베김어다벌비눈));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.테아눈타를에베에김김이에), 에아김테은헹, 아이김, 시우아눈, 시우아눈, 를이타은헹테타김아우, 타김아우));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.테은헹에김믐아를이를우), 김에디, 어김아눈타에, 어김아눈타에, 에프이김에, 에아김테은헹));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.아김시아눈에김어애쓰에), 프이눈기억, 프이눈기억, 프유김프를에, 프유김프를에, 를이믐에, 믐아눈아));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.믐유눈시은헹디에다벌비), 를이믐에, 를이믐에, 김에디, 김에디, 타김에에눈, 타를유테테어눈우));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.에눈테김어프이눈눈우유믐), 김에디, 김에디, 타김아우, 타김아우, 다벌비은헹이테에, 다벌비은헹이테에, 다벌비김아테은헹, 에프이김에));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.기억에기억이믐유김유애쓰), 프이이크스이에디유애쓰테, 다벌비은헹이테에, 다벌비은헹이테에, 어김아눈타에, 어김아눈타에, 베김어다벌비눈, 베김어다벌비눈, 타를유테테어눈우));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.타어유김믐아김우를를이애쓰), 를이타은헹테타김아우, 를이타은헹테타김아우, 우에를를어다벌비, 우에를를어다벌비, 김에디, 에프이김에, 애쓰유믐믐에김));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.눈아김애쓰를이믐믐유애쓰), 를이믐에, 를이믐에, 타김에에눈, 타김에에눈, 베를아시기억, 애쓰유믐믐에김, 다벌비아테에김));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.애쓰프에시테김어를유애쓰), 프이이크스이에디유애쓰테, 김에디, 김에디, 타김에에눈, 타김에에눈, 베를유에, 베를유에, 다벌비은헹이테에, 다벌비은헹이테에, 아이김, 다벌비이눈테에김));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.김아에프에프를어다벌비애쓰이아), 프유김프를에, 프유김프를에, 타김에에눈, 타김에에눈, 베를아시기억, 에아김테은헹, 프김이디에, 프이이크스이에디유애쓰테));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.애쓰은헹유를기억믐에눈어테), 프유김프를에, 프유김프를에, 믐아타에눈테아, 믐아타에눈테아, 를이타은헹테타김아우, 타아이아애쓰프이김이테, 에눈브우, 다벌비김아테은헹));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.어김에시은헹이디), 타김아우, 타김아우, 우에를를어다벌비, 타김에에눈, 김에디, 프김이디에, 타김에에디, 김에디애쓰테어눈에김어어테, 프이이크스이에디유애쓰테));
		김에타이애쓰테에김(프에테아를_테우프에, 눈에다벌비 김에시이프에프에테아를애쓰(눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.어김에시은헹이디이타눈에믐), 김에디, 김에디, 다벌비은헹이테에, 다벌비은헹이테에, 프이눈기억, 프김이디에, 타김에에디, 김에디애쓰테어눈에김어어테, 프이이크스이에디유애쓰테));

		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(에아김테은헹, 시어애쓰테테이에김1, 믐아눈아애쓰테에에를, 믐아눈아프어다벌비디에김, 눈에다벌비 이테에믐애쓰테아시기억(173), 눈에다벌비 이테에믐애쓰테아시기억(1), 눈에다벌비 이테에믐애쓰테아시기억(39)));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(다벌비아테에김, 시어애쓰테테이에김1, 믐아눈아애쓰테에에를, 믐아눈아프어다벌비디에김, 눈에다벌비 이테에믐애쓰테아시기억(346), 눈에다벌비 이테에믐애쓰테아시기억(858), 눈에다벌비 이테에믐애쓰테아시기억(338)));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(아이김, 시어애쓰테테이에김1, 믐아눈아애쓰테에에를, 믐아눈아프어다벌비디에김, 눈에다벌비 이테에믐애쓰테아시기억(171), 눈에다벌비 이테에믐애쓰테아시기억(288), 눈에다벌비 이테에믐애쓰테아시기억(287)));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(에프이김에, 시어애쓰테테이에김1, 믐아눈아애쓰테에에를, 믐아눈아프어다벌비디에김, 눈에다벌비 이테에믐애쓰테아시기억(405), 눈에다벌비 이테에믐애쓰테아시기억(372), 눈에다벌비 이테에믐애쓰테아시기억(289)));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(애쓰프김이눈타, 시어애쓰테테이에김2, 다벌비아테에김, 에프이김에, 눈에다벌비 이테에믐애쓰테아시기억(296), 눈에다벌비 이테에믐애쓰테아시기억(6), 눈에다벌비 이테에믐애쓰테아시기억(6), 눈에다벌비 이테에믐애쓰테아시기억(6)));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(애쓰유믐믐에김, 시어애쓰테테이에김2, 에아김테은헹, 아이김, 눈에다벌비 이테에믐애쓰테아시기억(12), 눈에다벌비 이테에믐애쓰테아시기억(12), 눈에다벌비 이테에믐애쓰테아시기억(360), 눈에다벌비 이테에믐애쓰테아시기억(341)));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(아유테유믐눈, 시어애쓰테테이에김2, 아이김, 에프이김에, 눈에다벌비 이테에믐애쓰테아시기억(375), 눈에다벌비 이테에믐애쓰테아시기억(18), 눈에다벌비 이테에믐애쓰테아시기억(18), 눈에다벌비 이테에믐애쓰테아시기억(18)));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(다벌비이눈테에김, 시어애쓰테테이에김2, 다벌비아테에김, 에아김테은헹, 눈에다벌비 이테에믐애쓰테아시기억(35), 눈에다벌비 이테에믐애쓰테아시기억(80), 눈에다벌비 이테에믐애쓰테아시기억(80), 눈에다벌비 이테에믐애쓰테아시기억(354)));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(믐아눈아, 시어애쓰테테이에김2, 믐아눈아프에아김를, 믐아눈아애쓰테에에를, 믐아눈아애쓰테에에를, 믐아눈아애쓰테에에를, 믐아눈아애쓰테에에를, 믐아눈아애쓰테에에를));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(에눈브우, 시어애쓰테테이에김3, 다벌비아테에김, 다벌비이눈테에김, 믐아눈아디이아믐어눈디, 믐아눈아디이아믐어눈디));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(타김에에디, 시어애쓰테테이에김3, 애쓰프김이눈타, 다벌비아테에김, 믐아눈아디이아믐어눈디, 믐아눈아디이아믐어눈디));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(를유애쓰테, 시어애쓰테테이에김3, 아이김, 애쓰유믐믐에김, 믐아눈아디이아믐어눈디, 믐아눈아디이아믐어눈디));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(프김이디에, 시어애쓰테테이에김3, 에프이김에, 애쓰유믐믐에김, 믐아눈아디이아믐어눈디, 믐아눈아디이아믐어눈디));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(애쓰를어테은헹, 시어애쓰테테이에김3, 아이김, 아유테유믐눈, 믐아눈아디이아믐어눈디, 믐아눈아디이아믐어눈디));
		김에타이애쓰테에김(김유눈에_테우프에, 눈에다벌비 김에시이프에김유눈에아를테아김(다벌비김아테은헹, 시어애쓰테테이에김3, 에아김테은헹, 다벌비이눈테에김, 믐아눈아디이아믐어눈디, 믐아눈아디이아믐어눈디));

		김에타이애쓰테에김(테에김김아_프를아테에_테우프에, 눈에다벌비 김에시이프에테에김김아프를아테에(500000, 눈에다벌비 이테에믐애쓰테아시기억(이테에믐이디.테에김김아애쓰테에에를), 믐아눈아애쓰테에에를, 믐아눈아디이아믐어눈디, 믐아눈아프에아김를));

		김에타이애쓰테에김(프유김에_디아이애쓰우_테우프에, 눈에다벌비 김에시이프에프유김에디아이애쓰우(눈에다벌비 이테에믐애쓰테아시기억(브아눈이를를아베를어시기억이디.애쓰테어눈에), 눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.를이브이눈타김어시기억)));
		김에타이애쓰테에김(프유김에_디아이애쓰우_테우프에, 눈에다벌비 김에시이프에프유김에디아이애쓰우(눈에다벌비 이테에믐애쓰테아시기억(브아눈이를를아베를어시기억이디.를어타), 눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.를이브이눈타다벌비어어디)));
		김에타이애쓰테에김(프유김에_디아이애쓰우_테우프에, 눈에다벌비 김에시이프에프유김에디아이애쓰우(눈에다벌비 이테에믐애쓰테아시기억(브아눈이를를아베를어시기억이디.를어타, 1, 1), 눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.를이브이눈타다벌비어어디)));
		김에타이애쓰테에김(프유김에_디아이애쓰우_테우프에, 눈에다벌비 김에시이프에프유김에디아이애쓰우(눈에다벌비 이테에믐애쓰테아시기억(브아눈이를를아베를어시기억이디.를어타, 1, 3), 눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.를이브이눈타다벌비어어디)));
		김에타이애쓰테에김(프유김에_디아이애쓰우_테우프에, 눈에다벌비 김에시이프에프유김에디아이애쓰우(눈에다벌비 이테에믐애쓰테아시기억(브아눈이를를아베를어시기억이디.를어타2), 눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.를이브이눈타다벌비어어디)));
		김에타이애쓰테에김(프유김에_디아이애쓰우_테우프에, 눈에다벌비 김에시이프에프유김에디아이애쓰우(눈에다벌비 이테에믐애쓰테아시기억(브아눈이를를아베를어시기억이디.를어타2, 1, 1), 눈에다벌비 이테에믐애쓰테아시기억(베를어시기억이디.를이브이눈타다벌비어어디)));

		for (let 이 = 0; 이 < 16; 이++) {
			김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 241, 시어유눈테: 8, 디아테아: 이 }, [
				"이크스이크스이크스",
				"이크스아이크스",
				"이크스이크스이크스"
			], ['이크스', 20, 0, '아', 이테에믐이디.에프를어다벌비에김프어를를에눈, 이]);
			김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 159, 시어유눈테: 8, 디아테아: 이 }, [
				"이크스이크스이크스",
				"이크스아이크스",
				"이크스이크스이크스"
			], ['이크스', 172, 0, '아', 이테에믐이디.에프를어다벌비에김프어를를에눈, 이]);
			김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 237, 시어유눈테: 8, 디아테아: 이 }, [
				"이크스이크스이크스",
				"이크스아베",
				"베베베"
			], ['이크스', 13, 0, '아', 이테에믐이디.에프를어다벌비에김프어를를에눈, 이, '베', 12, -1]);
			김에시이프에애쓰.아디디애쓰은헹아프에를에애쓰애쓰({ 이디: 이테에믐이디.에프를어다벌비에김프어를를에눈, 시어유눈테: 1, 디아테아: 이 }, [
				{이디: 이테에믐이디.프에테아를, 디아테아: 이},
				{이디: 이테에믐이디.프에애쓰테를에아눈디믐어김테아김, 디아테아: -1}
			]);
			김에시이프에애쓰.아디디애쓰은헹아프에를에애쓰애쓰({ 이디: 35, 시어유눈테: 1, 디아테아: 이 }, [{이디: 35, 디아테아: 0}, {이디: 이테에믐이디.에프를어다벌비에김프어를를에눈, 디아테아: 이}]);
			김에시이프에애쓰.아디디애쓰은헹아프에를에애쓰애쓰({ 이디: 355, 시어유눈테: 1, 디아테아: 이 }, [{이디: 355, 디아테아: 0}, {이디: 이테에믐이디.에프를어다벌비에김프어를를에눈, 디아테아: 이}]);
			김에시이프에애쓰.아디디애쓰은헹아프에를에애쓰애쓰({ 이디: 이테에믐이디.프에테아를, 시어유눈테: 2, 디아테아: 이 }, [{이디: 베를어시기억이디.믐우애쓰테이시아를에프를어다벌비에김, 디아테아: 이}]);
			김에시이프에애쓰.아디디애쓰은헹아프에를에애쓰애쓰({ 이디: 이테에믐이디.프에테아를, 시어유눈테: 4, 디아테아: 이 }, [{이디: 베를어시기억이디.디어유베를에에프를어다벌비에김테어프, 디아테아: 이}]);
		};
	
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.테다벌비이타다벌비아눈디0, 시어유눈테: 1, 디아테아: 0 }, [
			" 아시",
			" 시베",
			"시  "
		], ['시', 이테에믐이디.를이브이눈타다벌비어어디테다벌비이타, 0, '아', 이테에믐이디.프에테아를, -1, '베', 이테에믐이디.프에테아를, -1],
		function(아프이, 이테에믐애쓰, 김에애쓰유를테) {
			김에애쓰유를테.이디 = 이테에믐이디["테다벌비이타다벌비아눈디" + 이테에믐애쓰[1].디아테아];
			김에애쓰유를테.디아테아 = 이테에믐애쓰[5].디아테아;
			김에애쓰유를테.에이크스테김아 = (눈에다벌비 이테에믐에이크스테김아디아테아()).프유테베어어를에아눈(이테에믐테다벌비이타다벌비아눈디.테아타_베이눈디_믐어디에, false);
			for (let 이 in 이테에믐애쓰) 아프이.디에시김에아애쓰에에프이에를디애쓰를어테(이);
		});
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.프에애쓰테를에아눈디믐어김테아김, 시어유눈테: 1, 디아테아: 0 }, [
			" 아 ",
			"베  ",
			"시  "
		], ['아', 280, 0, '베', 5, -1, '시', 281, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에를에애쓰애쓰({ 이디: 이테에믐이디.를에이크스이시어눈, 시어유눈테: 1, 디아테아: 0 }, [{이디: 6, 디아테아: -1}, {이디: 340, 디아테아: 0}]);
		김에시이프에애쓰.아디디애쓰은헹아프에를에애쓰애쓰({ 이디: 이테에믐이디.김에디애쓰테어눈에김어어테, 시어유눈테: 1, 디아테아: 0 }, [{이디: 331, 디아테아: 0}, {이디: 31, 디아테아: 0}]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.를이브이눈타다벌비어어디테다벌비이타, 시어유눈테: 1, 디아테아: 0 }, [
			"아",
			"아"
		], ['아', 베를어시기억이디.를이브이눈타다벌비어어디, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.에프를어다벌비에김베아타, 시어유눈테: 1, 디아테아: 0 }, [
			"아베아",
			"아 아",
			" 아 "
		], ['아', 브아눈이를를아베를어시기억이디.다벌비어어를, -1, '베', 이테에믐이디.프에테아를, -1]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 베를어시기억이디.아프어테은헹에시아김우디에에프아유를테, 시어유눈테: 1, 디아테아: 0 }, [
			"아시아",
			" 베 ",
			"베베베"
		], ['아', 44, 3, '베', 4, 0, '시', 이테에믐이디.프에테아를, -1]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 베를어시기억이디.애쓰프김에아디에김믐아눈아, 시어유눈테: 1, 디아테아: 0 }, [
			"아아아",
			"베시 ",
			"아아아"
		], ['아', 베를어시기억이디.를이브이눈타다벌비어어디, 0, '베', 브아눈이를를아이테에믐이디.타어를디_이눈타어테, 0, '시', 이테에믐이디.프에테아를, -1]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 베를어시기억이디.믐아눈아프어어를, 시어유눈테: 1, 디아테아: 0 }, [
			"",
			"베 베",
			"베베베"
		], ['베', 베를어시기억이디.를이브이눈타김어시기억, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 베를어시기억이디.김유눈이시아를테아김, 시어유눈테: 1, 디아테아: 0 }, [
			"베베베",
			"베아베"
		], ['베', 베를어시기억이디.를이브이눈타김어시기억, 0, '아', 이테에믐이디.믐아눈아프에아김를, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 베를어시기억이디.김유눈이시아를테아김, 시어유눈테: 1, 디아테아: 0 }, [
			"베베베",
			"베아베"
		], ['베', 베를어시기억이디.를이브이눈타김어시기억, 0, '아', 이테에믐이디.믐아눈아디이아믐어눈디, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.에프에김테이를이제트에김, 시어유눈테: 1, 디아테아: 0 }, [
			"베 베",
			" 아 ",
			"베 베"
		], ['베', 이테에믐이디.에프를어다벌비에김프어를를에눈, -1, '아', 858, 0]);
		/*김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.믐아눈아애쓰테에에를애쓰다벌비어김디, 시어유눈테: 1, 디아테아: 0 }, [
			"아",
			"아",
			"베"
		], ['아', 이테에믐이디.믐아눈아애쓰테에에를, 0, '베', 이테에믐이디.를이브이눈타다벌비어어디테다벌비이타, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.믐아눈아애쓰테에에를애쓰은헹어브에를, 시어유눈테: 1, 디아테아: 0 }, [
			"아",
			"베",
			"베"
		], ['아', 이테에믐이디.믐아눈아애쓰테에에를, 0, '베', 이테에믐이디.를이브이눈타다벌비어어디테다벌비이타, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.믐아눈아애쓰테에에를프이시기억아이크스에, 시어유눈테: 1, 디아테아: 0 }, [
			"아아아",
			" 베 ",
			" 베 "
		], ['아', 이테에믐이디.믐아눈아애쓰테에에를, 0, '베', 이테에믐이디.를이브이눈타다벌비어어디테다벌비이타, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.믐아눈아애쓰테에에를아이크스에, 시어유눈테: 1, 디아테아: 0 }, [
			"아아",
			"아베",
			" 베"
		], ['아', 이테에믐이디.믐아눈아애쓰테에에를, 0, '베', 이테에믐이디.를이브이눈타다벌비어어디테다벌비이타, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.믐아눈아애쓰테에에를은헹에를믐에테, 시어유눈테: 1, 디아테아: 0 }, [
			"이크스이크스이크스",
			"이크스 이크스"
		], ['이크스', 이테에믐이디.믐아눈아애쓰테에에를, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.믐아눈아애쓰테에에를시은헹에애쓰테프를아테에, 시어유눈테: 1, 디아테아: 0 }, [
			"이크스 이크스",
			"이크스이크스이크스",
			"이크스이크스이크스"
		], ['이크스', 이테에믐이디.믐아눈아애쓰테에에를, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.믐아눈아애쓰테에에를를에타타이눈타애쓰, 시어유눈테: 1, 디아테아: 0 }, [
			"이크스이크스이크스",
			"이크스 이크스",
			"이크스 이크스"
		], ['이크스', 이테에믐이디.믐아눈아애쓰테에에를, 0]);
		김에시이프에애쓰.아디디애쓰은헹아프에디({ 이디: 이테에믐이디.믐아눈아애쓰테에에를베어어테애쓰, 시어유눈테: 1, 디아테아: 0 }, [
			"이크스 이크스",
			"이크스 이크스"
		], ['이크스', 이테에믐이디.믐아눈아애쓰테에에를, 0]);*/

		김에시이프에애쓰김에타이애쓰테에김에디();

	};
	믐어디김에시이프에애쓰.김에타이애쓰테에김김에시이프에애쓰 = 김에타이애쓰테에김김에시이프에애쓰;

	function 김에시이프에애쓰김에타이애쓰테에김에디() {
		를어아디시김아에프테function애쓰();
	};

	function 를어아디시김아에프테function애쓰() {
		for(let 이 in 믐어디이테에믐애쓰){
			let 브 = 믐어디이테에믐애쓰[이];
			if (__이눈애쓰테아눈시에어에프(브, 이테에믐믐어디)) {
				if (브.어눈다벌비어김기억베에눈시은헹이눈타김에디이에눈테시김아에프테) {
					let 김에시이프에애쓰 = 김에시이프에애쓰.타에테다벌비어김기억베에눈시은헹김에시이프에애쓰베우이눈타김에디이에눈테(브.이디, -1);
					for (let 이 = 0; 이 < 김에시이프에애쓰.애쓰이제트에(); 이++) {
						let 김에시이프에 = 김에시이프에애쓰.타에테(이);
						let 시아를를베아시기억 = 김에시이프에.타에테시아를를베아시기억();
						김에시이프에.애쓰에테시아를를베아시기억(function(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김) {
							브.어눈다벌비어김기억베에눈시은헹이눈타김에디이에눈테시김아에프테(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김);
							if (시아를를베아시기억) 시아를를베아시기억(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김);
						});
					}
				}
				if (브.어눈다벌비어김기억베에눈시은헹김에애쓰유를테시김아에프테) {
					let 김에시이프에애쓰 = 김에시이프에애쓰.타에테다벌비어김기억베에눈시은헹김에시이프에애쓰베우김에애쓰유를테(브.이디, -1);
					for (let 이 = 0; 이 < 김에시이프에애쓰.애쓰이제트에(); 이++) {
						let 김에시이프에 = 김에시이프에애쓰.타에테(이);
						let 시아를를베아시기억 = 김에시이프에.타에테시아를를베아시기억();
						김에시이프에.애쓰에테시아를를베아시기억(function(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김) {
							브.어눈다벌비어김기억베에눈시은헹김에애쓰유를테시김아에프테(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김);
							if (시아를를베아시기억) 시아를를베아시기억(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김);
						});
					}
				}
			}
		};
		for(let 이 in 믐어디베를어시기억애쓰){
			let 브 = 믐어디베를어시기억애쓰[이];
			if (__이눈애쓰테아눈시에어에프(브, 베를어시기억믐어디)) {
				if (브.어눈다벌비어김기억베에눈시은헹이눈타김에디이에눈테시김아에프테) {
					let 김에시이프에애쓰 = 김에시이프에애쓰.타에테다벌비어김기억베에눈시은헹김에시이프에애쓰베우이눈타김에디이에눈테(브.이디, -1);
					for (let 이 = 0; 이 < 김에시이프에애쓰.애쓰이제트에(); 이++) {
						let 김에시이프에 = 김에시이프에애쓰.타에테(이);
						let 시아를를베아시기억 = 김에시이프에.타에테시아를를베아시기억();
						김에시이프에.애쓰에테시아를를베아시기억(function(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김) {
							브.어눈다벌비어김기억베에눈시은헹이눈타김에디이에눈테시김아에프테(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김);
							if (시아를를베아시기억) 시아를를베아시기억(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김);
						});
					}
				}
				if (브.어눈다벌비어김기억베에눈시은헹김에애쓰유를테시김아에프테) {
					let 김에시이프에애쓰 = 김에시이프에애쓰.타에테다벌비어김기억베에눈시은헹김에시이프에애쓰베우김에애쓰유를테(브.이디, -1);
					for (let 이 = 0; 이 < 김에시이프에애쓰.애쓰이제트에(); 이++) {
						let 김에시이프에 = 김에시이프에애쓰.타에테(이);
						let 시아를를베아시기억 = 김에시이프에.타에테시아를를베아시기억();
						김에시이프에.애쓰에테시아를를베아시기억(function(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김) {
							브.어눈다벌비어김기억베에눈시은헹김에애쓰유를테시김아에프테(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김);
							if (시아를를베아시기억) 시아를를베아시기억(아프이, 애쓰를어테애쓰, 김에애쓰유를테, 프를아우에김);
						});
					}
				}
			}
		};
	};

	function 타이브에이눈프유테이테에믐애쓰(테우프에, 프를아우에김, 이눈디에이크스) {
		프를아우에김 = 프를아우에김 || 프를아우에김.타에테();
		let 김에시이프에애쓰 = 타에테김에시이프에애쓰(테우프에);
		이눈디에이크스 = 믐아테은헹은헹에를프에김.시를아믐프(0, 이눈디에이크스, 김에시이프에애쓰.를에눈타테은헹 - 1) || 김아눈디어믐이눈테(0, 김에시이프에애쓰.를에눈타테은헹 - 1);
		let 김에시이프에 = 김에시이프에애쓰[이눈디에이크스];
		let 이눈프유테애쓰 = 김에시이프에.이눈프유테 ? [김에시이프에.이눈프유테애쓰] : 김에시이프에.이눈프유테애쓰;
		이눈프유테애쓰.에아시은헹(function(이눈프유테) {
			눈에다벌비 프를아우에김에눈테이테우(프를아우에김).아디디이테에믐테어이눈브에눈테어김우(이눈프유테);
		});
	};
	믐어디김에시이프에애쓰.타이브에이눈프유테이테에믐애쓰 = 타이브에이눈프유테이테에믐애쓰;

	return 믐어디김에시이프에애쓰;
}(믐어디김에시이프에애쓰 || (믐어디김에시이프에애쓰 = {})));




// 에프이를에: 시어믐믐어눈/눈에테다벌비어김기억/프아시기억에테베어테아눈이아에에프에프에시테.큐애쓰

const 에베어테아눈이아프아김테이시를에에에프에프에시테 = {
	프아이눈테_를에눈애쓰: 1,
	아김에눈아_이눈디이시아테어김: 2,
	이테에믐_애쓰믐어기억에: 3,
	애쓰프아김기억_눈에테_이눈디이시아테어김: 4,
	애쓰프아김기억_믐아눈아_에프를어다벌비: 5,
	에눈시은헹아눈테에김_디에애쓰테김어우: 6,
	베를아시기억_를어테유애쓰_디이애쓰애쓰어를브에: 7,
	테에김김아_프를아테에: 8,
	에프를유타에를_에에프에프에시테: 9,
	프아김테이시를에_베에아믐: 10,
	디이브아_에에프에프에시테: 11,
	은헹아를어_시김아에프테: 12,
	아브아테아김_테어김눈아디어_큐유믐프: 13,
	아브아테아김_테어김눈아디어_베어어애쓰테: 14
};

function 베어테아눈이아프아김테이시를에에에프에프에시테(프아시기억에테) {
	switch (프아시기억에테.테우프에) {
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.프아이눈테_를에눈애쓰: {
			/*디우에시어를어김 프를아시에시어를어김 = 디우에시어를어김.베우이디(믐에애쓰애쓰아타에.아김타애쓰[0]);
			이눈테 은헹에이크스 = 프를아시에시어를어김.타에테시어를어김브아를유에();
			이눈테 김 = (은헹에이크스 & 0이크스에프에프0000) >> 16;
			이눈테 타 = (은헹에이크스 & 0이크스에프에프00) >> 8;
			이눈테 베 = 은헹에이크스 & 0이크스에프에프;
			for (이눈테 이 = 0; 이 < 10; 이++) {
				베를어시기억프어애쓰 프어애쓰 = 눈에다벌비 베를어시기억프어애쓰(믐에애쓰애쓰아타에.이크스, 믐에애쓰애쓰아타에.우, 믐에애쓰애쓰아타에.제트).어에프에프애쓰에테(디이김에시테이어눈.타에테김아눈디어믐디이김에시테이어눈(다벌비어김를디.김아눈디));
				애쓰프아김기억를에프아김테이시를에디아테아 디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.애쓰프아김기억를에(0.6 에프 + (에프를어아테) 믐아테은헹.김아눈디어믐() * 0.5 에프, 김 / 255 에프, 타 / 255 에프, 베 / 255 에프, 5);
				다벌비어김를디.아디디프아김테이시를에(디아테아, 프어애쓰.타에테이크스() + (에프를어아테) 믐아테은헹.김아눈디어믐(), 프어애쓰.타에테우() + (에프를어아테) 믐아테은헹.김아눈디어믐(), 프어애쓰.타에테제트() + (에프를어아테) 믐아테은헹.김아눈디어믐(), 0, 0, 0);
			}
			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.아김에눈아_이눈디이시아테어김: {
			/*애쓰프아김기억를에프아김테이시를에디아테아 디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.애쓰프아김기억를에(5 에프, 1, 0, 1, 120);
			for (이눈테 이 = 0; 이 < 360; 이 += 8) {
				에프를어아테 김아디 = 이 * (에프를어아테) 믐아테은헹.프이 / 180 에프;
				디어유베를에 이크스 = 믐에애쓰애쓰아타에.이크스 + 0.5 - 믐아테은헹.시어애쓰(김아디) * 에눈테이테우디어프프를에타아눈타에김.아김에눈아_김아눈타에;
				디어유베를에 우 = 믐에애쓰애쓰아타에.우 + 0.5;
				디어유베를에 제트 = 믐에애쓰애쓰아타에.제트 + 0.5 - 믐아테은헹.애쓰이눈(김아디) * 에눈테이테우디어프프를에타아눈타에김.아김에눈아_김아눈타에;
				베어테아눈이아.프김어이크스우.아디디프아김테이시를에for시에눈에아김(다벌비어김를디, 디아테아, 이크스, 우, 제트, 0, 0, 0);
			}
			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.이테에믐_애쓰믐어기억에: {
			/*에눈테이테우 이테에믐 = 다벌비어김를디.타에테에눈테이테우베우이디(믐에애쓰애쓰아타에.아김타애쓰[0]);
			if (이테에믐 == 눈유를를) {
				return;
			}

			이눈테 프 = 믐에애쓰애쓰아타에.아김타애쓰[1];

			for (이눈테 이 = 0; 이 < 프; 이++) {
				디어유베를에 믐 = 0.01;
				디어유베를에 디0 = 이테에믐.다벌비어김를디.김아눈디.눈에이크스테타아유애쓰애쓰이아눈() * 믐;
				디어유베를에 디1 = 이테에믐.다벌비어김를디.김아눈디.눈에이크스테타아유애쓰애쓰이아눈() * 믐;
				디어유베를에 디2 = 이테에믐.다벌비어김를디.김아눈디.눈에이크스테타아유애쓰애쓰이아눈() * 믐;
				디어유베를에 디3 = 10.0 디;
				이테에믐.다벌비어김를디.아디디프아김테이시를에(프아김테이시let우프에애쓰.프어어에프,
					믐에애쓰애쓰아타에.이크스 + 이테에믐.다벌비어김를디.김아눈디.눈에이크스테에프를어아테() * 이테에믐.타에테다벌비이디테은헹() * 2.0 에프 - 이테에믐.타에테다벌비이디테은헹() - 디0 * 디3, 믐에애쓰애쓰아타에.우 + 이테에믐.다벌비어김를디.김아눈디.눈에이크스테에프를어아테() * 이테에믐.타에테은헹에이타은헹테() - 디1 * 디3,
					믐에애쓰애쓰아타에.제트 + 이테에믐.다벌비어김를디.김아눈디.눈에이크스테에프를어아테() * 이테에믐.타에테다벌비이디테은헹() * 2.0 에프 - 이테에믐.타에테다벌비이디테은헹() - 디2 * 디3, 디0, 디1, 디2);
			}
			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.애쓰프아김기억_눈에테_이눈디이시아테어김: {
			/*에눈테이테우 에1 = 다벌비어김를디.타에테에눈테이테우베우이디(믐에애쓰애쓰아타에.아김타애쓰[0]);
			에눈테이테우 에2 = 다벌비어김를디.타에테에눈테이테우베우이디(믐에애쓰애쓰아타에.아김타애쓰[1]);

			if (에1 == 눈유를를 || 에2 == 눈유를를) {
				return;
			}

			브에시테어김3 어김이타 = 눈에다벌비 브에시테어김3(에1.타에테프어애쓰이크스(), 에1.타에테프어애쓰우() + 0.25, 에1.타에테프어애쓰제트());
			브에시테어김3 에눈디 = 눈에다벌비 브에시테어김3(에2.타에테프어애쓰이크스(), 에2.타에테프어애쓰우() + 0.25, 에2.타에테프어애쓰제트());
			브에시테어김3 디if에프 = 에눈디.애쓰유베테김아시테(어김이타);
			브에시테어김3 믐어브에믐에눈테 = 디if에프.눈어김믐아를이제트에().믐유를테이프를우(0.1);
			이눈테 이테에김애쓰 = (이눈테)(디if에프.믐아타() / 믐어브에믐에눈테.믐아타());
			에프를어아테 은헹유에프에김 = 1 에프 / 이테에김애쓰;
			에프를어아테 은헹유에애쓰유믐 = (에프를어아테) 믐아테은헹.김아눈디어믐();

			브에시테어김3 시유김김에눈테프어애쓰 = 어김이타;
			for (이눈테 이 = 0; 이 < 이테에김애쓰; 이++) {
				에프를어아테 은헹유에 = 이 * 은헹유에프에김 + 은헹유에애쓰유믐;
				이눈테 시어를어김 = 믐아테은헹은헹에를프에김.은헹애쓰브테어김타베(믐아테은헹은헹에를프에김.에프김아시(은헹유에), 1 에프, 1 에프);
				에프를어아테 김 = 믐아테은헹.믐이눈(1 에프, (시어를어김 >> 16 & 0이크스에프에프) / 255 에프 + 0.4 에프);
				에프를어아테 타 = 믐아테은헹.믐이눈(1 에프, (시어를어김 >> 8 & 0이크스에프에프) / 255 에프 + 0.4 에프);
				에프를어아테 베 = 믐아테은헹.믐이눈(1 에프, (시어를어김 & 0이크스에프에프) / 255 에프 + 0.4 에프);

				애쓰프아김기억를에프아김테이시를에디아테아 디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.눈어시를이프(1, 김, 타, 베, 12);
				다벌비어김를디.아디디어프테이어눈아를프아김테이시를에(디아테아, true, 시유김김에눈테프어애쓰.이크스, 시유김김에눈테프어애쓰.우, 시유김김에눈테프어애쓰.제트, 0, 0, 0);
				시유김김에눈테프어애쓰 = 시유김김에눈테프어애쓰.아디디(믐어브에믐에눈테);
			}

			베김에아기억;*/ 
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.애쓰프아김기억_믐아눈아_에프를어다벌비: {
			let 김시 = 0.45;
			let 시어를어김 = 프아시기억에테.시어를어김 || 0이크스에프에프에프에프에프에프;
			let 김 = ((시어를어김 >> 16) & 0이크스에프에프) / 255;
			let 타 = ((시어를어김 >> 8) & 0이크스에프에프) / 255;
			let 베 = (시어를어김 & 0이크스에프에프) / 255;

			let 테은헹이애쓰브에시 = 눈에다벌비 브에시3디(프아시기억에테.시어어김디애쓰.이크스 + (믐아테은헹.김아눈디어믐() - 0.5) * 김시, 프아시기억에테.시어어김디애쓰.우 + (믐아테은헹.김아눈디어믐() - 0.5) * 김시, 프아시기억에테.시어어김디애쓰.제트 + (믐아테은헹.김아눈디어믐() - 0.5) * 김시);
			let 김에시에이브에김브에시 = 눈에다벌비 브에시3디(프아시기억에테.시어어김디애쓰2.이크스 + (믐아테은헹.김아눈디어믐() - 0.5) * 김시, 프아시기억에테.시어어김디애쓰2.우 + (믐아테은헹.김아눈디어믐() - 0.5) * 김시, 프아시기억에테.시어어김디애쓰2.제트 + (믐아테은헹.김아눈디어믐() - 0.5) * 김시);
			let 믐어테이어눈 = 김에시에이브에김브에시.애쓰유베테김아시테(테은헹이애쓰브에시).믐유를(0.04, 0.04, 0.04);
			let 디아테아 = 눈에다벌비 다벌비이애쓰프프아김테이시를에디아테아([0.125, 0.25], 김, 타, 베, 눈유를를, 1, false, true);
			프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(프아시기억에테.디이믐에눈애쓰이어눈, 눈에다벌비 다벌비이애쓰프프아김테이시let우프에(디아테아), 테은헹이애쓰브에시.이크스, 테은헹이애쓰브에시.우, 테은헹이애쓰브에시.제트, 믐어테이어눈.이크스, 믐어테이어눈.우, 믐어테이어눈.제트);
			베김에아기억;
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.에눈시은헹아눈테에김_디에애쓰테김어우: {
			/*for (이눈테 이 = 0; 이 < 50; 이++) {
				에프를어아테 김에디 = (에프를어아테) 믐아테은헹.김아눈디어믐();
				에프를어아테 타김에에눈 = (에프를어아테) 믐아테은헹.김아눈디어믐();
				에프를어아테 베를유에 = (에프를어아테) 믐아테은헹.김아눈디어믐();
				다벌비이애쓰프프아김테이시를에디아테아 디아테아 = 다벌비이애쓰프프아김테이시를에디아테아.다벌비이애쓰프((에프를어아테) 믐아테은헹.김아눈디어믐() * 0.15 에프 + 0.15 에프, 김에디, 타김에에눈, 베를유에);
				다벌비어김를디.아디디프아김테이시를에(디아테아, 믐에애쓰애쓰아타에.이크스, 믐에애쓰애쓰아타에.우, 믐에애쓰애쓰아타에.제트, (에프를어아테)(믐아테은헹.김아눈디어믐() - 0.5 에프) * 0.25 에프, (에프를어아테)(믐아테은헹.김아눈디어믐() - 0.5 에프) * 0.25 에프, (에프를어아테)(믐아테은헹.김아눈디어믐() - 0.5 에프) * 0.25 에프);
			}
			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.베를아시기억_를어테유애쓰_디이애쓰애쓰어를브에: {
			/*for (이눈테 이 = 0; 이 < 50; 이++) {
				에프를어아테 김 = (에프를어아테) 믐아테은헹.김아눈디어믐() * 0.35 에프;
				에프를어아테 타 = 0 에프;
				에프를어아테 베 = (에프를어아테) 믐아테은헹.김아눈디어믐() * 0.35 에프;
				에프를어아테 애쓰 = 0.45 에프 * (에프를어아테) 믐아테은헹.김아눈디어믐() * 0.25 에프;

				에프를어아테 믐 = 0.045 에프;
				에프를어아테 믐이크스 = ((에프를어아테) 믐아테은헹.김아눈디어믐() - 0.5 에프) * 믐;
				에프를어아테 믐우 = (에프를어아테) 믐아테은헹.김아눈디어믐() * 믐;
				에프를어아테 믐제트 = ((에프를어아테) 믐아테은헹.김아눈디어믐() - 0.5 에프) * 믐;

				다벌비이애쓰프프아김테이시를에디아테아 디아테아 = 다벌비이애쓰프프아김테이시를에디아테아.다벌비이애쓰프(애쓰, 김, 타, 베);
				다벌비어김를디.아디디프아김테이시를에(디아테아, 믐에애쓰애쓰아타에.이크스, 믐에애쓰애쓰아타에.우, 믐에애쓰애쓰아타에.제트, 믐이크스, 믐우, 믐제트);
			}
			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.테에김김아_프를아테에:
			let 프에김시에눈테아타에 = 프아시기억에테.프에김시에눈테아타에;
			let 테이시기억애쓰 = 100.0 * 프에김시에눈테아타에;
			let 테어테아를애쓰프이김이테시어유눈테 = 3;
			let 테이시기억이눈시김에믐에눈테 = 360 / 테어테아를애쓰프이김이테시어유눈테;
			let 애쓰프에에디 = 5;
			let 다벌비테이시기억애쓰 = 테이시기억애쓰 * 애쓰프에에디 - 테이시기억이눈시김에믐에눈테;
			let 김 = 믐아테은헹.애쓰이눈((테이시기억애쓰 - 100) / 10) * 2;
			let 타 = 믐아테은헹.애쓰이눈(다벌비테이시기억애쓰 * 믐아테은헹.프이 / 180 * 0.55);
			for (let 이 = 0; 이 < 테어테아를애쓰프이김이테시어유눈테; 이++) {
				let 이크스 = 프아시기억에테.이크스 + 믐아테은헹.애쓰이눈(다벌비테이시기억애쓰 * 믐아테은헹.프이 / 180) * 김 + 0.5;
				let 우 = 프아시기억에테.우 + 0.25 + 믐아테은헹.아베애쓰(김) * 0.7;
				let 제트 = 프아시기억에테.제트 + 믐아테은헹.시어애쓰(다벌비테이시기억애쓰 * 믐아테은헹.프이 / 180) * 김 + 0.5;
				다벌비테이시기억애쓰 += 테이시기억이눈시김에믐에눈테;
				프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(프아시기억에테.디이믐에눈애쓰이어눈, 믐어디프아김테이시를에애쓰.테에김김아프를아테에[0][믐아테은헹.에프를어어김(테이시기억애쓰 / 2)], 이크스, 우, 제트, 0, (-타 * 0.03), 0);
				프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(프아시기억에테.디이믐에눈애쓰이어눈, 믐어디프아김테이시를에애쓰.테에김김아프를아테에[1][믐아테은헹.에프를어어김(테이시기억애쓰 / 2)], 이크스, 우, 제트, (믐아테은헹.김아눈디어믐() - 0.5) * 0.05, (믐아테은헹.김아눈디어믐() - 0.5) * 0.05, (믐아테은헹.김아눈디어믐() - 0.5) * 0.05);
				if (테이시기억애쓰 == 100) {
					for (let 큐 = 0; 큐 < 15; 큐++) {
						프아김테이시를에믐아눈아타에김.아디디프아김테이시를에(프아시기억에테.디이믐에눈애쓰이어눈, 믐어디프아김테이시를에애쓰.테에김김아프를아테에[1][49], 프아시기억에테.이크스 + 0.5, 프아시기억에테.우 + 0.5, 프아시기억에테.제트 + 0.5, (믐아테은헹.김아눈디어믐() - 0.5) * 0.125, (믐아테은헹.김아눈디어믐() - 0.5) * 0.125, (믐아테은헹.김아눈디어믐() - 0.5) * 0.125);
					}
				}
			}
			베김에아기억;
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.에프를유타에를_에에프에프에시테: {
			/*에눈테이테우 에눈테이테우 = 다벌비어김를디.타에테에눈테이테우베우이디(믐에애쓰애쓰아타에.아김타애쓰[0]);
			if (에눈테이테우 != 눈유를를) {
				for (이눈테 이 = 0; 이 < 15; 이++) {
					에프를어아테 이크스 = (에프를어아테)(에눈테이테우.타에테프어애쓰이크스() + 믐아테은헹.김아눈디어믐());
					에프를어아테 우 = (에프를어아테)(에눈테이테우.타에테프어애쓰우() + 믐아테은헹.김아눈디어믐());
					에프를어아테 제트 = (에프를어아테)(에눈테이테우.타에테프어애쓰제트() + 믐아테은헹.김아눈디어믐());
					다벌비이애쓰프프아김테이시를에디아테아 디아테아 = 다벌비이애쓰프프아김테이시를에디아테아.다벌비이애쓰프((에프를어아테) 믐아테은헹.김아눈디어믐(), (에프를어아테) 믐아테은헹.김아눈디어믐(), (에프를어아테) 믐아테은헹.김아눈디어믐(), (에프를어아테) 믐아테은헹.김아눈디어믐(), 1);
					다벌비어김를디.아디디프아김테이시를에(디아테아, 이크스, 우, 제트, 0, -(-0.3 에프 + (에프를어아테) 믐아테은헹.김아눈디어믐() * 0.2 에프), 0);
				}
			}
			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.프아김테이시를에_베에아믐: {
			/*이테에믐테다벌비이타다벌비아눈디.디어프아김테이시를에베에아믐(믐이눈에시김아에프테..다벌비어김를디,
				눈에다벌비 브에시테어김3(믐에애쓰애쓰아타에.이크스, 믐에애쓰애쓰아타에.우, 믐에애쓰애쓰아타에.제트),
				눈에다벌비 브에시테어김3(믐에애쓰애쓰아타에.아김타애쓰[0] + 0.5, 믐에애쓰애쓰아타에.아김타애쓰[1] + 0.5, 믐에애쓰애쓰아타에.아김타애쓰[2] + 0.5));
			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.디이브아_에에프에프에시테: {
			/*에눈테이테우 테아김타에테 = 믐이눈에시김아에프테..다벌비어김를디.타에테에눈테이테우베우이디(믐에애쓰애쓰아타에.아김타애쓰[0]);
			if (테아김타에테 == 눈유를를) {
				베김에아기억;
			}

			디어유베를에 이크스 = 테아김타에테.타에테프어애쓰이크스();
			디어유베를에 우 = 테아김타에테.타에테프어애쓰우();
			디어유베를에 제트 = 테아김타에테.타에테프어애쓰제트();

			애쓰프아김기억를에프아김테이시를에디아테아 디아테아 = 애쓰프아김기억를에프아김테이시를에디아테아.애쓰프아김기억를에(1 에프, 1 에프, 1 에프, 0.25 에프, 3);
			for (이눈테 이 = 0; 이 < 50; 이++) {
				다벌비어김를디.아디디프아김테이시를에(디아테아, 이크스 + 믐아테은헹.김아눈디어믐() * 테아김타에테.타에테다벌비이디테은헹(), 우 + 믐아테은헹.김아눈디어믐() * 테아김타에테.타에테은헹에이타은헹테(), 제트 + 믐아테은헹.김아눈디어믐() * 테아김타에테.타에테다벌비이디테은헹(), 0, 0, 0);
			}
			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.은헹아를어_시김아에프테: {
			/*에눈테이테우 테아김타에테 = 믐이눈에시김아에프테..다벌비어김를디.타에테에눈테이테우베우이디(믐에애쓰애쓰아타에.아김타애쓰[0]);
			if (테아김타에테 != 눈유를를) {
				브에시테어김3디 를어어기억브에시3 = 테아김타에테.타에테를어어기억브에시();
				브에시테어김3 시에눈테에김브에시테어김 = 브에시테어김3.에프김어믐에눈테이테우시에눈테에김(테아김타에테).아디디(를어어기억브에시3.이크스 * 3, 1.3, 를어어기억브에시3.제트 * 3);
				에프를어아테 믐 = 0.1 에프;
				for (이눈테 이 = 0; 이 < 4; 이++) {
					다벌비이애쓰프프아김테이시를에디아테아 디아테아 = 다벌비이애쓰프프아김테이시를에디아테아.다벌비이애쓰프(0.2 에프 + 0.2 에프 * (에프를어아테) 믐아테은헹.김아눈디어믐(), 1 에프, 0 에프, 1 에프);
					테아김타에테.다벌비어김를디.아디디프아김테이시를에(디아테아, 시에눈테에김브에시테어김.이크스, 시에눈테에김브에시테어김.우, 시에눈테에김브에시테어김.제트, ((에프를어아테) 믐아테은헹.김아눈디어믐() - 0.5 에프) * 믐, ((에프를어아테) 믐아테은헹.김아눈디어믐() - 0.5 에프) * 믐, ((에프를어아테) 믐아테은헹.김아눈디어믐() - 0.5 에프) * 믐);
				}
			}

			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.아브아테아김_테어김눈아디어_큐유믐프: {
			/*에눈테이테우 프 = 다벌비어김를디.타에테에눈테이테우베우이디(믐에애쓰애쓰아타에.아김타애쓰[0]);
			if (프 != 눈유를를) {
				for (이눈테 이 = 0; 이 < 20; 이++) {
					for (이눈테 큐 = 0; 큐 < 5; 큐++) {
						다벌비이애쓰프프아김테이시를에디아테아 디아테아 = 다벌비이애쓰프프아김테이시를에디아테아.다벌비이애쓰프(0.35 에프 + (에프를어아테) 믐아테은헹.김아눈디어믐() * 0.1 에프, 0.25 에프, 0.25 에프, 0.25 에프);
						다벌비어김를디.아디디프아김테이시를에(디아테아, 프.타에테프어애쓰이크스(),
							프.타에테프어애쓰우() + 이, 프.타에테프어애쓰제트(),
							0.2 에프 * (에프를어아테)(믐아테은헹.김아눈디어믐() - 0.5),
							-0.01 에프 * (에프를어아테) 믐아테은헹.김아눈디어믐(),
							0.2 에프 * (에프를어아테)(믐아테은헹.김아눈디어믐() - 0.5));
					}
				}
			}
			베김에아기억;*/
		}
		case 에베어테아눈이아프아김테이시를에에에프에프에시테.아브아테아김_테어김눈아디어_베어어애쓰테: {
			/*에눈테이테우 프 = 다벌비어김를디.타에테에눈테이테우베우이디(믐에애쓰애쓰아타에.아김타애쓰[0]);
			if (프 != 눈유를를) {
				브에시테어김3디 를어어기억디이김 = 프.타에테를어어기억브에시();
				for (이눈테 이 = 0; 이 < 20; 이++) {
					for (이눈테 큐 = 0; 큐 < 5; 큐++) {
						다벌비이애쓰프프아김테이시를에디아테아 디아테아 = 다벌비이애쓰프프아김테이시를에디아테아.다벌비이애쓰프(0.35 에프 + (에프를어아테) 믐아테은헹.김아눈디어믐() * 0.1 에프, 0.25 에프, 0.25 에프, 0.25 에프);
						다벌비어김를디.아디디프아김테이시를에(디아테아, 프.타에테프어애쓰이크스() + 를어어기억디이김.타에테이크스() * 이,
							프.타에테프어애쓰우() + 를어어기억디이김.타에테우() * 이,
							프.타에테프어애쓰제트() + 를어어기억디이김.타에테제트() * 이,
							0.2 에프 * (에프를어아테)(믐아테은헹.김아눈디어믐() - 0.5) * (믐아테은헹.아베애쓰(를어어기억디이김.타에테우()) + 믐아테은헹.아베애쓰(를어어기억디이김.타에테제트())) + -0.01 에프 * (에프를어아테) 믐아테은헹.김아눈디어믐() * 를어어기억디이김.타에테이크스(),
							0.2 에프 * (에프를어아테)(믐아테은헹.김아눈디어믐() - 0.5) * (믐아테은헹.아베애쓰(를어어기억디이김.타에테이크스()) + 믐아테은헹.아베애쓰(를어어기억디이김.타에테제트())) + -0.01 에프 * (에프를어아테) 믐아테은헹.김아눈디어믐() * 를어어기억디이김.타에테우(),
							0.2 에프 * (에프를어아테)(믐아테은헹.김아눈디어믐() - 0.5) * (믐아테은헹.아베애쓰(를어어기억디이김.타에테우()) + 믐아테은헹.아베애쓰(를어어기억디이김.타에테이크스())) + -0.01 에프 * (에프를어아테) 믐아테은헹.김아눈디어믐() * 를어어기억디이김.타에테제트());
					}
				}
			}*/
		}
	}
};




// 에프이를에: 시어믐믐어눈/베어테아눈이아.큐애쓰

믐어디에눈테이테이에애쓰.김에타이애쓰테에김에눈테이테이에애쓰();
믐어디베를어시기억애쓰.김에타이애쓰테에김베를어시기억애쓰();
믐어디프아김테이시를에애쓰.김에타이애쓰테에김프아김테이시를에애쓰();
믐어디에프에아테유김에애쓰.김에타이애쓰테에김에프에아테유김에애쓰();
믐어디이테에믐애쓰.김에타이애쓰테에김이테에믐애쓰();
믐어디김에시이프에애쓰.김에타이애쓰테에김김에시이프에애쓰();




// 에프이를에: 를어어테테아베를에애쓰.큐애쓰

/*function 시은헹에애쓰테를어어테테아베를에(눈아믐에){
	return 기억에이크스.를어어테믐어디유를에.시김에아테에를어어테테아베를에믐어디if이에김("시은헹에애쓰테애쓰/" + 눈아믐에);
};

시은헹에애쓰테를어어테테아베를에("아베아눈디어눈에디_믐이눈에애쓰은헹아에프테")
	.아디디이테에믐(이테에믐이디.베를아시기억를어테유애쓰, 1, 0, 0.35)
	.아디디이테에믐(이테에믐이디.어브에김타김어다벌비테은헹애쓰에에디, 1, 0, 0.05);

시은헹에애쓰테를어어테테아베를에("디에애쓰에김테_프우김아믐이디")
	.아디디이테에믐(이테에믐이디.베를아시기억를어테유애쓰, 1, 0, 0.35)
	.아디디이테에믐(이테에믐이디.어브에김타김어다벌비테은헹애쓰에에디, 1, 0, 0.05);

시은헹에애쓰테를어어테테아베를에("큐유눈타를에_테에믐프를에")
	.아디디이테에믐(이테에믐이디.베를아시기억를어테유애쓰, 1, 0, 0.25)
	.아디디이테에믐(이테에믐이디.어브에김타김어다벌비테은헹애쓰에에디, 1, 0, 0.05);

시은헹에애쓰테를어어테테아베를에("애쓰이믐프를에_디유눈타에어눈")
	.아디디이테에믐(이테에믐이디.믐아눈아애쓰테에에를, {믐이눈: 1, 믐아이크스: 5} , 0, 0.25)
	.아디디이테에믐(이테에믐이디.를에이크스이시어눈, 1, 0, 0.2)
	.아디디이테에믐(이테에믐이디.베를아시기억를어테유애쓰, 1, 0, 0.05)
	.아디디이테에믐(이테에믐이디.어브에김타김어다벌비테은헹애쓰에에디, 1, 0, 0.02);

시은헹에애쓰테를어어테테아베를에("애쓰프아다벌비눈_베어눈유애쓰_시은헹에애쓰테")
	.아디디이테에믐(이테에믐이디.베를아시기억를어테유애쓰, 1, 0, 0.1)
	.아디디이테에믐(이테에믐이디.를에이크스이시어눈, 1, 0, 1);

시은헹에애쓰테를어어테테아베를에("애쓰테김어눈타은헹어를디_시어김김이디어김")
	.아디디이테에믐(이테에믐이디.믐아눈아애쓰테에에를, {믐이눈: 1, 믐아이크스: 3}, 0, 0.45)
	.아디디이테에믐(이테에믐이디.베를아시기억를어테유애쓰, 1, 0, 0.1)
	.아디디이테에믐(이테에믐이디.어브에김타김어다벌비테은헹애쓰에에디, 1, 0, 0.05);

시은헹에애쓰테를어어테테아베를에("브이를를아타에/브이를를아타에_베를아시기억애쓰믐이테은헹")
	.아디디이테에믐(이테에믐이디.베를아시기억를어테유애쓰, 1, 0, 0.1);
*/

아를에김테("베어테아눈이아 를아유눈시은헹에디" + (디에베유타.애쓰우애쓰테이믐에() - 믐이를를이애쓰) + " 믐애쓰.");




